; ModuleID = 'cBench/security_rijndael_d/src/aesxam.c'
source_filename = "cBench/security_rijndael_d/src/aesxam.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.aes = type { i64, i64, [64 x i64], [64 x i64], i8 }

@fillrand.a = internal global [2 x i64] zeroinitializer, align 16, !dbg !0
@fillrand.mt = internal global i64 1, align 8, !dbg !52
@fillrand.count = internal global i64 4, align 8, !dbg !54
@fillrand.r = internal global [4 x i8] zeroinitializer, align 1, !dbg !56
@.str = private unnamed_addr constant [34 x i8] c"Error writing to output file: %s\0A\00", align 1, !dbg !58
@.str.1 = private unnamed_addr constant [35 x i8] c"Error reading from input file: %s\0A\00", align 1, !dbg !63
@.str.2 = private unnamed_addr constant [27 x i8] c"\0AThe input file is corrupt\00", align 1, !dbg !68
@.str.3 = private unnamed_addr constant [59 x i8] c"usage: rijndael in_filename out_filename [d/e] key_in_hex\0A\00", align 1, !dbg !73
@.str.4 = private unnamed_addr constant [37 x i8] c"key must be in hexadecimal notation\0A\00", align 1, !dbg !78
@.str.5 = private unnamed_addr constant [27 x i8] c"The key value is too long\0A\00", align 1, !dbg !83
@.str.6 = private unnamed_addr constant [56 x i8] c"The key length must be 32, 48 or 64 hexadecimal digits\0A\00", align 1, !dbg !85
@.str.7 = private unnamed_addr constant [3 x i8] c"rb\00", align 1, !dbg !90

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "a", scope: !2, file: !3, line: 74, type: !108, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "fillrand", scope: !3, file: !3, line: 73, type: !4, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !107)
!3 = !DIFile(filename: "cBench/security_rijndael_d/src/aesxam.c", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "e37ed3dc4e3af9ffa49975a5e9c20526")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !8}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !10, retainedTypes: !18, globals: !51, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11}
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "aes_key", file: !12, line: 277, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "cBench/security_rijndael_d/src/aes.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "4959970e1b908fe264ed472fd225ff4c")
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "enc", value: 1)
!16 = !DIEnumerator(name: "dec", value: 2)
!17 = !DIEnumerator(name: "both", value: 3)
!18 = !{!19, !21, !7, !46, !50, !20}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !23, line: 84, baseType: !24)
!23 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fpos_t", file: !25, line: 14, baseType: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__fpos_t.h", directory: "", checksumkind: CSK_MD5, checksum: "32de8bdaf3551a6c0a9394f9af4389ce")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_G_fpos_t", file: !25, line: 10, size: 128, elements: !27)
!27 = !{!28, !32}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__pos", scope: !26, file: !25, line: 12, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 152, baseType: !31)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!31 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !26, file: !25, line: 13, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !34, line: 21, baseType: !35)
!34 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 13, size: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !35, file: !34, line: 15, baseType: !8, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !35, file: !34, line: 20, baseType: !39, size: 32, offset: 32)
!39 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !35, file: !34, line: 16, size: 32, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !39, file: !34, line: 18, baseType: !13, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !39, file: !34, line: 19, baseType: !43, size: 32)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 4)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !12, line: 223, baseType: !49)
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!51 = !{!0, !52, !54, !56, !58, !63, !68, !73, !78, !83, !85, !90, !95, !100, !102}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "mt", scope: !2, file: !3, line: 74, type: !20, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "count", scope: !2, file: !3, line: 74, type: !20, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "r", scope: !2, file: !3, line: 75, type: !43, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(scope: null, file: !3, line: 127, type: !60, isLocal: true, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 272, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 34)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(scope: null, file: !3, line: 169, type: !65, isLocal: true, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 280, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 35)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(scope: null, file: !3, line: 177, type: !70, isLocal: true, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 216, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 27)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(scope: null, file: !3, line: 243, type: !75, isLocal: true, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 472, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 59)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(scope: null, file: !3, line: 259, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 296, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 37)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(scope: null, file: !3, line: 270, type: !70, isLocal: true, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(scope: null, file: !3, line: 275, type: !87, isLocal: true, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 448, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 56)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(scope: null, file: !3, line: 281, type: !92, isLocal: true, isDefinition: true)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 3)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(scope: null, file: !3, line: 283, type: !97, isLocal: true, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 320, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 40)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(scope: null, file: !3, line: 287, type: !92, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !3, line: 289, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 328, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 41)
!107 = !{}
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 2)
!111 = !{i32 7, !"Dwarf Version", i32 5}
!112 = !{i32 2, !"Debug Info Version", i32 3}
!113 = !{i32 1, !"wchar_size", i32 4}
!114 = !{i32 8, !"PIC Level", i32 2}
!115 = !{i32 7, !"PIE Level", i32 2}
!116 = !{i32 7, !"uwtable", i32 2}
!117 = !{i32 7, !"frame-pointer", i32 2}
!118 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!119 = !DILocalVariable(name: "buf", arg: 1, scope: !2, file: !3, line: 73, type: !6)
!120 = !DILocation(line: 73, column: 21, scope: !2)
!121 = !DILocalVariable(name: "len", arg: 2, scope: !2, file: !3, line: 73, type: !8)
!122 = !DILocation(line: 73, column: 30, scope: !2)
!123 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 76, type: !8)
!124 = !DILocation(line: 76, column: 26, scope: !2)
!125 = !DILocation(line: 78, column: 8, scope: !126)
!126 = distinct !DILexicalBlock(scope: !2, file: !3, line: 78, column: 8)
!127 = !DILocation(line: 79, column: 6, scope: !128)
!128 = distinct !DILexicalBlock(scope: !126, file: !3, line: 78, column: 12)
!129 = !DILocation(line: 81, column: 11, scope: !128)
!130 = !DILocation(line: 82, column: 7, scope: !128)
!131 = !DILocation(line: 83, column: 5, scope: !128)
!132 = !DILocation(line: 85, column: 11, scope: !133)
!133 = distinct !DILexicalBlock(scope: !2, file: !3, line: 85, column: 5)
!134 = !DILocation(line: 85, column: 9, scope: !133)
!135 = !DILocation(line: 85, column: 16, scope: !136)
!136 = distinct !DILexicalBlock(scope: !133, file: !3, line: 85, column: 5)
!137 = !DILocation(line: 85, column: 20, scope: !136)
!138 = !DILocation(line: 85, column: 18, scope: !136)
!139 = !DILocation(line: 85, column: 5, scope: !133)
!140 = !DILocation(line: 87, column: 12, scope: !141)
!141 = distinct !DILexicalBlock(scope: !142, file: !3, line: 87, column: 12)
!142 = distinct !DILexicalBlock(scope: !136, file: !3, line: 86, column: 5)
!143 = !DILocation(line: 87, column: 18, scope: !141)
!144 = !DILocation(line: 89, column: 34, scope: !145)
!145 = distinct !DILexicalBlock(scope: !141, file: !3, line: 88, column: 9)
!146 = !DILocation(line: 89, column: 32, scope: !145)
!147 = !DILocation(line: 90, column: 19, scope: !145)
!148 = !DILocation(line: 91, column: 9, scope: !145)
!149 = !DILocation(line: 93, column: 25, scope: !142)
!150 = !DILocation(line: 93, column: 18, scope: !142)
!151 = !DILocation(line: 93, column: 9, scope: !142)
!152 = !DILocation(line: 93, column: 13, scope: !142)
!153 = !DILocation(line: 93, column: 16, scope: !142)
!154 = !DILocation(line: 94, column: 5, scope: !142)
!155 = !DILocation(line: 85, column: 25, scope: !136)
!156 = !DILocation(line: 85, column: 5, scope: !136)
!157 = distinct !{!157, !139, !158, !159}
!158 = !DILocation(line: 94, column: 5, scope: !133)
!159 = !{!"llvm.loop.mustprogress"}
!160 = !DILocation(line: 95, column: 1, scope: !2)
!161 = distinct !DISubprogram(name: "encfile", scope: !3, file: !3, line: 97, type: !162, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !107)
!162 = !DISubroutineType(types: !163)
!163 = !{!8, !164, !164, !220, !6}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !166, line: 7, baseType: !167)
!166 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !168, line: 49, size: 1728, elements: !169)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !185, !187, !188, !189, !190, !192, !194, !198, !201, !203, !206, !209, !210, !212, !215, !216}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !167, file: !168, line: 51, baseType: !8, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !167, file: !168, line: 54, baseType: !6, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !167, file: !168, line: 55, baseType: !6, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !167, file: !168, line: 56, baseType: !6, size: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !167, file: !168, line: 57, baseType: !6, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !167, file: !168, line: 58, baseType: !6, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !167, file: !168, line: 59, baseType: !6, size: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !167, file: !168, line: 60, baseType: !6, size: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !167, file: !168, line: 61, baseType: !6, size: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !167, file: !168, line: 64, baseType: !6, size: 64, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !167, file: !168, line: 65, baseType: !6, size: 64, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !167, file: !168, line: 66, baseType: !6, size: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !167, file: !168, line: 68, baseType: !183, size: 64, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !168, line: 36, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !167, file: !168, line: 70, baseType: !186, size: 64, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !167, file: !168, line: 72, baseType: !8, size: 32, offset: 896)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !167, file: !168, line: 73, baseType: !8, size: 32, offset: 928)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !167, file: !168, line: 74, baseType: !29, size: 64, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !167, file: !168, line: 77, baseType: !191, size: 16, offset: 1024)
!191 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !167, file: !168, line: 78, baseType: !193, size: 8, offset: 1040)
!193 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !167, file: !168, line: 79, baseType: !195, size: 8, offset: 1048)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 1)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !167, file: !168, line: 81, baseType: !199, size: 64, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !168, line: 43, baseType: null)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !167, file: !168, line: 89, baseType: !202, size: 64, offset: 1152)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 153, baseType: !31)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !167, file: !168, line: 91, baseType: !204, size: 64, offset: 1216)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !168, line: 37, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !167, file: !168, line: 92, baseType: !207, size: 64, offset: 1280)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !168, line: 38, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !167, file: !168, line: 93, baseType: !186, size: 64, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !167, file: !168, line: 94, baseType: !211, size: 64, offset: 1408)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !167, file: !168, line: 95, baseType: !213, size: 64, offset: 1472)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !214, line: 18, baseType: !20)
!214 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !167, file: !168, line: 96, baseType: !8, size: 32, offset: 1536)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !167, file: !168, line: 98, baseType: !217, size: 160, offset: 1568)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 20)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "aes", file: !12, line: 305, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 295, size: 8384, elements: !223)
!223 = !{!224, !226, !227, !231, !232}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Nkey", scope: !222, file: !12, line: 297, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "word", file: !12, line: 224, baseType: !20)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Nrnd", scope: !222, file: !12, line: 298, baseType: !225, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "e_key", scope: !222, file: !12, line: 299, baseType: !228, size: 4096, offset: 128)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 4096, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "d_key", scope: !222, file: !12, line: 300, baseType: !228, size: 4096, offset: 4224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !222, file: !12, line: 304, baseType: !48, size: 8, offset: 8320)
!233 = !DILocalVariable(name: "fin", arg: 1, scope: !161, file: !3, line: 97, type: !164)
!234 = !DILocation(line: 97, column: 19, scope: !161)
!235 = !DILocalVariable(name: "fout", arg: 2, scope: !161, file: !3, line: 97, type: !164)
!236 = !DILocation(line: 97, column: 30, scope: !161)
!237 = !DILocalVariable(name: "ctx", arg: 3, scope: !161, file: !3, line: 97, type: !220)
!238 = !DILocation(line: 97, column: 41, scope: !161)
!239 = !DILocalVariable(name: "fn", arg: 4, scope: !161, file: !3, line: 97, type: !6)
!240 = !DILocation(line: 97, column: 52, scope: !161)
!241 = !DILocalVariable(name: "inbuf", scope: !161, file: !3, line: 98, type: !242)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 16)
!245 = !DILocation(line: 98, column: 21, scope: !161)
!246 = !DILocalVariable(name: "outbuf", scope: !161, file: !3, line: 98, type: !242)
!247 = !DILocation(line: 98, column: 32, scope: !161)
!248 = !DILocalVariable(name: "flen", scope: !161, file: !3, line: 101, type: !20)
!249 = !DILocation(line: 101, column: 21, scope: !161)
!250 = !DILocalVariable(name: "i", scope: !161, file: !3, line: 102, type: !20)
!251 = !DILocation(line: 102, column: 21, scope: !161)
!252 = !DILocalVariable(name: "l", scope: !161, file: !3, line: 102, type: !20)
!253 = !DILocation(line: 102, column: 26, scope: !161)
!254 = !DILocation(line: 104, column: 14, scope: !161)
!255 = !DILocation(line: 104, column: 5, scope: !161)
!256 = !DILocation(line: 105, column: 11, scope: !161)
!257 = !DILocation(line: 105, column: 5, scope: !161)
!258 = !DILocation(line: 106, column: 13, scope: !161)
!259 = !DILocation(line: 106, column: 5, scope: !161)
!260 = !DILocation(line: 107, column: 11, scope: !161)
!261 = !DILocation(line: 107, column: 5, scope: !161)
!262 = !DILocation(line: 108, column: 12, scope: !161)
!263 = !DILocation(line: 108, column: 27, scope: !161)
!264 = !DILocation(line: 108, column: 5, scope: !161)
!265 = !DILocation(line: 109, column: 14, scope: !161)
!266 = !DILocation(line: 109, column: 5, scope: !161)
!267 = !DILocation(line: 110, column: 7, scope: !161)
!268 = !DILocation(line: 112, column: 23, scope: !161)
!269 = !DILocation(line: 112, column: 17, scope: !161)
!270 = !DILocation(line: 112, column: 28, scope: !161)
!271 = !DILocation(line: 112, column: 37, scope: !161)
!272 = !DILocation(line: 112, column: 46, scope: !161)
!273 = !DILocation(line: 112, column: 34, scope: !161)
!274 = !DILocation(line: 112, column: 16, scope: !161)
!275 = !DILocation(line: 112, column: 5, scope: !161)
!276 = !DILocation(line: 112, column: 14, scope: !161)
!277 = !DILocation(line: 114, column: 5, scope: !161)
!278 = !DILocation(line: 114, column: 17, scope: !161)
!279 = !DILocation(line: 114, column: 12, scope: !161)
!280 = !DILocation(line: 114, column: 11, scope: !161)
!281 = !DILocation(line: 116, column: 19, scope: !282)
!282 = distinct !DILexicalBlock(scope: !161, file: !3, line: 115, column: 5)
!283 = !DILocation(line: 116, column: 25, scope: !282)
!284 = !DILocation(line: 116, column: 32, scope: !282)
!285 = !DILocation(line: 116, column: 30, scope: !282)
!286 = !DILocation(line: 116, column: 38, scope: !282)
!287 = !DILocation(line: 116, column: 41, scope: !282)
!288 = !DILocation(line: 116, column: 13, scope: !282)
!289 = !DILocation(line: 116, column: 11, scope: !282)
!290 = !DILocation(line: 118, column: 12, scope: !291)
!291 = distinct !DILexicalBlock(scope: !282, file: !3, line: 118, column: 12)
!292 = !DILocation(line: 118, column: 16, scope: !291)
!293 = !DILocation(line: 118, column: 14, scope: !291)
!294 = !DILocation(line: 118, column: 19, scope: !291)
!295 = !DILocation(line: 120, column: 15, scope: !296)
!296 = distinct !DILexicalBlock(scope: !282, file: !3, line: 120, column: 9)
!297 = !DILocation(line: 120, column: 13, scope: !296)
