; ModuleID = 'cBench/bzip2d/src/bzlib.c'
source_filename = "cBench/bzip2d/src/bzlib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bz_stream = type { ptr, i32, i32, i32, ptr, i32, i32, i32, ptr, ptr, ptr, ptr }
%struct.EState = type { ptr, i32, i32, i32, ptr, ptr, ptr, i32, ptr, ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }
%struct.DState = type { ptr, i32, i8, i32, i8, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, [256 x i32], i32, [257 x i32], [257 x i32], ptr, ptr, ptr, i32, i32, i32, i32, i32, [256 x i8], [16 x i8], [256 x i8], [4096 x i8], [16 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [6 x [258 x i32]], [6 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr }
%struct.bzFile = type { ptr, [5000 x i8], i32, i8, %struct.bz_stream, i32, i8 }

@stderr = external global ptr, align 8

!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "cBench/bzip2d/src/bzlib.c", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "ec90242be73376cd548c04106e63b935")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3544, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 443)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8456, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 1057)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 826, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 18)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 828, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 2)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 844, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 55)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1367, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 19)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "bzerrorstrings", scope: !34, file: !2, line: 1538, type: !220, isLocal: true, isDefinition: true)
!34 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !52, globals: !162, splitDebugInlining: false, nameTableKind: None)
!35 = !{!36}
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 46, baseType: !38, size: 32, elements: !39)
!37 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!40 = !DIEnumerator(name: "_ISupper", value: 256)
!41 = !DIEnumerator(name: "_ISlower", value: 512)
!42 = !DIEnumerator(name: "_ISalpha", value: 1024)
!43 = !DIEnumerator(name: "_ISdigit", value: 2048)
!44 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!45 = !DIEnumerator(name: "_ISspace", value: 8192)
!46 = !DIEnumerator(name: "_ISprint", value: 16384)
!47 = !DIEnumerator(name: "_ISgraph", value: 32768)
!48 = !DIEnumerator(name: "_ISblank", value: 1)
!49 = !DIEnumerator(name: "_IScntrl", value: 2)
!50 = !DIEnumerator(name: "_ISpunct", value: 4)
!51 = !DIEnumerator(name: "_ISalnum", value: 8)
!52 = !{!53, !54, !58, !61, !63, !64, !62, !55, !135, !76, !60}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !56, line: 43, baseType: !57)
!56 = !DIFile(filename: "cBench/bzip2d/src/bzlib_private.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "bfed76561f91640219b2449176b548a6")
!57 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !56, line: 47, baseType: !60)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !56, line: 45, baseType: !38)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !56, line: 42, baseType: !57)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "bzFile", file: !2, line: 901, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 892, size: 40832, elements: !67)
!67 = !{!68, !129, !134, !136, !137, !160, !161}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !66, file: !2, line: 893, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !71, line: 7, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !73, line: 49, size: 1728, elements: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!74 = !{!75, !77, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !92, !94, !95, !96, !100, !101, !103, !107, !110, !112, !115, !118, !119, !120, !124, !125}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !72, file: !73, line: 51, baseType: !76, size: 32)
!76 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !72, file: !73, line: 54, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !72, file: !73, line: 55, baseType: !78, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !72, file: !73, line: 56, baseType: !78, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !72, file: !73, line: 57, baseType: !78, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !72, file: !73, line: 58, baseType: !78, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !72, file: !73, line: 59, baseType: !78, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !72, file: !73, line: 60, baseType: !78, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !72, file: !73, line: 61, baseType: !78, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !72, file: !73, line: 64, baseType: !78, size: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !72, file: !73, line: 65, baseType: !78, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !72, file: !73, line: 66, baseType: !78, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !72, file: !73, line: 68, baseType: !90, size: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !73, line: 36, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !72, file: !73, line: 70, baseType: !93, size: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !72, file: !73, line: 72, baseType: !76, size: 32, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !72, file: !73, line: 73, baseType: !76, size: 32, offset: 928)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !72, file: !73, line: 74, baseType: !97, size: 64, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !98, line: 152, baseType: !99)
!98 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!99 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !72, file: !73, line: 77, baseType: !60, size: 16, offset: 1024)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !72, file: !73, line: 78, baseType: !102, size: 8, offset: 1040)
!102 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !72, file: !73, line: 79, baseType: !104, size: 8, offset: 1048)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 1)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !72, file: !73, line: 81, baseType: !108, size: 64, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !73, line: 43, baseType: null)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !72, file: !73, line: 89, baseType: !111, size: 64, offset: 1152)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !98, line: 153, baseType: !99)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !72, file: !73, line: 91, baseType: !113, size: 64, offset: 1216)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !73, line: 37, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !72, file: !73, line: 92, baseType: !116, size: 64, offset: 1280)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !73, line: 38, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !72, file: !73, line: 93, baseType: !93, size: 64, offset: 1344)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !72, file: !73, line: 94, baseType: !53, size: 64, offset: 1408)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !72, file: !73, line: 95, baseType: !121, size: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 18, baseType: !123)
!122 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!123 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !72, file: !73, line: 96, baseType: !76, size: 32, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !72, file: !73, line: 98, baseType: !126, size: 160, offset: 1568)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 20)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !66, file: !2, line: 894, baseType: !130, size: 40000, offset: 64)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 40000, elements: !132)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !56, line: 41, baseType: !4)
!132 = !{!133}
!133 = !DISubrange(count: 5000)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "bufN", scope: !66, file: !2, line: 895, baseType: !135, size: 32, offset: 40064)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !56, line: 44, baseType: !76)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !66, file: !2, line: 896, baseType: !63, size: 8, offset: 40096)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !66, file: !2, line: 897, baseType: !138, size: 640, offset: 40128)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !139, line: 66, baseType: !140)
!139 = !DIFile(filename: "cBench/bzip2d/src/bzlib.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "ff95ae51581c053e153e662775fd03d4")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 49, size: 640, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !155, !159}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !140, file: !139, line: 50, baseType: !78, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !140, file: !139, line: 51, baseType: !38, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !140, file: !139, line: 52, baseType: !38, size: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !140, file: !139, line: 53, baseType: !38, size: 32, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !140, file: !139, line: 55, baseType: !78, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !140, file: !139, line: 56, baseType: !38, size: 32, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !140, file: !139, line: 57, baseType: !38, size: 32, offset: 288)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !140, file: !139, line: 58, baseType: !38, size: 32, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !139, line: 60, baseType: !53, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !140, file: !139, line: 62, baseType: !152, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!53, !53, !76, !76}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !140, file: !139, line: 63, baseType: !156, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !53, !53}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !140, file: !139, line: 64, baseType: !53, size: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "lastErr", scope: !66, file: !2, line: 898, baseType: !135, size: 32, offset: 40768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "initialisedOk", scope: !66, file: !2, line: 899, baseType: !63, size: 8, offset: 40800)
!162 = !{!0, !7, !12, !17, !22, !27, !163, !165, !167, !169, !171, !176, !181, !186, !191, !196, !201, !206, !208, !213, !215, !32}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1416, type: !19, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1416, type: !19, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1417, type: !19, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1420, type: !104, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1539, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 3)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1540, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 15)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1541, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 12)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1542, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 10)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1543, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 11)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1544, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 17)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1545, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 9)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1546, type: !178, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1547, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 13)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1548, type: !210, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1549, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 4)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 1024, elements: !223)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!223 = !{!224}
!224 = !DISubrange(count: 16)
!225 = !{i32 7, !"Dwarf Version", i32 5}
!226 = !{i32 2, !"Debug Info Version", i32 3}
!227 = !{i32 1, !"wchar_size", i32 4}
!228 = !{i32 8, !"PIC Level", i32 2}
!229 = !{i32 7, !"PIE Level", i32 2}
!230 = !{i32 7, !"uwtable", i32 2}
!231 = !{i32 7, !"frame-pointer", i32 2}
!232 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!233 = distinct !DISubprogram(name: "BZ2_bz__AssertH__fail", scope: !2, file: !2, line: 41, type: !234, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !34, retainedNodes: !236)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !76}
!236 = !{}
!237 = !DILocalVariable(name: "errcode", arg: 1, scope: !233, file: !2, line: 41, type: !76)
!238 = !DILocation(line: 41, column: 34, scope: !233)
!239 = !DILocation(line: 43, column: 12, scope: !233)
!240 = !DILocation(line: 52, column: 7, scope: !233)
!241 = !DILocation(line: 53, column: 7, scope: !233)
!242 = !DILocation(line: 43, column: 4, scope: !233)
!243 = !DILocation(line: 56, column: 8, scope: !244)
!244 = distinct !DILexicalBlock(scope: !233, file: !2, line: 56, column: 8)
!245 = !DILocation(line: 56, column: 16, scope: !244)
!246 = !DILocation(line: 57, column: 12, scope: !247)
!247 = distinct !DILexicalBlock(scope: !244, file: !2, line: 56, column: 25)
!248 = !DILocation(line: 57, column: 4, scope: !247)
!249 = !DILocation(line: 82, column: 4, scope: !247)
!250 = !DILocation(line: 84, column: 4, scope: !233)
!251 = distinct !DISubprogram(name: "BZ2_bzlibVersion", scope: !2, file: !2, line: 1365, type: !252, scopeLine: 1366, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !34)
!252 = !DISubroutineType(types: !253)
!253 = !{!221}
!254 = !DILocation(line: 1367, column: 4, scope: !251)
!255 = distinct !DISubprogram(name: "BZ2_bzCompressInit", scope: !2, file: !2, line: 148, type: !256, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !34, retainedNodes: !236)
!256 = !DISubroutineType(types: !257)
!257 = !{!76, !258, !76, !76, !76}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!259 = !DILocalVariable(name: "strm", arg: 1, scope: !255, file: !2, line: 149, type: !258)
!260 = !DILocation(line: 149, column: 34, scope: !255)
!261 = !DILocalVariable(name: "blockSize100k", arg: 2, scope: !255, file: !2, line: 150, type: !76)
!262 = !DILocation(line: 150, column: 33, scope: !255)
!263 = !DILocalVariable(name: "verbosity", arg: 3, scope: !255, file: !2, line: 151, type: !76)
!264 = !DILocation(line: 151, column: 33, scope: !255)
!265 = !DILocalVariable(name: "workFactor", arg: 4, scope: !255, file: !2, line: 152, type: !76)
!266 = !DILocation(line: 152, column: 33, scope: !255)
!267 = !DILocalVariable(name: "n", scope: !255, file: !2, line: 154, type: !135)
!268 = !DILocation(line: 154, column: 12, scope: !255)
!269 = !DILocalVariable(name: "s", scope: !255, file: !2, line: 155, type: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !56, line: 266, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 197, size: 446144, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !300, !302, !303, !304, !305, !306, !307, !308, !309, !310, !314, !318, !319, !323, !325, !326}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !272, file: !56, line: 199, baseType: !258, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !272, file: !56, line: 203, baseType: !135, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !272, file: !56, line: 204, baseType: !135, size: 32, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !272, file: !56, line: 207, baseType: !62, size: 32, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !272, file: !56, line: 210, baseType: !61, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !272, file: !56, line: 211, baseType: !61, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !272, file: !56, line: 212, baseType: !61, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !272, file: !56, line: 213, baseType: !135, size: 32, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !272, file: !56, line: 216, baseType: !61, size: 64, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !272, file: !56, line: 217, baseType: !54, size: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !272, file: !56, line: 218, baseType: !58, size: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !272, file: !56, line: 219, baseType: !54, size: 64, offset: 640)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !272, file: !56, line: 222, baseType: !135, size: 32, offset: 704)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !272, file: !56, line: 225, baseType: !62, size: 32, offset: 736)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !272, file: !56, line: 226, baseType: !135, size: 32, offset: 768)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !272, file: !56, line: 227, baseType: !135, size: 32, offset: 800)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !272, file: !56, line: 227, baseType: !135, size: 32, offset: 832)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !272, file: !56, line: 230, baseType: !135, size: 32, offset: 864)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !272, file: !56, line: 231, baseType: !135, size: 32, offset: 896)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !272, file: !56, line: 232, baseType: !135, size: 32, offset: 928)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !272, file: !56, line: 233, baseType: !135, size: 32, offset: 960)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !272, file: !56, line: 236, baseType: !135, size: 32, offset: 992)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !272, file: !56, line: 237, baseType: !297, size: 2048, offset: 1024)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 2048, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !272, file: !56, line: 238, baseType: !301, size: 2048, offset: 3072)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 2048, elements: !298)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !272, file: !56, line: 241, baseType: !62, size: 32, offset: 5120)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !272, file: !56, line: 242, baseType: !135, size: 32, offset: 5152)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !272, file: !56, line: 245, baseType: !62, size: 32, offset: 5184)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !272, file: !56, line: 246, baseType: !62, size: 32, offset: 5216)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !272, file: !56, line: 249, baseType: !135, size: 32, offset: 5248)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !272, file: !56, line: 250, baseType: !135, size: 32, offset: 5280)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !272, file: !56, line: 251, baseType: !135, size: 32, offset: 5312)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !272, file: !56, line: 254, baseType: !135, size: 32, offset: 5344)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !272, file: !56, line: 255, baseType: !311, size: 8256, offset: 5376)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8256, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 258)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !272, file: !56, line: 256, baseType: !315, size: 144016, offset: 13632)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 144016, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 18002)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !272, file: !56, line: 257, baseType: !315, size: 144016, offset: 157648)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !272, file: !56, line: 259, baseType: !320, size: 12384, offset: 301664)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 12384, elements: !321)
!321 = !{!322, !313}
!322 = !DISubrange(count: 6)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !272, file: !56, line: 260, baseType: !324, size: 49536, offset: 314048)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 49536, elements: !321)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !272, file: !56, line: 261, baseType: !324, size: 49536, offset: 363584)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !272, file: !56, line: 263, baseType: !327, size: 33024, offset: 413120)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 33024, elements: !328)
!328 = !{!313, !219}
!329 = !DILocation(line: 155, column: 12, scope: !255)
!330 = !DILocation(line: 157, column: 9, scope: !331)
!331 = distinct !DILexicalBlock(scope: !255, file: !2, line: 157, column: 8)
!332 = !DILocation(line: 157, column: 8, scope: !331)
!333 = !DILocation(line: 157, column: 25, scope: !331)
!334 = !DILocation(line: 159, column: 8, scope: !335)
!335 = distinct !DILexicalBlock(scope: !255, file: !2, line: 159, column: 8)
!336 = !DILocation(line: 159, column: 13, scope: !335)
!337 = !DILocation(line: 159, column: 21, scope: !335)
!338 = !DILocation(line: 160, column: 8, scope: !335)
!339 = !DILocation(line: 160, column: 22, scope: !335)
!340 = !DILocation(line: 160, column: 26, scope: !335)
!341 = !DILocation(line: 160, column: 29, scope: !335)
!342 = !DILocation(line: 160, column: 43, scope: !335)
!343 = !DILocation(line: 160, column: 47, scope: !335)
!344 = !DILocation(line: 161, column: 8, scope: !335)
!345 = !DILocation(line: 161, column: 19, scope: !335)
!346 = !DILocation(line: 161, column: 23, scope: !335)
!347 = !DILocation(line: 161, column: 26, scope: !335)
!348 = !DILocation(line: 161, column: 37, scope: !335)
!349 = !DILocation(line: 162, column: 6, scope: !335)
!350 = !DILocation(line: 164, column: 8, scope: !351)
!351 = distinct !DILexicalBlock(scope: !255, file: !2, line: 164, column: 8)
!352 = !DILocation(line: 164, column: 19, scope: !351)
!353 = !DILocation(line: 164, column: 36, scope: !351)
!354 = !DILocation(line: 164, column: 25, scope: !351)
!355 = !DILocation(line: 165, column: 8, scope: !356)
!356 = distinct !DILexicalBlock(scope: !255, file: !2, line: 165, column: 8)
!357 = !DILocation(line: 165, column: 14, scope: !356)
!358 = !DILocation(line: 165, column: 22, scope: !356)
!359 = !DILocation(line: 165, column: 31, scope: !356)
!360 = !DILocation(line: 165, column: 37, scope: !356)
!361 = !DILocation(line: 165, column: 45, scope: !356)
!362 = !DILocation(line: 166, column: 8, scope: !363)
!363 = distinct !DILexicalBlock(scope: !255, file: !2, line: 166, column: 8)
!364 = !DILocation(line: 166, column: 14, scope: !363)
!365 = !DILocation(line: 166, column: 21, scope: !363)
!366 = !DILocation(line: 166, column: 30, scope: !363)
!367 = !DILocation(line: 166, column: 36, scope: !363)
!368 = !DILocation(line: 166, column: 43, scope: !363)
!369 = !DILocation(line: 168, column: 8, scope: !255)
!370 = !DILocation(line: 168, column: 6, scope: !255)
!371 = !DILocation(line: 169, column: 8, scope: !372)
!372 = distinct !DILexicalBlock(scope: !255, file: !2, line: 169, column: 8)
!373 = !DILocation(line: 169, column: 10, scope: !372)
!374 = !DILocation(line: 169, column: 19, scope: !372)
!375 = !DILocation(line: 170, column: 14, scope: !255)
!376 = !DILocation(line: 170, column: 4, scope: !255)
!377 = !DILocation(line: 170, column: 7, scope: !255)
!378 = !DILocation(line: 170, column: 12, scope: !255)
!379 = !DILocation(line: 172, column: 4, scope: !255)
!380 = !DILocation(line: 172, column: 7, scope: !255)
!381 = !DILocation(line: 172, column: 12, scope: !255)
!382 = !DILocation(line: 173, column: 4, scope: !255)
!383 = !DILocation(line: 173, column: 7, scope: !255)
!384 = !DILocation(line: 173, column: 12, scope: !255)
!385 = !DILocation(line: 174, column: 4, scope: !255)
!386 = !DILocation(line: 174, column: 7, scope: !255)
!387 = !DILocation(line: 174, column: 12, scope: !255)
!388 = !DILocation(line: 176, column: 23, scope: !255)
!389 = !DILocation(line: 176, column: 21, scope: !255)
!390 = !DILocation(line: 176, column: 12, scope: !255)
!391 = !DILocation(line: 177, column: 14, scope: !255)
!392 = !DILocation(line: 177, column: 4, scope: !255)
!393 = !DILocation(line: 177, column: 7, scope: !255)
!394 = !DILocation(line: 177, column: 12, scope: !255)
!395 = !DILocation(line: 178, column: 14, scope: !255)
!396 = !DILocation(line: 178, column: 4, scope: !255)
!397 = !DILocation(line: 178, column: 7, scope: !255)
!398 = !DILocation(line: 178, column: 12, scope: !255)
!399 = !DILocation(line: 179, column: 14, scope: !255)
!400 = !DILocation(line: 179, column: 4, scope: !255)
!401 = !DILocation(line: 179, column: 7, scope: !255)
!402 = !DILocation(line: 179, column: 12, scope: !255)
!403 = !DILocation(line: 181, column: 8, scope: !404)
!404 = distinct !DILexicalBlock(scope: !255, file: !2, line: 181, column: 8)
!405 = !DILocation(line: 181, column: 11, scope: !404)
!406 = !DILocation(line: 181, column: 16, scope: !404)
!407 = !DILocation(line: 181, column: 24, scope: !404)
!408 = !DILocation(line: 181, column: 27, scope: !404)
!409 = !DILocation(line: 181, column: 30, scope: !404)
!410 = !DILocation(line: 181, column: 35, scope: !404)
!411 = !DILocation(line: 181, column: 43, scope: !404)
!412 = !DILocation(line: 181, column: 46, scope: !404)
!413 = !DILocation(line: 181, column: 49, scope: !404)
!414 = !DILocation(line: 181, column: 54, scope: !404)
!415 = !DILocation(line: 182, column: 11, scope: !416)
!416 = distinct !DILexicalBlock(scope: !417, file: !2, line: 182, column: 11)
!417 = distinct !DILexicalBlock(scope: !404, file: !2, line: 181, column: 63)
!418 = !DILocation(line: 182, column: 14, scope: !416)
!419 = !DILocation(line: 182, column: 19, scope: !416)
!420 = !DILocation(line: 182, column: 28, scope: !416)
!421 = !DILocation(line: 183, column: 11, scope: !422)
!422 = distinct !DILexicalBlock(scope: !417, file: !2, line: 183, column: 11)
!423 = !DILocation(line: 183, column: 14, scope: !422)
!424 = !DILocation(line: 183, column: 19, scope: !422)
!425 = !DILocation(line: 183, column: 28, scope: !422)
!426 = !DILocation(line: 184, column: 11, scope: !427)
!427 = distinct !DILexicalBlock(scope: !417, file: !2, line: 184, column: 11)
!428 = !DILocation(line: 184, column: 14, scope: !427)
!429 = !DILocation(line: 184, column: 19, scope: !427)
!430 = !DILocation(line: 184, column: 28, scope: !427)
!431 = !DILocation(line: 185, column: 11, scope: !432)
!432 = distinct !DILexicalBlock(scope: !417, file: !2, line: 185, column: 11)
!433 = !DILocation(line: 185, column: 19, scope: !432)
!434 = !DILocation(line: 185, column: 28, scope: !432)
!435 = !DILocation(line: 186, column: 7, scope: !417)
!436 = !DILocation(line: 189, column: 4, scope: !255)
!437 = !DILocation(line: 189, column: 7, scope: !255)
!438 = !DILocation(line: 189, column: 25, scope: !255)
!439 = !DILocation(line: 190, column: 4, scope: !255)
!440 = !DILocation(line: 190, column: 7, scope: !255)
!441 = !DILocation(line: 190, column: 25, scope: !255)
!442 = !DILocation(line: 191, column: 4, scope: !255)
!443 = !DILocation(line: 191, column: 7, scope: !255)
!444 = !DILocation(line: 191, column: 25, scope: !255)
!445 = !DILocation(line: 192, column: 4, scope: !255)
!446 = !DILocation(line: 192, column: 7, scope: !255)
!447 = !DILocation(line: 192, column: 25, scope: !255)
!448 = !DILocation(line: 193, column: 27, scope: !255)
!449 = !DILocation(line: 193, column: 4, scope: !255)
!450 = !DILocation(line: 193, column: 7, scope: !255)
!451 = !DILocation(line: 193, column: 25, scope: !255)
!452 = !DILocation(line: 194, column: 36, scope: !255)
!453 = !DILocation(line: 194, column: 34, scope: !255)
!454 = !DILocation(line: 194, column: 50, scope: !255)
!455 = !DILocation(line: 194, column: 4, scope: !255)
!456 = !DILocation(line: 194, column: 7, scope: !255)
!457 = !DILocation(line: 194, column: 25, scope: !255)
!458 = !DILocation(line: 195, column: 27, scope: !255)
!459 = !DILocation(line: 195, column: 4, scope: !255)
!460 = !DILocation(line: 195, column: 7, scope: !255)
!461 = !DILocation(line: 195, column: 25, scope: !255)
!462 = !DILocation(line: 196, column: 27, scope: !255)
!463 = !DILocation(line: 196, column: 4, scope: !255)
!464 = !DILocation(line: 196, column: 7, scope: !255)
!465 = !DILocation(line: 196, column: 25, scope: !255)
!466 = !DILocation(line: 198, column: 35, scope: !255)
!467 = !DILocation(line: 198, column: 38, scope: !255)
!468 = !DILocation(line: 198, column: 4, scope: !255)
!469 = !DILocation(line: 198, column: 7, scope: !255)
!470 = !DILocation(line: 198, column: 25, scope: !255)
!471 = !DILocation(line: 199, column: 36, scope: !255)
!472 = !DILocation(line: 199, column: 39, scope: !255)
!473 = !DILocation(line: 199, column: 4, scope: !255)
!474 = !DILocation(line: 199, column: 7, scope: !255)
!475 = !DILocation(line: 199, column: 25, scope: !255)
!476 = !DILocation(line: 200, column: 4, scope: !255)
!477 = !DILocation(line: 200, column: 7, scope: !255)
!478 = !DILocation(line: 200, column: 25, scope: !255)
!479 = !DILocation(line: 201, column: 36, scope: !255)
!480 = !DILocation(line: 201, column: 39, scope: !255)
!481 = !DILocation(line: 201, column: 4, scope: !255)
!482 = !DILocation(line: 201, column: 7, scope: !255)
!483 = !DILocation(line: 201, column: 25, scope: !255)
!484 = !DILocation(line: 203, column: 27, scope: !255)
!485 = !DILocation(line: 203, column: 4, scope: !255)
!486 = !DILocation(line: 203, column: 10, scope: !255)
!487 = !DILocation(line: 203, column: 25, scope: !255)
!488 = !DILocation(line: 204, column: 4, scope: !255)
!489 = !DILocation(line: 204, column: 10, scope: !255)
!490 = !DILocation(line: 204, column: 25, scope: !255)
!491 = !DILocation(line: 205, column: 4, scope: !255)
!492 = !DILocation(line: 205, column: 10, scope: !255)
!493 = !DILocation(line: 205, column: 25, scope: !255)
!494 = !DILocation(line: 206, column: 4, scope: !255)
!495 = !DILocation(line: 206, column: 10, scope: !255)
!496 = !DILocation(line: 206, column: 25, scope: !255)
!497 = !DILocation(line: 207, column: 4, scope: !255)
!498 = !DILocation(line: 207, column: 10, scope: !255)
!499 = !DILocation(line: 207, column: 25, scope: !255)
!500 = !DILocation(line: 208, column: 14, scope: !255)
!501 = !DILocation(line: 208, column: 4, scope: !255)
!502 = !DILocation(line: 209, column: 24, scope: !255)
!503 = !DILocation(line: 209, column: 4, scope: !255)
!504 = !DILocation(line: 210, column: 4, scope: !255)
!505 = !DILocation(line: 211, column: 1, scope: !255)
!506 = distinct !DISubprogram(name: "bz_config_ok", scope: !2, file: !2, line: 91, type: !507, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34)
!507 = !DISubroutineType(types: !508)
!508 = !{!76}
!509 = !DILocation(line: 96, column: 4, scope: !506)
!510 = distinct !DISubprogram(name: "default_bzalloc", scope: !2, file: !2, line: 102, type: !511, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !236)
!511 = !DISubroutineType(types: !512)
!512 = !{!53, !53, !135, !135}
!513 = !DILocalVariable(name: "opaque", arg: 1, scope: !510, file: !2, line: 102, type: !53)
!514 = !DILocation(line: 102, column: 31, scope: !510)
!515 = !DILocalVariable(name: "items", arg: 2, scope: !510, file: !2, line: 102, type: !135)
!516 = !DILocation(line: 102, column: 45, scope: !510)
!517 = !DILocalVariable(name: "size", arg: 3, scope: !510, file: !2, line: 102, type: !135)
!518 = !DILocation(line: 102, column: 58, scope: !510)
!519 = !DILocalVariable(name: "v", scope: !510, file: !2, line: 104, type: !53)
!520 = !DILocation(line: 104, column: 10, scope: !510)
!521 = !DILocation(line: 104, column: 23, scope: !510)
!522 = !DILocation(line: 104, column: 31, scope: !510)
!523 = !DILocation(line: 104, column: 29, scope: !510)
!524 = !DILocation(line: 104, column: 14, scope: !510)
!525 = !DILocation(line: 105, column: 11, scope: !510)
!526 = !DILocation(line: 105, column: 4, scope: !510)
!527 = distinct !DISubprogram(name: "default_bzfree", scope: !2, file: !2, line: 109, type: !157, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !236)
!528 = !DILocalVariable(name: "opaque", arg: 1, scope: !527, file: !2, line: 109, type: !53)
!529 = !DILocation(line: 109, column: 29, scope: !527)
!530 = !DILocalVariable(name: "addr", arg: 2, scope: !527, file: !2, line: 109, type: !53)
!531 = !DILocation(line: 109, column: 43, scope: !527)
!532 = !DILocation(line: 111, column: 8, scope: !533)
!533 = distinct !DILexicalBlock(scope: !527, file: !2, line: 111, column: 8)
!534 = !DILocation(line: 111, column: 13, scope: !533)
!535 = !DILocation(line: 111, column: 29, scope: !533)
!536 = !DILocation(line: 111, column: 22, scope: !533)
!537 = !DILocation(line: 112, column: 1, scope: !527)
!538 = distinct !DISubprogram(name: "init_RL", scope: !2, file: !2, line: 131, type: !539, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !236)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !270}
!541 = !DILocalVariable(name: "s", arg: 1, scope: !538, file: !2, line: 131, type: !270)
!542 = !DILocation(line: 131, column: 24, scope: !538)
!543 = !DILocation(line: 133, column: 4, scope: !538)
!544 = !DILocation(line: 133, column: 7, scope: !538)
!545 = !DILocation(line: 133, column: 20, scope: !538)
!546 = !DILocation(line: 134, column: 4, scope: !538)
!547 = !DILocation(line: 134, column: 7, scope: !538)
!548 = !DILocation(line: 134, column: 20, scope: !538)
!549 = !DILocation(line: 135, column: 1, scope: !538)
!550 = distinct !DISubprogram(name: "prepare_new_block", scope: !2, file: !2, line: 117, type: !539, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !236)
!551 = !DILocalVariable(name: "s", arg: 1, scope: !550, file: !2, line: 117, type: !270)
!552 = !DILocation(line: 117, column: 34, scope: !550)
!553 = !DILocalVariable(name: "i", scope: !550, file: !2, line: 119, type: !135)
!554 = !DILocation(line: 119, column: 10, scope: !550)
!555 = !DILocation(line: 120, column: 4, scope: !550)
!556 = !DILocation(line: 120, column: 7, scope: !550)
!557 = !DILocation(line: 120, column: 14, scope: !550)
!558 = !DILocation(line: 121, column: 4, scope: !550)
!559 = !DILocation(line: 121, column: 7, scope: !550)
!560 = !DILocation(line: 121, column: 12, scope: !550)
!561 = !DILocation(line: 122, column: 4, scope: !550)
!562 = !DILocation(line: 122, column: 7, scope: !550)
!563 = !DILocation(line: 122, column: 21, scope: !550)
!564 = !DILocation(line: 123, column: 4, scope: !565)
!565 = distinct !DILexicalBlock(scope: !550, file: !2, line: 123, column: 4)
!566 = !DILocation(line: 124, column: 11, scope: !567)
!567 = distinct !DILexicalBlock(scope: !550, file: !2, line: 124, column: 4)
!568 = !DILocation(line: 124, column: 9, scope: !567)
!569 = !DILocation(line: 124, column: 16, scope: !570)
!570 = distinct !DILexicalBlock(scope: !567, file: !2, line: 124, column: 4)
!571 = !DILocation(line: 124, column: 18, scope: !570)
!572 = !DILocation(line: 124, column: 4, scope: !567)
!573 = !DILocation(line: 124, column: 30, scope: !570)
!574 = !DILocation(line: 124, column: 33, scope: !570)
!575 = !DILocation(line: 124, column: 39, scope: !570)
!576 = !DILocation(line: 124, column: 42, scope: !570)
!577 = !DILocation(line: 124, column: 26, scope: !570)
!578 = !DILocation(line: 124, column: 4, scope: !570)
!579 = distinct !{!579, !572, !580, !581}
!580 = !DILocation(line: 124, column: 44, scope: !567)
!581 = !{!"llvm.loop.mustprogress"}
!582 = !DILocation(line: 125, column: 4, scope: !550)
!583 = !DILocation(line: 125, column: 7, scope: !550)
!584 = !DILocation(line: 125, column: 14, scope: !550)
!585 = !DILocation(line: 126, column: 1, scope: !550)
!586 = distinct !DISubprogram(name: "BZ2_bzCompress", scope: !2, file: !2, line: 407, type: !587, scopeLine: 408, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !34, retainedNodes: !236)
!587 = !DISubroutineType(types: !588)
!588 = !{!76, !258, !76}
!589 = !DILocalVariable(name: "strm", arg: 1, scope: !586, file: !2, line: 407, type: !258)
!590 = !DILocation(line: 407, column: 41, scope: !586)
!591 = !DILocalVariable(name: "action", arg: 2, scope: !586, file: !2, line: 407, type: !76)
!592 = !DILocation(line: 407, column: 51, scope: !586)
!593 = !DILocalVariable(name: "progress", scope: !586, file: !2, line: 409, type: !63)
!594 = !DILocation(line: 409, column: 9, scope: !586)
!595 = !DILocalVariable(name: "s", scope: !586, file: !2, line: 410, type: !270)
!596 = !DILocation(line: 410, column: 12, scope: !586)
!597 = !DILocation(line: 411, column: 8, scope: !598)
!598 = distinct !DILexicalBlock(scope: !586, file: !2, line: 411, column: 8)
!599 = !DILocation(line: 411, column: 13, scope: !598)
!600 = !DILocation(line: 411, column: 22, scope: !598)
!601 = !DILocation(line: 412, column: 8, scope: !586)
!602 = !DILocation(line: 412, column: 14, scope: !586)
!603 = !DILocation(line: 412, column: 6, scope: !586)
!604 = !DILocation(line: 413, column: 8, scope: !605)
!605 = distinct !DILexicalBlock(scope: !586, file: !2, line: 413, column: 8)
!606 = !DILocation(line: 413, column: 10, scope: !605)
!607 = !DILocation(line: 413, column: 19, scope: !605)
!608 = !DILocation(line: 414, column: 8, scope: !609)
!609 = distinct !DILexicalBlock(scope: !586, file: !2, line: 414, column: 8)
!610 = !DILocation(line: 414, column: 11, scope: !609)
!611 = !DILocation(line: 414, column: 19, scope: !609)
!612 = !DILocation(line: 414, column: 16, scope: !609)
!613 = !DILocation(line: 414, column: 25, scope: !609)
!614 = !DILabel(scope: !586, name: "preswitch", file: !2, line: 416)
!615 = !DILocation(line: 416, column: 4, scope: !586)
!616 = !DILocation(line: 417, column: 12, scope: !586)
!617 = !DILocation(line: 417, column: 15, scope: !586)
!618 = !DILocation(line: 417, column: 4, scope: !586)
!619 = !DILocation(line: 420, column: 10, scope: !620)
!620 = distinct !DILexicalBlock(scope: !586, file: !2, line: 417, column: 21)
!621 = !DILocation(line: 423, column: 14, scope: !622)
!622 = distinct !DILexicalBlock(scope: !620, file: !2, line: 423, column: 14)
!623 = !DILocation(line: 423, column: 21, scope: !622)
!624 = !DILocation(line: 424, column: 42, scope: !625)
!625 = distinct !DILexicalBlock(scope: !622, file: !2, line: 423, column: 32)
!626 = !DILocation(line: 424, column: 24, scope: !625)
!627 = !DILocation(line: 424, column: 22, scope: !625)
!628 = !DILocation(line: 425, column: 20, scope: !625)
!629 = !DILocation(line: 425, column: 13, scope: !625)
!630 = !DILocation(line: 428, column: 7, scope: !631)
!631 = distinct !DILexicalBlock(scope: !622, file: !2, line: 428, column: 7)
!632 = !DILocation(line: 428, column: 14, scope: !631)
!633 = !DILocation(line: 429, column: 34, scope: !634)
!634 = distinct !DILexicalBlock(scope: !631, file: !2, line: 428, column: 27)
!635 = !DILocation(line: 429, column: 40, scope: !634)
!636 = !DILocation(line: 429, column: 13, scope: !634)
!637 = !DILocation(line: 429, column: 16, scope: !634)
!638 = !DILocation(line: 429, column: 32, scope: !634)
!639 = !DILocation(line: 430, column: 13, scope: !634)
!640 = !DILocation(line: 430, column: 16, scope: !634)
!641 = !DILocation(line: 430, column: 21, scope: !634)
!642 = !DILocation(line: 431, column: 13, scope: !634)
!643 = !DILocation(line: 434, column: 14, scope: !644)
!644 = distinct !DILexicalBlock(scope: !631, file: !2, line: 434, column: 14)
!645 = !DILocation(line: 434, column: 21, scope: !644)
!646 = !DILocation(line: 435, column: 34, scope: !647)
!647 = distinct !DILexicalBlock(scope: !644, file: !2, line: 434, column: 35)
!648 = !DILocation(line: 435, column: 40, scope: !647)
!649 = !DILocation(line: 435, column: 13, scope: !647)
!650 = !DILocation(line: 435, column: 16, scope: !647)
!651 = !DILocation(line: 435, column: 32, scope: !647)
!652 = !DILocation(line: 436, column: 13, scope: !647)
!653 = !DILocation(line: 436, column: 16, scope: !647)
!654 = !DILocation(line: 436, column: 21, scope: !647)
!655 = !DILocation(line: 437, column: 13, scope: !647)
!656 = !DILocation(line: 440, column: 13, scope: !644)
!657 = !DILocation(line: 443, column: 14, scope: !658)
!658 = distinct !DILexicalBlock(scope: !620, file: !2, line: 443, column: 14)
!659 = !DILocation(line: 443, column: 21, scope: !658)
!660 = !DILocation(line: 443, column: 34, scope: !658)
!661 = !DILocation(line: 444, column: 14, scope: !662)
!662 = distinct !DILexicalBlock(scope: !620, file: !2, line: 444, column: 14)
!663 = !DILocation(line: 444, column: 17, scope: !662)
!664 = !DILocation(line: 444, column: 36, scope: !662)
!665 = !DILocation(line: 444, column: 39, scope: !662)
!666 = !DILocation(line: 444, column: 45, scope: !662)
!667 = !DILocation(line: 444, column: 33, scope: !662)
!668 = !DILocation(line: 445, column: 13, scope: !662)
!669 = !DILocation(line: 446, column: 39, scope: !620)
!670 = !DILocation(line: 446, column: 21, scope: !620)
!671 = !DILocation(line: 446, column: 19, scope: !620)
!672 = !DILocation(line: 447, column: 14, scope: !673)
!673 = distinct !DILexicalBlock(scope: !620, file: !2, line: 447, column: 14)
!674 = !DILocation(line: 447, column: 17, scope: !673)
!675 = !DILocation(line: 447, column: 33, scope: !673)
!676 = !DILocation(line: 447, column: 37, scope: !673)
!677 = !DILocation(line: 447, column: 52, scope: !673)
!678 = !DILocation(line: 447, column: 41, scope: !673)
!679 = !DILocation(line: 447, column: 55, scope: !673)
!680 = !DILocation(line: 448, column: 14, scope: !673)
!681 = !DILocation(line: 448, column: 17, scope: !673)
!682 = !DILocation(line: 448, column: 33, scope: !673)
!683 = !DILocation(line: 448, column: 36, scope: !673)
!684 = !DILocation(line: 448, column: 31, scope: !673)
!685 = !DILocation(line: 448, column: 42, scope: !673)
!686 = !DILocation(line: 449, column: 10, scope: !620)
!687 = !DILocation(line: 449, column: 13, scope: !620)
!688 = !DILocation(line: 449, column: 18, scope: !620)
!689 = !DILocation(line: 450, column: 10, scope: !620)
!690 = !DILocation(line: 453, column: 14, scope: !691)
!691 = distinct !DILexicalBlock(scope: !620, file: !2, line: 453, column: 14)
!692 = !DILocation(line: 453, column: 21, scope: !691)
!693 = !DILocation(line: 453, column: 35, scope: !691)
!694 = !DILocation(line: 454, column: 14, scope: !695)
!695 = distinct !DILexicalBlock(scope: !620, file: !2, line: 454, column: 14)
!696 = !DILocation(line: 454, column: 17, scope: !695)
!697 = !DILocation(line: 454, column: 36, scope: !695)
!698 = !DILocation(line: 454, column: 39, scope: !695)
!699 = !DILocation(line: 454, column: 45, scope: !695)
!700 = !DILocation(line: 454, column: 33, scope: !695)
!701 = !DILocation(line: 455, column: 13, scope: !695)
!702 = !DILocation(line: 456, column: 39, scope: !620)
!703 = !DILocation(line: 456, column: 21, scope: !620)
!704 = !DILocation(line: 456, column: 19, scope: !620)
!705 = !DILocation(line: 457, column: 15, scope: !706)
!706 = distinct !DILexicalBlock(scope: !620, file: !2, line: 457, column: 14)
!707 = !DILocation(line: 457, column: 14, scope: !706)
!708 = !DILocation(line: 457, column: 25, scope: !706)
!709 = !DILocation(line: 458, column: 14, scope: !710)
!710 = distinct !DILexicalBlock(scope: !620, file: !2, line: 458, column: 14)
!711 = !DILocation(line: 458, column: 17, scope: !710)
!712 = !DILocation(line: 458, column: 33, scope: !710)
!713 = !DILocation(line: 458, column: 37, scope: !710)
!714 = !DILocation(line: 458, column: 52, scope: !710)
!715 = !DILocation(line: 458, column: 41, scope: !710)
!716 = !DILocation(line: 458, column: 55, scope: !710)
!717 = !DILocation(line: 459, column: 14, scope: !710)
!718 = !DILocation(line: 459, column: 17, scope: !710)
!719 = !DILocation(line: 459, column: 33, scope: !710)
!720 = !DILocation(line: 459, column: 36, scope: !710)
!721 = !DILocation(line: 459, column: 31, scope: !710)
!722 = !DILocation(line: 459, column: 42, scope: !710)
!723 = !DILocation(line: 460, column: 10, scope: !620)
!724 = !DILocation(line: 460, column: 13, scope: !620)
!725 = !DILocation(line: 460, column: 18, scope: !620)
!726 = !DILocation(line: 461, column: 10, scope: !620)
!727 = !DILocation(line: 463, column: 4, scope: !586)
!728 = !DILocation(line: 464, column: 1, scope: !586)
!729 = distinct !DISubprogram(name: "handle_compress", scope: !2, file: !2, line: 361, type: !730, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !236)
!730 = !DISubroutineType(types: !731)
!731 = !{!63, !258}
!732 = !DILocalVariable(name: "strm", arg: 1, scope: !729, file: !2, line: 361, type: !258)
!733 = !DILocation(line: 361, column: 35, scope: !729)
!734 = !DILocalVariable(name: "progress_in", scope: !729, file: !2, line: 363, type: !63)
!735 = !DILocation(line: 363, column: 9, scope: !729)
!736 = !DILocalVariable(name: "progress_out", scope: !729, file: !2, line: 364, type: !63)
!737 = !DILocation(line: 364, column: 9, scope: !729)
!738 = !DILocalVariable(name: "s", scope: !729, file: !2, line: 365, type: !270)
!739 = !DILocation(line: 365, column: 12, scope: !729)
!740 = !DILocation(line: 365, column: 16, scope: !729)
!741 = !DILocation(line: 365, column: 22, scope: !729)
!742 = !DILocation(line: 367, column: 4, scope: !729)
!743 = !DILocation(line: 369, column: 11, scope: !744)
!744 = distinct !DILexicalBlock(scope: !745, file: !2, line: 369, column: 11)
!745 = distinct !DILexicalBlock(scope: !729, file: !2, line: 367, column: 17)
!746 = !DILocation(line: 369, column: 14, scope: !744)
!747 = !DILocation(line: 369, column: 20, scope: !744)
!748 = !DILocation(line: 370, column: 51, scope: !749)
!749 = distinct !DILexicalBlock(scope: !744, file: !2, line: 369, column: 36)
!750 = !DILocation(line: 370, column: 26, scope: !749)
!751 = !DILocation(line: 370, column: 23, scope: !749)
!752 = !DILocation(line: 371, column: 14, scope: !753)
!753 = distinct !DILexicalBlock(scope: !749, file: !2, line: 371, column: 14)
!754 = !DILocation(line: 371, column: 17, scope: !753)
!755 = !DILocation(line: 371, column: 33, scope: !753)
!756 = !DILocation(line: 371, column: 36, scope: !753)
!757 = !DILocation(line: 371, column: 31, scope: !753)
!758 = !DILocation(line: 371, column: 42, scope: !753)
!759 = !DILocation(line: 372, column: 14, scope: !760)
!760 = distinct !DILexicalBlock(scope: !749, file: !2, line: 372, column: 14)
!761 = !DILocation(line: 372, column: 17, scope: !760)
!762 = !DILocation(line: 372, column: 22, scope: !760)
!763 = !DILocation(line: 372, column: 40, scope: !760)
!764 = !DILocation(line: 373, column: 14, scope: !760)
!765 = !DILocation(line: 373, column: 17, scope: !760)
!766 = !DILocation(line: 373, column: 33, scope: !760)
!767 = !DILocation(line: 373, column: 38, scope: !760)
!768 = !DILocation(line: 374, column: 25, scope: !760)
!769 = !DILocation(line: 374, column: 14, scope: !760)
!770 = !DILocation(line: 374, column: 29, scope: !760)
!771 = !DILocation(line: 375, column: 30, scope: !749)
!772 = !DILocation(line: 375, column: 10, scope: !749)
!773 = !DILocation(line: 376, column: 10, scope: !749)
!774 = !DILocation(line: 376, column: 13, scope: !749)
!775 = !DILocation(line: 376, column: 19, scope: !749)
!776 = !DILocation(line: 377, column: 14, scope: !777)
!777 = distinct !DILexicalBlock(scope: !749, file: !2, line: 377, column: 14)
!778 = !DILocation(line: 377, column: 17, scope: !777)
!779 = !DILocation(line: 377, column: 22, scope: !777)
!780 = !DILocation(line: 377, column: 39, scope: !777)
!781 = !DILocation(line: 378, column: 14, scope: !777)
!782 = !DILocation(line: 378, column: 17, scope: !777)
!783 = !DILocation(line: 378, column: 33, scope: !777)
!784 = !DILocation(line: 378, column: 38, scope: !777)
!785 = !DILocation(line: 379, column: 25, scope: !777)
!786 = !DILocation(line: 379, column: 14, scope: !777)
!787 = !DILocation(line: 379, column: 29, scope: !777)
!788 = !DILocation(line: 380, column: 7, scope: !749)
!789 = !DILocation(line: 382, column: 11, scope: !790)
!790 = distinct !DILexicalBlock(scope: !745, file: !2, line: 382, column: 11)
!791 = !DILocation(line: 382, column: 14, scope: !790)
!792 = !DILocation(line: 382, column: 20, scope: !790)
!793 = !DILocation(line: 383, column: 49, scope: !794)
!794 = distinct !DILexicalBlock(scope: !790, file: !2, line: 382, column: 35)
!795 = !DILocation(line: 383, column: 25, scope: !794)
!796 = !DILocation(line: 383, column: 22, scope: !794)
!797 = !DILocation(line: 384, column: 14, scope: !798)
!798 = distinct !DILexicalBlock(scope: !794, file: !2, line: 384, column: 14)
!799 = !DILocation(line: 384, column: 17, scope: !798)
!800 = !DILocation(line: 384, column: 22, scope: !798)
!801 = !DILocation(line: 384, column: 38, scope: !798)
!802 = !DILocation(line: 384, column: 41, scope: !798)
!803 = !DILocation(line: 384, column: 44, scope: !798)
!804 = !DILocation(line: 384, column: 60, scope: !798)
!805 = !DILocation(line: 385, column: 24, scope: !806)
!806 = distinct !DILexicalBlock(scope: !798, file: !2, line: 384, column: 66)
!807 = !DILocation(line: 385, column: 13, scope: !806)
!808 = !DILocation(line: 386, column: 33, scope: !806)
!809 = !DILocation(line: 386, column: 43, scope: !806)
!810 = !DILocation(line: 386, column: 46, scope: !806)
!811 = !DILocation(line: 386, column: 51, scope: !806)
!812 = !DILocation(line: 386, column: 36, scope: !806)
!813 = !DILocation(line: 386, column: 13, scope: !806)
!814 = !DILocation(line: 387, column: 13, scope: !806)
!815 = !DILocation(line: 387, column: 16, scope: !806)
!816 = !DILocation(line: 387, column: 22, scope: !806)
!817 = !DILocation(line: 388, column: 10, scope: !806)
!818 = !DILocation(line: 390, column: 14, scope: !819)
!819 = distinct !DILexicalBlock(scope: !798, file: !2, line: 390, column: 14)
!820 = !DILocation(line: 390, column: 17, scope: !819)
!821 = !DILocation(line: 390, column: 27, scope: !819)
!822 = !DILocation(line: 390, column: 30, scope: !819)
!823 = !DILocation(line: 390, column: 24, scope: !819)
!824 = !DILocation(line: 391, column: 33, scope: !825)
!825 = distinct !DILexicalBlock(scope: !819, file: !2, line: 390, column: 41)
!826 = !DILocation(line: 391, column: 13, scope: !825)
!827 = !DILocation(line: 392, column: 13, scope: !825)
!828 = !DILocation(line: 392, column: 16, scope: !825)
!829 = !DILocation(line: 392, column: 22, scope: !825)
!830 = !DILocation(line: 393, column: 10, scope: !825)
!831 = !DILocation(line: 395, column: 14, scope: !832)
!832 = distinct !DILexicalBlock(scope: !819, file: !2, line: 395, column: 14)
!833 = !DILocation(line: 395, column: 17, scope: !832)
!834 = !DILocation(line: 395, column: 23, scope: !832)
!835 = !DILocation(line: 395, column: 32, scope: !832)
!836 = !DILocation(line: 396, column: 13, scope: !837)
!837 = distinct !DILexicalBlock(scope: !832, file: !2, line: 395, column: 38)
!838 = !DILocation(line: 398, column: 7, scope: !794)
!839 = distinct !{!839, !742, !840}
!840 = !DILocation(line: 400, column: 4, scope: !729)
!841 = !DILocation(line: 402, column: 11, scope: !729)
!842 = !DILocation(line: 402, column: 23, scope: !729)
!843 = !DILocation(line: 402, column: 26, scope: !729)
!844 = !DILocation(line: 402, column: 4, scope: !729)
!845 = distinct !DISubprogram(name: "isempty_RL", scope: !2, file: !2, line: 139, type: !846, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !34, retainedNodes: !236)
!846 = !DISubroutineType(types: !847)
!847 = !{!63, !270}
!848 = !DILocalVariable(name: "s", arg: 1, scope: !845, file: !2, line: 139, type: !270)
!849 = !DILocation(line: 139, column: 27, scope: !845)
!850 = !DILocation(line: 141, column: 8, scope: !851)
!851 = distinct !DILexicalBlock(scope: !845, file: !2, line: 141, column: 8)
!852 = !DILocation(line: 141, column: 11, scope: !851)
!853 = !DILocation(line: 141, column: 23, scope: !851)
!854 = !DILocation(line: 141, column: 29, scope: !851)
!855 = !DILocation(line: 141, column: 32, scope: !851)
!856 = !DILocation(line: 141, column: 35, scope: !851)
!857 = !DILocation(line: 141, column: 48, scope: !851)
!858 = !DILocation(line: 142, column: 7, scope: !851)
!859 = !DILocation(line: 143, column: 7, scope: !851)
!860 = !DILocation(line: 144, column: 1, scope: !845)
!861 = distinct !DISubprogram(name: "BZ2_bzCompressEnd", scope: !2, file: !2, line: 468, type: !862, scopeLine: 469, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !34, retainedNodes: !236)
!862 = !DISubroutineType(types: !863)
!863 = !{!76, !258}
!864 = !DILocalVariable(name: "strm", arg: 1, scope: !861, file: !2, line: 468, type: !258)
!865 = !DILocation(line: 468, column: 45, scope: !861)
!866 = !DILocalVariable(name: "s", scope: !861, file: !2, line: 470, type: !270)
!867 = !DILocation(line: 470, column: 12, scope: !861)
!868 = !DILocation(line: 471, column: 8, scope: !869)
!869 = distinct !DILexicalBlock(scope: !861, file: !2, line: 471, column: 8)
!870 = !DILocation(line: 471, column: 13, scope: !869)
!871 = !DILocation(line: 471, column: 22, scope: !869)
!872 = !DILocation(line: 472, column: 8, scope: !861)
!873 = !DILocation(line: 472, column: 14, scope: !861)
!874 = !DILocation(line: 472, column: 6, scope: !861)
!875 = !DILocation(line: 473, column: 8, scope: !876)
!876 = distinct !DILexicalBlock(scope: !861, file: !2, line: 473, column: 8)
!877 = !DILocation(line: 473, column: 10, scope: !876)
!878 = !DILocation(line: 473, column: 19, scope: !876)
!879 = !DILocation(line: 474, column: 8, scope: !880)
!880 = distinct !DILexicalBlock(scope: !861, file: !2, line: 474, column: 8)
!881 = !DILocation(line: 474, column: 11, scope: !880)
!882 = !DILocation(line: 474, column: 19, scope: !880)
!883 = !DILocation(line: 474, column: 16, scope: !880)
!884 = !DILocation(line: 474, column: 25, scope: !880)
!885 = !DILocation(line: 476, column: 8, scope: !886)
!886 = distinct !DILexicalBlock(scope: !861, file: !2, line: 476, column: 8)
!887 = !DILocation(line: 476, column: 11, scope: !886)
!888 = !DILocation(line: 476, column: 16, scope: !886)
!889 = !DILocation(line: 476, column: 25, scope: !886)
!890 = !DILocation(line: 477, column: 8, scope: !891)
!891 = distinct !DILexicalBlock(scope: !861, file: !2, line: 477, column: 8)
!892 = !DILocation(line: 477, column: 11, scope: !891)
!893 = !DILocation(line: 477, column: 16, scope: !891)
!894 = !DILocation(line: 477, column: 25, scope: !891)
!895 = !DILocation(line: 478, column: 8, scope: !896)
!896 = distinct !DILexicalBlock(scope: !861, file: !2, line: 478, column: 8)
!897 = !DILocation(line: 478, column: 11, scope: !896)
!898 = !DILocation(line: 478, column: 16, scope: !896)
!899 = !DILocation(line: 478, column: 25, scope: !896)
!900 = !DILocation(line: 479, column: 4, scope: !861)
!901 = !DILocation(line: 481, column: 4, scope: !861)
!902 = !DILocation(line: 481, column: 10, scope: !861)
!903 = !DILocation(line: 481, column: 16, scope: !861)
!904 = !DILocation(line: 483, column: 4, scope: !861)
!905 = !DILocation(line: 484, column: 1, scope: !861)
!906 = distinct !DISubprogram(name: "BZ2_bzDecompressInit", scope: !2, file: !2, line: 492, type: !907, scopeLine: 496, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !34, retainedNodes: !236)
!907 = !DISubroutineType(types: !908)
!908 = !{!76, !258, !76, !76}
!909 = !DILocalVariable(name: "strm", arg: 1, scope: !906, file: !2, line: 493, type: !258)
!910 = !DILocation(line: 493, column: 35, scope: !906)
!911 = !DILocalVariable(name: "verbosity", arg: 2, scope: !906, file: !2, line: 494, type: !76)
!912 = !DILocation(line: 494, column: 35, scope: !906)
!913 = !DILocalVariable(name: "small", arg: 3, scope: !906, file: !2, line: 495, type: !76)
!914 = !DILocation(line: 495, column: 35, scope: !906)
!915 = !DILocalVariable(name: "s", scope: !906, file: !2, line: 497, type: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "DState", file: !56, line: 438, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 348, size: 513152, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !938, !939, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !955, !956, !960, !962, !963, !964, !965, !966, !967, !968, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !994, !995}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !918, file: !56, line: 350, baseType: !258, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !918, file: !56, line: 353, baseType: !135, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_ch", scope: !918, file: !56, line: 356, baseType: !55, size: 8, offset: 96)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_len", scope: !918, file: !56, line: 357, baseType: !135, size: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "blockRandomised", scope: !918, file: !56, line: 358, baseType: !63, size: 8, offset: 160)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !918, file: !56, line: 359, baseType: !135, size: 32, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !918, file: !56, line: 359, baseType: !135, size: 32, offset: 224)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !918, file: !56, line: 362, baseType: !62, size: 32, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !918, file: !56, line: 363, baseType: !135, size: 32, offset: 288)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !918, file: !56, line: 366, baseType: !135, size: 32, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "smallDecompress", scope: !918, file: !56, line: 367, baseType: !63, size: 8, offset: 352)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "currBlockNo", scope: !918, file: !56, line: 368, baseType: !135, size: 32, offset: 384)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !918, file: !56, line: 369, baseType: !135, size: 32, offset: 416)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !918, file: !56, line: 372, baseType: !135, size: 32, offset: 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "tPos", scope: !918, file: !56, line: 373, baseType: !62, size: 32, offset: 480)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !918, file: !56, line: 374, baseType: !135, size: 32, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "unzftab", scope: !918, file: !56, line: 375, baseType: !937, size: 8192, offset: 544)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8192, elements: !298)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nblock_used", scope: !918, file: !56, line: 376, baseType: !135, size: 32, offset: 8736)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cftab", scope: !918, file: !56, line: 377, baseType: !940, size: 8224, offset: 8768)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8224, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 257)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "cftabCopy", scope: !918, file: !56, line: 378, baseType: !940, size: 8224, offset: 16992)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !918, file: !56, line: 381, baseType: !61, size: 64, offset: 25216)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ll16", scope: !918, file: !56, line: 384, baseType: !58, size: 64, offset: 25280)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ll4", scope: !918, file: !56, line: 385, baseType: !54, size: 64, offset: 25344)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "storedBlockCRC", scope: !918, file: !56, line: 388, baseType: !62, size: 32, offset: 25408)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "storedCombinedCRC", scope: !918, file: !56, line: 389, baseType: !62, size: 32, offset: 25440)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "calculatedBlockCRC", scope: !918, file: !56, line: 390, baseType: !62, size: 32, offset: 25472)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "calculatedCombinedCRC", scope: !918, file: !56, line: 391, baseType: !62, size: 32, offset: 25504)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !918, file: !56, line: 394, baseType: !135, size: 32, offset: 25536)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !918, file: !56, line: 395, baseType: !297, size: 2048, offset: 25568)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "inUse16", scope: !918, file: !56, line: 396, baseType: !954, size: 128, offset: 27616)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !223)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "seqToUnseq", scope: !918, file: !56, line: 397, baseType: !301, size: 2048, offset: 27744)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "mtfa", scope: !918, file: !56, line: 400, baseType: !957, size: 32768, offset: 29792)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32768, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 4096)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "mtfbase", scope: !918, file: !56, line: 401, baseType: !961, size: 512, offset: 62560)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 512, elements: !223)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !918, file: !56, line: 402, baseType: !315, size: 144016, offset: 63072)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !918, file: !56, line: 403, baseType: !315, size: 144016, offset: 207088)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !918, file: !56, line: 404, baseType: !320, size: 12384, offset: 351104)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !918, file: !56, line: 406, baseType: !324, size: 49536, offset: 363488)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !918, file: !56, line: 407, baseType: !324, size: 49536, offset: 413024)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !918, file: !56, line: 408, baseType: !324, size: 49536, offset: 462560)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "minLens", scope: !918, file: !56, line: 409, baseType: !969, size: 192, offset: 512096)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 192, elements: !970)
!970 = !{!322}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "save_i", scope: !918, file: !56, line: 412, baseType: !135, size: 32, offset: 512288)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "save_j", scope: !918, file: !56, line: 413, baseType: !135, size: 32, offset: 512320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "save_t", scope: !918, file: !56, line: 414, baseType: !135, size: 32, offset: 512352)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "save_alphaSize", scope: !918, file: !56, line: 415, baseType: !135, size: 32, offset: 512384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "save_nGroups", scope: !918, file: !56, line: 416, baseType: !135, size: 32, offset: 512416)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "save_nSelectors", scope: !918, file: !56, line: 417, baseType: !135, size: 32, offset: 512448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "save_EOB", scope: !918, file: !56, line: 418, baseType: !135, size: 32, offset: 512480)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "save_groupNo", scope: !918, file: !56, line: 419, baseType: !135, size: 32, offset: 512512)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "save_groupPos", scope: !918, file: !56, line: 420, baseType: !135, size: 32, offset: 512544)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "save_nextSym", scope: !918, file: !56, line: 421, baseType: !135, size: 32, offset: 512576)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "save_nblockMAX", scope: !918, file: !56, line: 422, baseType: !135, size: 32, offset: 512608)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "save_nblock", scope: !918, file: !56, line: 423, baseType: !135, size: 32, offset: 512640)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "save_es", scope: !918, file: !56, line: 424, baseType: !135, size: 32, offset: 512672)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "save_N", scope: !918, file: !56, line: 425, baseType: !135, size: 32, offset: 512704)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "save_curr", scope: !918, file: !56, line: 426, baseType: !135, size: 32, offset: 512736)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "save_zt", scope: !918, file: !56, line: 427, baseType: !135, size: 32, offset: 512768)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "save_zn", scope: !918, file: !56, line: 428, baseType: !135, size: 32, offset: 512800)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "save_zvec", scope: !918, file: !56, line: 429, baseType: !135, size: 32, offset: 512832)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "save_zj", scope: !918, file: !56, line: 430, baseType: !135, size: 32, offset: 512864)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "save_gSel", scope: !918, file: !56, line: 431, baseType: !135, size: 32, offset: 512896)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "save_gMinlen", scope: !918, file: !56, line: 432, baseType: !135, size: 32, offset: 512928)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "save_gLimit", scope: !918, file: !56, line: 433, baseType: !993, size: 64, offset: 512960)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "save_gBase", scope: !918, file: !56, line: 434, baseType: !993, size: 64, offset: 513024)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "save_gPerm", scope: !918, file: !56, line: 435, baseType: !993, size: 64, offset: 513088)
!996 = !DILocation(line: 497, column: 12, scope: !906)
!997 = !DILocation(line: 499, column: 9, scope: !998)
!998 = distinct !DILexicalBlock(scope: !906, file: !2, line: 499, column: 8)
!999 = !DILocation(line: 499, column: 8, scope: !998)
!1000 = !DILocation(line: 499, column: 25, scope: !998)
!1001 = !DILocation(line: 501, column: 8, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !906, file: !2, line: 501, column: 8)
!1003 = !DILocation(line: 501, column: 13, scope: !1002)
!1004 = !DILocation(line: 501, column: 22, scope: !1002)
!1005 = !DILocation(line: 502, column: 8, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !906, file: !2, line: 502, column: 8)
!1007 = !DILocation(line: 502, column: 14, scope: !1006)
!1008 = !DILocation(line: 502, column: 19, scope: !1006)
!1009 = !DILocation(line: 502, column: 22, scope: !1006)
!1010 = !DILocation(line: 502, column: 28, scope: !1006)
!1011 = !DILocation(line: 502, column: 34, scope: !1006)
!1012 = !DILocation(line: 503, column: 8, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !906, file: !2, line: 503, column: 8)
!1014 = !DILocation(line: 503, column: 18, scope: !1013)
!1015 = !DILocation(line: 503, column: 22, scope: !1013)
!1016 = !DILocation(line: 503, column: 25, scope: !1013)
!1017 = !DILocation(line: 503, column: 35, scope: !1013)
!1018 = !DILocation(line: 503, column: 40, scope: !1013)
!1019 = !DILocation(line: 505, column: 8, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !906, file: !2, line: 505, column: 8)
!1021 = !DILocation(line: 505, column: 14, scope: !1020)
!1022 = !DILocation(line: 505, column: 22, scope: !1020)
!1023 = !DILocation(line: 505, column: 31, scope: !1020)
!1024 = !DILocation(line: 505, column: 37, scope: !1020)
!1025 = !DILocation(line: 505, column: 45, scope: !1020)
!1026 = !DILocation(line: 506, column: 8, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !906, file: !2, line: 506, column: 8)
!1028 = !DILocation(line: 506, column: 14, scope: !1027)
!1029 = !DILocation(line: 506, column: 21, scope: !1027)
!1030 = !DILocation(line: 506, column: 30, scope: !1027)
!1031 = !DILocation(line: 506, column: 36, scope: !1027)
!1032 = !DILocation(line: 506, column: 43, scope: !1027)
!1033 = !DILocation(line: 508, column: 8, scope: !906)
!1034 = !DILocation(line: 508, column: 6, scope: !906)
!1035 = !DILocation(line: 509, column: 8, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !906, file: !2, line: 509, column: 8)
!1037 = !DILocation(line: 509, column: 10, scope: !1036)
!1038 = !DILocation(line: 509, column: 19, scope: !1036)
!1039 = !DILocation(line: 510, column: 31, scope: !906)
!1040 = !DILocation(line: 510, column: 4, scope: !906)
!1041 = !DILocation(line: 510, column: 7, scope: !906)
!1042 = !DILocation(line: 510, column: 29, scope: !906)
!1043 = !DILocation(line: 511, column: 31, scope: !906)
!1044 = !DILocation(line: 511, column: 4, scope: !906)
!1045 = !DILocation(line: 511, column: 10, scope: !906)
!1046 = !DILocation(line: 511, column: 29, scope: !906)
!1047 = !DILocation(line: 512, column: 4, scope: !906)
!1048 = !DILocation(line: 512, column: 7, scope: !906)
!1049 = !DILocation(line: 512, column: 29, scope: !906)
!1050 = !DILocation(line: 513, column: 4, scope: !906)
!1051 = !DILocation(line: 513, column: 7, scope: !906)
!1052 = !DILocation(line: 513, column: 29, scope: !906)
!1053 = !DILocation(line: 514, column: 4, scope: !906)
!1054 = !DILocation(line: 514, column: 7, scope: !906)
!1055 = !DILocation(line: 514, column: 29, scope: !906)
!1056 = !DILocation(line: 515, column: 4, scope: !906)
!1057 = !DILocation(line: 515, column: 7, scope: !906)
!1058 = !DILocation(line: 515, column: 29, scope: !906)
!1059 = !DILocation(line: 516, column: 4, scope: !906)
!1060 = !DILocation(line: 516, column: 10, scope: !906)
!1061 = !DILocation(line: 516, column: 29, scope: !906)
