; ModuleID = 'cBench/consumer_jpeg_c/src/cjpeg.c'
source_filename = "cBench/consumer_jpeg_c/src/cjpeg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_compress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, double, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], [16 x i8], [16 x i8], [16 x i8], i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.cjpeg_source_struct = type { ptr, ptr, ptr, ptr, ptr, i32 }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }

@progname = internal global ptr null, align 8, !dbg !0
@.str = private unnamed_addr constant [6 x i8] c"cjpeg\00", align 1, !dbg !319

!114 = !DIEnumerator(name: "JERR_MISSING_DATA", value: 44)
!115 = !DIEnumerator(name: "JERR_MODE_CHANGE", value: 45)
!116 = !DIEnumerator(name: "JERR_NOTIMPL", value: 46)
!117 = !DIEnumerator(name: "JERR_NOT_COMPILED", value: 47)
!118 = !DIEnumerator(name: "JERR_NO_BACKING_STORE", value: 48)
!119 = !DIEnumerator(name: "JERR_NO_HUFF_TABLE", value: 49)
!120 = !DIEnumerator(name: "JERR_NO_IMAGE", value: 50)
!121 = !DIEnumerator(name: "JERR_NO_QUANT_TABLE", value: 51)
!122 = !DIEnumerator(name: "JERR_NO_SOI", value: 52)
!123 = !DIEnumerator(name: "JERR_OUT_OF_MEMORY", value: 53)
!124 = !DIEnumerator(name: "JERR_QUANT_COMPONENTS", value: 54)
!125 = !DIEnumerator(name: "JERR_QUANT_FEW_COLORS", value: 55)
!126 = !DIEnumerator(name: "JERR_QUANT_MANY_COLORS", value: 56)
!127 = !DIEnumerator(name: "JERR_SOF_DUPLICATE", value: 57)
!128 = !DIEnumerator(name: "JERR_SOF_NO_SOS", value: 58)
!129 = !DIEnumerator(name: "JERR_SOF_UNSUPPORTED", value: 59)
!130 = !DIEnumerator(name: "JERR_SOI_DUPLICATE", value: 60)
!131 = !DIEnumerator(name: "JERR_SOS_NO_SOF", value: 61)
!132 = !DIEnumerator(name: "JERR_TFILE_CREATE", value: 62)
!133 = !DIEnumerator(name: "JERR_TFILE_READ", value: 63)
!134 = !DIEnumerator(name: "JERR_TFILE_SEEK", value: 64)
!135 = !DIEnumerator(name: "JERR_TFILE_WRITE", value: 65)
!136 = !DIEnumerator(name: "JERR_TOO_LITTLE_DATA", value: 66)
!137 = !DIEnumerator(name: "JERR_UNKNOWN_MARKER", value: 67)
!138 = !DIEnumerator(name: "JERR_VIRTUAL_BUG", value: 68)
!139 = !DIEnumerator(name: "JERR_WIDTH_OVERFLOW", value: 69)
!140 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!141 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!142 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!143 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!144 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!145 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!146 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!147 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!148 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!149 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!150 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!151 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!152 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!153 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!154 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!155 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!156 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!157 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!158 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!159 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!160 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!161 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!162 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!163 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!164 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!165 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!166 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!167 = !DIEnumerator(name: "JTRC_RST", value: 97)
!168 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!169 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!170 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!171 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!172 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!173 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!174 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!175 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!176 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!177 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!178 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!179 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!180 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!181 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!182 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!183 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!184 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!185 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!186 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!187 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!188 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!189 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!190 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!191 = !{!192, !193, !7, !196, !197}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !194, line: 18, baseType: !195)
!194 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!195 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!196 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !6, line: 248, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !6, line: 240, size: 256, elements: !200)
!200 = !{!201, !245, !307, !316, !317}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !199, file: !6, line: 241, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !6, line: 618, size: 1344, elements: !204)
!204 = !{!205, !209, !213, !214, !220, !221, !222, !233, !234, !236, !241, !242, !243, !244}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !203, file: !6, line: 620, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !197}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !203, file: !6, line: 622, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !197, !196}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !203, file: !6, line: 624, baseType: !206, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !203, file: !6, line: 626, baseType: !215, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !197, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !203, file: !6, line: 629, baseType: !206, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !203, file: !6, line: 634, baseType: !196, size: 32, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !203, file: !6, line: 639, baseType: !223, size: 640, offset: 352)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !203, file: !6, line: 636, size: 640, elements: !224)
!224 = !{!225, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !223, file: !6, line: 637, baseType: !226, size: 256)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 256, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 8)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !223, file: !6, line: 638, baseType: !230, size: 640)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 640, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 80)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !203, file: !6, line: 643, baseType: !196, size: 32, offset: 992)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !203, file: !6, line: 651, baseType: !235, size: 64, offset: 1024)
!235 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !203, file: !6, line: 663, baseType: !237, size: 64, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !203, file: !6, line: 664, baseType: !196, size: 32, offset: 1152)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !203, file: !6, line: 668, baseType: !237, size: 64, offset: 1216)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !203, file: !6, line: 669, baseType: !196, size: 32, offset: 1280)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !203, file: !6, line: 670, baseType: !196, size: 32, offset: 1312)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !199, file: !6, line: 241, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !6, line: 731, size: 768, elements: !248)
!248 = !{!249, !253, !254, !266, !280, !288, !295, !296, !300, !304, !305, !306}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !247, file: !6, line: 733, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!192, !197, !196, !193}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !247, file: !6, line: 735, baseType: !250, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !247, file: !6, line: 737, baseType: !255, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!258, !197, !196, !265, !265}
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !6, line: 67, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !6, line: 66, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !263, line: 59, baseType: !264)
!263 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!264 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !263, line: 171, baseType: !7)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !247, file: !6, line: 740, baseType: !267, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !197, !196, !265, !265}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !6, line: 72, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !6, line: 71, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !6, line: 70, baseType: !275)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 1024, elements: !278)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !263, line: 99, baseType: !277)
!277 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!278 = !{!279}
!279 = !DISubrange(count: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !247, file: !6, line: 743, baseType: !281, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!284, !197, !196, !287, !265, !265, !265}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !6, line: 727, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !6, line: 727, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !263, line: 227, baseType: !196)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !247, file: !6, line: 749, baseType: !289, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!292, !197, !196, !287, !265, !265, !265}
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !6, line: 728, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !6, line: 728, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !247, file: !6, line: 755, baseType: !206, size: 64, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !247, file: !6, line: 756, baseType: !297, size: 64, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!258, !197, !284, !265, !265, !287}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !247, file: !6, line: 761, baseType: !301, size: 64, offset: 512)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!270, !197, !292, !265, !265, !287}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !247, file: !6, line: 766, baseType: !210, size: 64, offset: 576)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !247, file: !6, line: 767, baseType: !206, size: 64, offset: 640)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !247, file: !6, line: 774, baseType: !235, size: 64, offset: 704)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !199, file: !6, line: 241, baseType: !308, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !6, line: 676, size: 256, elements: !310)
!310 = !{!311, !312, !313, !314, !315}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !309, file: !6, line: 677, baseType: !206, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !309, file: !6, line: 679, baseType: !235, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !309, file: !6, line: 680, baseType: !235, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !309, file: !6, line: 681, baseType: !196, size: 32, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !309, file: !6, line: 682, baseType: !196, size: 32, offset: 224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !199, file: !6, line: 241, baseType: !287, size: 32, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !199, file: !6, line: 241, baseType: !196, size: 32, offset: 224)
!318 = !{!319, !324, !329, !334, !339, !0, !341, !343, !348, !353, !358, !363, !365, !370, !375, !380, !385, !390, !395, !400, !405, !407, !409, !414, !416, !421, !426, !431, !433, !435, !437, !442, !444, !449, !451, !456, !461, !463, !465, !467, !469, !471, !473, !475, !480, !485, !490, !495, !500, !505, !508, !513, !515, !520, !525, !527, !532, !534, !536, !539, !714, !719, !724, !726, !729, !731, !733, !735, !737, !739, !741, !746, !748, !750, !755, !757, !759, !761, !763, !765, !767, !769, !771, !773, !775, !780, !785, !790, !792, !797, !799, !801, !803, !808, !813, !818, !823, !828, !833, !835, !837, !839, !841, !846, !848, !850}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !3, line: 481, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 48, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 6)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !3, line: 532, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 200, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 25)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !3, line: 539, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 24, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 3)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !3, line: 540, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 152, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 19)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !3, line: 550, type: !331, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "outfilename", scope: !2, file: !3, line: 137, type: !218, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !21, line: 42, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 256, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 32)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !21, line: 43, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 344, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 43)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !21, line: 44, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 288, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 36)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !21, line: 45, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 336, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 42)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !21, line: 46, type: !355, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !21, line: 47, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 328, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 41)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !21, line: 48, type: !372, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 320, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 40)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !21, line: 49, type: !377, isLocal: true, isDefinition: true)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 184, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 23)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !21, line: 50, type: !382, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 272, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 34)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !21, line: 51, type: !387, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 216, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 27)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !21, line: 52, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 304, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 38)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !21, line: 56, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 192, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 24)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !21, line: 57, type: !402, isLocal: true, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 176, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 22)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !21, line: 58, type: !355, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !21, line: 59, type: !387, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !21, line: 60, type: !411, isLocal: true, isDefinition: true)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 120, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 15)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !21, line: 61, type: !336, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !21, line: 62, type: !418, isLocal: true, isDefinition: true)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 384, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 48)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !21, line: 64, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 352, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 44)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !21, line: 65, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 280, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 35)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !21, line: 66, type: !326, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !21, line: 67, type: !372, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !21, line: 68, type: !387, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !21, line: 69, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 160, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 20)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !21, line: 73, type: !355, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !21, line: 74, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 224, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 28)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !21, line: 75, type: !411, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !21, line: 76, type: !453, isLocal: true, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 128, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 16)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !21, line: 77, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 168, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 21)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !21, line: 78, type: !453, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !21, line: 79, type: !458, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !21, line: 100, type: !382, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !21, line: 101, type: !382, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !21, line: 102, type: !392, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !21, line: 103, type: !402, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !21, line: 104, type: !446, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !21, line: 105, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 240, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 30)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !21, line: 110, type: !482, isLocal: true, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 408, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 51)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !21, line: 112, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 424, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 53)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !21, line: 114, type: !492, isLocal: true, isDefinition: true)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 112, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 14)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !21, line: 116, type: !497, isLocal: true, isDefinition: true)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 472, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 59)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !21, line: 121, type: !502, isLocal: true, isDefinition: true)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 248, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 31)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "cdjpeg_message_table", scope: !2, file: !3, line: 44, type: !507, isLocal: true, isDefinition: true)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 2816, elements: !424)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !3, line: 247, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 88, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 11)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !3, line: 252, type: !423, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !3, line: 257, type: !517, isLocal: true, isDefinition: true)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 72, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 9)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !3, line: 261, type: !522, isLocal: true, isDefinition: true)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 32, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 4)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !3, line: 265, type: !522, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !3, line: 267, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 40, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 5)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !3, line: 269, type: !321, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !3, line: 274, type: !321, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !3, line: 274, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 64, elements: !227)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "printed_version", scope: !541, file: !3, line: 277, type: !287, isLocal: true, isDefinition: true)
!541 = distinct !DISubprogram(name: "parse_switches", scope: !3, file: !3, line: 199, type: !542, scopeLine: 209, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !713)
!542 = !DISubroutineType(types: !543)
!543 = !{!196, !544, !196, !712, !196, !287}
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_compress_ptr", file: !6, line: 249, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !6, line: 255, size: 3968, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !570, !571, !572, !573, !575, !577, !578, !579, !580, !615, !617, !633, !634, !636, !637, !638, !639, !652, !653, !654, !655, !656, !657, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !674, !675, !676, !677, !681, !682, !683, !684, !685, !688, !691, !694, !697, !700, !703, !706, !709}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !546, file: !6, line: 256, baseType: !202, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !546, file: !6, line: 256, baseType: !246, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !546, file: !6, line: 256, baseType: !308, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !546, file: !6, line: 256, baseType: !287, size: 32, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !546, file: !6, line: 256, baseType: !196, size: 32, offset: 224)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !546, file: !6, line: 259, baseType: !554, size: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !6, line: 688, size: 320, elements: !556)
!556 = !{!557, !560, !561, !565, !569}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !555, file: !6, line: 689, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !263, line: 110, baseType: !264)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !555, file: !6, line: 690, baseType: !193, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !555, file: !6, line: 692, baseType: !562, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !544}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !555, file: !6, line: 693, baseType: !566, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!287, !544}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !555, file: !6, line: 694, baseType: !562, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !546, file: !6, line: 266, baseType: !265, size: 32, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !546, file: !6, line: 267, baseType: !265, size: 32, offset: 352)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "input_components", scope: !546, file: !6, line: 268, baseType: !196, size: 32, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "in_color_space", scope: !546, file: !6, line: 269, baseType: !574, size: 32, offset: 416)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !6, line: 201, baseType: !5)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "input_gamma", scope: !546, file: !6, line: 271, baseType: !576, size: 64, offset: 448)
!576 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !546, file: !6, line: 281, baseType: !196, size: 32, offset: 512)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !546, file: !6, line: 283, baseType: !196, size: 32, offset: 544)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !546, file: !6, line: 284, baseType: !574, size: 32, offset: 576)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !546, file: !6, line: 286, baseType: !581, size: 64, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !6, line: 179, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 116, size: 768, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !614}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !583, file: !6, line: 120, baseType: !196, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !583, file: !6, line: 121, baseType: !196, size: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !583, file: !6, line: 122, baseType: !196, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !583, file: !6, line: 123, baseType: !196, size: 32, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !583, file: !6, line: 124, baseType: !196, size: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !583, file: !6, line: 129, baseType: !196, size: 32, offset: 160)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !583, file: !6, line: 130, baseType: !196, size: 32, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !583, file: !6, line: 139, baseType: !265, size: 32, offset: 224)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !583, file: !6, line: 140, baseType: !265, size: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !583, file: !6, line: 147, baseType: !196, size: 32, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !583, file: !6, line: 154, baseType: !265, size: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !583, file: !6, line: 155, baseType: !265, size: 32, offset: 352)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !583, file: !6, line: 160, baseType: !287, size: 32, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !583, file: !6, line: 164, baseType: !196, size: 32, offset: 416)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !583, file: !6, line: 165, baseType: !196, size: 32, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !583, file: !6, line: 166, baseType: !196, size: 32, offset: 480)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !583, file: !6, line: 167, baseType: !196, size: 32, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !583, file: !6, line: 168, baseType: !196, size: 32, offset: 544)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !583, file: !6, line: 169, baseType: !196, size: 32, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !583, file: !6, line: 175, baseType: !605, size: 64, offset: 640)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !6, line: 95, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 83, size: 1056, elements: !608)
!608 = !{!609, !613}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !607, file: !6, line: 88, baseType: !610, size: 1024)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 1024, elements: !278)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !263, line: 147, baseType: !612)
!612 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !607, file: !6, line: 94, baseType: !287, size: 32, offset: 1024)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !583, file: !6, line: 178, baseType: !192, size: 64, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !546, file: !6, line: 289, baseType: !616, size: 256, offset: 704)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 256, elements: !523)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !546, file: !6, line: 292, baseType: !618, size: 256, offset: 960)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 256, elements: !523)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !6, line: 111, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 100, size: 2240, elements: !622)
!622 = !{!623, !628, !632}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !621, file: !6, line: 102, baseType: !624, size: 136)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 136, elements: !626)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !263, line: 135, baseType: !264)
!626 = !{!627}
!627 = !DISubrange(count: 17)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !621, file: !6, line: 104, baseType: !629, size: 2048, offset: 136)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 2048, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !621, file: !6, line: 110, baseType: !287, size: 32, offset: 2208)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !546, file: !6, line: 293, baseType: !618, size: 256, offset: 1216)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !546, file: !6, line: 296, baseType: !635, size: 128, offset: 1472)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 128, elements: !454)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !546, file: !6, line: 297, baseType: !635, size: 128, offset: 1600)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !546, file: !6, line: 298, baseType: !635, size: 128, offset: 1728)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "num_scans", scope: !546, file: !6, line: 300, baseType: !196, size: 32, offset: 1856)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "scan_info", scope: !546, file: !6, line: 301, baseType: !640, size: 64, offset: 1920)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_scan_info", file: !6, line: 189, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 184, size: 288, elements: !644)
!644 = !{!645, !646, !648, !649, !650, !651}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !643, file: !6, line: 185, baseType: !196, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !643, file: !6, line: 186, baseType: !647, size: 128, offset: 32)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 128, elements: !523)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !643, file: !6, line: 187, baseType: !196, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !643, file: !6, line: 187, baseType: !196, size: 32, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !643, file: !6, line: 188, baseType: !196, size: 32, offset: 224)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !643, file: !6, line: 188, baseType: !196, size: 32, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_in", scope: !546, file: !6, line: 307, baseType: !287, size: 32, offset: 1984)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !546, file: !6, line: 308, baseType: !287, size: 32, offset: 2016)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_coding", scope: !546, file: !6, line: 309, baseType: !287, size: 32, offset: 2048)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !546, file: !6, line: 310, baseType: !287, size: 32, offset: 2080)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "smoothing_factor", scope: !546, file: !6, line: 311, baseType: !196, size: 32, offset: 2112)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !546, file: !6, line: 312, baseType: !658, size: 32, offset: 2144)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !6, line: 209, baseType: !15)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !546, file: !6, line: 319, baseType: !7, size: 32, offset: 2176)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "restart_in_rows", scope: !546, file: !6, line: 320, baseType: !196, size: 32, offset: 2208)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "write_JFIF_header", scope: !546, file: !6, line: 324, baseType: !287, size: 32, offset: 2240)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !546, file: !6, line: 329, baseType: !625, size: 8, offset: 2272)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !546, file: !6, line: 330, baseType: !611, size: 16, offset: 2288)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !546, file: !6, line: 331, baseType: !611, size: 16, offset: 2304)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "write_Adobe_marker", scope: !546, file: !6, line: 332, baseType: !287, size: 32, offset: 2336)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "next_scanline", scope: !546, file: !6, line: 339, baseType: !265, size: 32, offset: 2368)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !546, file: !6, line: 348, baseType: !287, size: 32, offset: 2400)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !546, file: !6, line: 349, baseType: !196, size: 32, offset: 2432)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !546, file: !6, line: 350, baseType: !196, size: 32, offset: 2464)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !546, file: !6, line: 352, baseType: !265, size: 32, offset: 2496)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !546, file: !6, line: 363, baseType: !196, size: 32, offset: 2528)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !546, file: !6, line: 364, baseType: !673, size: 256, offset: 2560)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 256, elements: !523)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !546, file: !6, line: 367, baseType: !265, size: 32, offset: 2816)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !546, file: !6, line: 368, baseType: !265, size: 32, offset: 2848)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !546, file: !6, line: 370, baseType: !196, size: 32, offset: 2880)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !546, file: !6, line: 371, baseType: !678, size: 320, offset: 2912)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 320, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 10)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !546, file: !6, line: 375, baseType: !196, size: 32, offset: 3232)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !546, file: !6, line: 375, baseType: !196, size: 32, offset: 3264)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !546, file: !6, line: 375, baseType: !196, size: 32, offset: 3296)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !546, file: !6, line: 375, baseType: !196, size: 32, offset: 3328)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !546, file: !6, line: 380, baseType: !686, size: 64, offset: 3392)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_comp_master", file: !6, line: 380, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !546, file: !6, line: 381, baseType: !689, size: 64, offset: 3456)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_main_controller", file: !6, line: 381, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "prep", scope: !546, file: !6, line: 382, baseType: !692, size: 64, offset: 3520)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_prep_controller", file: !6, line: 382, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !546, file: !6, line: 383, baseType: !695, size: 64, offset: 3584)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_coef_controller", file: !6, line: 383, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !546, file: !6, line: 384, baseType: !698, size: 64, offset: 3648)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_writer", file: !6, line: 384, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !546, file: !6, line: 385, baseType: !701, size: 64, offset: 3712)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_converter", file: !6, line: 385, flags: DIFlagFwdDecl)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !546, file: !6, line: 386, baseType: !704, size: 64, offset: 3776)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_downsampler", file: !6, line: 386, flags: DIFlagFwdDecl)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !546, file: !6, line: 387, baseType: !707, size: 64, offset: 3840)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_forward_dct", file: !6, line: 387, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !546, file: !6, line: 388, baseType: !710, size: 64, offset: 3904)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_encoder", file: !6, line: 388, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!713 = !{}
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !3, line: 280, type: !716, isLocal: true, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 376, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 47)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !3, line: 281, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 104, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 13)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !3, line: 281, type: !428, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !3, line: 286, type: !728, isLocal: true, isDefinition: true)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 80, elements: !679)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !3, line: 286, type: !728, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !3, line: 290, type: !728, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !3, line: 297, type: !321, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !3, line: 303, type: !517, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !3, line: 303, type: !517, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !3, line: 313, type: !538, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !3, line: 319, type: !743, isLocal: true, isDefinition: true)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 96, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 12)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !3, line: 330, type: !538, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !3, line: 334, type: !331, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !3, line: 339, type: !752, isLocal: true, isDefinition: true)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 56, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 7)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !538, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !3, line: 356, type: !538, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !3, line: 375, type: !752, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !3, line: 385, type: !321, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !3, line: 398, type: !752, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !3, line: 410, type: !321, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "is_targa", scope: !2, file: !3, line: 76, type: !287, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !3, line: 144, type: !402, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !3, line: 148, type: !721, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !3, line: 151, type: !392, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !3, line: 152, type: !777, isLocal: true, isDefinition: true)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 552, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 69)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !3, line: 153, type: !782, isLocal: true, isDefinition: true)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 368, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 46)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !3, line: 155, type: !787, isLocal: true, isDefinition: true)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 624, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 78)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !3, line: 158, type: !716, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !3, line: 161, type: !794, isLocal: true, isDefinition: true)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 528, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 66)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !3, line: 163, type: !477, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !3, line: 165, type: !350, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !3, line: 166, type: !510, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !3, line: 169, type: !805, isLocal: true, isDefinition: true)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 456, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 57)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !3, line: 170, type: !810, isLocal: true, isDefinition: true)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 8, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 1)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !3, line: 173, type: !815, isLocal: true, isDefinition: true)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 400, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 50)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !3, line: 176, type: !820, isLocal: true, isDefinition: true)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 544, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 68)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !3, line: 178, type: !825, isLocal: true, isDefinition: true)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 504, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 63)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !3, line: 180, type: !830, isLocal: true, isDefinition: true)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 416, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 52)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !3, line: 181, type: !716, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !3, line: 182, type: !423, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !3, line: 183, type: !377, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !3, line: 187, type: !372, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !3, line: 188, type: !843, isLocal: true, isDefinition: true)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 448, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 56)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !3, line: 189, type: !843, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !3, line: 190, type: !487, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !3, line: 192, type: !805, isLocal: true, isDefinition: true)
!852 = !{i32 7, !"Dwarf Version", i32 5}
!853 = !{i32 2, !"Debug Info Version", i32 3}
!854 = !{i32 1, !"wchar_size", i32 4}
!855 = !{i32 8, !"PIC Level", i32 2}
!856 = !{i32 7, !"PIE Level", i32 2}
!857 = !{i32 7, !"uwtable", i32 2}
!858 = !{i32 7, !"frame-pointer", i32 2}
!859 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!860 = distinct !DISubprogram(name: "main1", scope: !3, file: !3, line: 461, type: !861, scopeLine: 462, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !713)
!861 = !DISubroutineType(types: !862)
!862 = !{!196, !196, !712}
!863 = !DILocalVariable(name: "argc", arg: 1, scope: !860, file: !3, line: 461, type: !196)
!864 = !DILocation(line: 461, column: 12, scope: !860)
!865 = !DILocalVariable(name: "argv", arg: 2, scope: !860, file: !3, line: 461, type: !712)
!866 = !DILocation(line: 461, column: 25, scope: !860)
!867 = !DILocalVariable(name: "cinfo", scope: !860, file: !3, line: 463, type: !546)
!868 = !DILocation(line: 463, column: 31, scope: !860)
!869 = !DILocalVariable(name: "jerr", scope: !860, file: !3, line: 464, type: !203)
!870 = !DILocation(line: 464, column: 25, scope: !860)
!871 = !DILocalVariable(name: "file_index", scope: !860, file: !3, line: 468, type: !196)
!872 = !DILocation(line: 468, column: 7, scope: !860)
!873 = !DILocalVariable(name: "src_mgr", scope: !860, file: !3, line: 469, type: !874)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_source_ptr", file: !875, line: 24, baseType: !876)
!875 = !DIFile(filename: "cBench/consumer_jpeg_c/src/cdjpeg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "bced6b83fac9f9ba4577dcff987736ac")
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_source_struct", file: !875, line: 26, size: 384, elements: !878)
!878 = !{!879, !883, !887, !888, !937, !938}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "start_input", scope: !877, file: !875, line: 27, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !544, !874}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "get_pixel_rows", scope: !877, file: !875, line: 29, baseType: !884, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!265, !544, !874}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input", scope: !877, file: !875, line: 31, baseType: !880, size: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "input_file", scope: !877, file: !875, line: 34, baseType: !889, size: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !891, line: 7, baseType: !892)
!891 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !893, line: 49, size: 1728, elements: !894)
!893 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!894 = !{!895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !910, !912, !913, !914, !917, !918, !920, !921, !924, !926, !929, !932, !933, !934, !935, !936}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !892, file: !893, line: 51, baseType: !196, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !892, file: !893, line: 54, baseType: !218, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !892, file: !893, line: 55, baseType: !218, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !892, file: !893, line: 56, baseType: !218, size: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !892, file: !893, line: 57, baseType: !218, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !892, file: !893, line: 58, baseType: !218, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !892, file: !893, line: 59, baseType: !218, size: 64, offset: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !892, file: !893, line: 60, baseType: !218, size: 64, offset: 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !892, file: !893, line: 61, baseType: !218, size: 64, offset: 512)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !892, file: !893, line: 64, baseType: !218, size: 64, offset: 576)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !892, file: !893, line: 65, baseType: !218, size: 64, offset: 640)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !892, file: !893, line: 66, baseType: !218, size: 64, offset: 704)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !892, file: !893, line: 68, baseType: !908, size: 64, offset: 768)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !893, line: 36, flags: DIFlagFwdDecl)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !892, file: !893, line: 70, baseType: !911, size: 64, offset: 832)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !892, file: !893, line: 72, baseType: !196, size: 32, offset: 896)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !892, file: !893, line: 73, baseType: !196, size: 32, offset: 928)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !892, file: !893, line: 74, baseType: !915, size: 64, offset: 960)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !916, line: 152, baseType: !235)
!916 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !892, file: !893, line: 77, baseType: !612, size: 16, offset: 1024)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !892, file: !893, line: 78, baseType: !919, size: 8, offset: 1040)
!919 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !892, file: !893, line: 79, baseType: !810, size: 8, offset: 1048)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !892, file: !893, line: 81, baseType: !922, size: 64, offset: 1088)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !893, line: 43, baseType: null)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !892, file: !893, line: 89, baseType: !925, size: 64, offset: 1152)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !916, line: 153, baseType: !235)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !892, file: !893, line: 91, baseType: !927, size: 64, offset: 1216)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !893, line: 37, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !892, file: !893, line: 92, baseType: !930, size: 64, offset: 1280)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !893, line: 38, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !892, file: !893, line: 93, baseType: !911, size: 64, offset: 1344)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !892, file: !893, line: 94, baseType: !192, size: 64, offset: 1408)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !892, file: !893, line: 95, baseType: !193, size: 64, offset: 1472)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !892, file: !893, line: 96, baseType: !196, size: 32, offset: 1536)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !892, file: !893, line: 98, baseType: !439, size: 160, offset: 1568)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !877, file: !875, line: 36, baseType: !258, size: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_height", scope: !877, file: !875, line: 37, baseType: !265, size: 32, offset: 320)
!939 = !DILocation(line: 469, column: 20, scope: !860)
!940 = !DILocalVariable(name: "input_file", scope: !860, file: !3, line: 470, type: !889)
!941 = !DILocation(line: 470, column: 10, scope: !860)
!942 = !DILocalVariable(name: "output_file", scope: !860, file: !3, line: 471, type: !889)
!943 = !DILocation(line: 471, column: 10, scope: !860)
!944 = !DILocalVariable(name: "num_scanlines", scope: !860, file: !3, line: 472, type: !265)
!945 = !DILocation(line: 472, column: 14, scope: !860)
!946 = !DILocation(line: 479, column: 14, scope: !860)
!947 = !DILocation(line: 479, column: 12, scope: !860)
!948 = !DILocation(line: 480, column: 7, scope: !949)
!949 = distinct !DILexicalBlock(scope: !860, file: !3, line: 480, column: 7)
!950 = !DILocation(line: 480, column: 16, scope: !949)
!951 = !DILocation(line: 480, column: 24, scope: !949)
!952 = !DILocation(line: 480, column: 27, scope: !949)
!953 = !DILocation(line: 480, column: 39, scope: !949)
!954 = !DILocation(line: 481, column: 14, scope: !949)
!955 = !DILocation(line: 481, column: 5, scope: !949)
!956 = !DILocation(line: 484, column: 15, scope: !860)
!957 = !DILocation(line: 484, column: 9, scope: !860)
!958 = !DILocation(line: 484, column: 13, scope: !860)
!959 = !DILocation(line: 485, column: 3, scope: !860)
!960 = !DILocation(line: 487, column: 8, scope: !860)
!961 = !DILocation(line: 487, column: 28, scope: !860)
!962 = !DILocation(line: 488, column: 8, scope: !860)
!963 = !DILocation(line: 488, column: 28, scope: !860)
!964 = !DILocation(line: 489, column: 8, scope: !860)
!965 = !DILocation(line: 489, column: 27, scope: !860)
!966 = !DILocation(line: 502, column: 9, scope: !860)
!967 = !DILocation(line: 502, column: 24, scope: !860)
!968 = !DILocation(line: 503, column: 3, scope: !860)
!969 = !DILocation(line: 511, column: 39, scope: !860)
!970 = !DILocation(line: 511, column: 45, scope: !860)
!971 = !DILocation(line: 511, column: 16, scope: !860)
!972 = !DILocation(line: 511, column: 14, scope: !860)
!973 = !DILocation(line: 531, column: 7, scope: !974)
!974 = distinct !DILexicalBlock(scope: !860, file: !3, line: 531, column: 7)
!975 = !DILocation(line: 531, column: 20, scope: !974)
!976 = !DILocation(line: 531, column: 24, scope: !974)
!977 = !DILocation(line: 531, column: 18, scope: !974)
!978 = !DILocation(line: 532, column: 13, scope: !979)
!979 = distinct !DILexicalBlock(scope: !974, file: !3, line: 531, column: 28)
!980 = !DILocation(line: 532, column: 50, scope: !979)
!981 = !DILocation(line: 532, column: 5, scope: !979)
!982 = !DILocation(line: 533, column: 5, scope: !979)
!983 = !DILocation(line: 534, column: 3, scope: !979)
!984 = !DILocation(line: 538, column: 7, scope: !985)
!985 = distinct !DILexicalBlock(scope: !860, file: !3, line: 538, column: 7)
!986 = !DILocation(line: 538, column: 20, scope: !985)
!987 = !DILocation(line: 538, column: 18, scope: !985)
!988 = !DILocation(line: 539, column: 29, scope: !989)
!989 = distinct !DILexicalBlock(scope: !990, file: !3, line: 539, column: 9)
!990 = distinct !DILexicalBlock(scope: !985, file: !3, line: 538, column: 26)
!991 = !DILocation(line: 539, column: 34, scope: !989)
!992 = !DILocation(line: 539, column: 23, scope: !989)
!993 = !DILocation(line: 539, column: 21, scope: !989)
!994 = !DILocation(line: 539, column: 61, scope: !989)
!995 = !DILocation(line: 540, column: 15, scope: !996)
!996 = distinct !DILexicalBlock(scope: !989, file: !3, line: 539, column: 70)
!997 = !DILocation(line: 540, column: 46, scope: !996)
!998 = !DILocation(line: 540, column: 56, scope: !996)
!999 = !DILocation(line: 540, column: 61, scope: !996)
!1000 = !DILocation(line: 540, column: 7, scope: !996)
!1001 = !DILocation(line: 541, column: 7, scope: !996)
!1002 = !DILocation(line: 543, column: 3, scope: !990)
!1003 = !DILocation(line: 545, column: 18, scope: !1004)
