; ModuleID = 'cBench/consumer_jpeg_c/src/jcdctmgr.c'
source_filename = "cBench/consumer_jpeg_c/src/jcdctmgr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_compress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, double, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], [16 x i8], [16 x i8], [16 x i8], i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.my_fdct_controller = type { %struct.jpeg_forward_dct, ptr, [4 x ptr], ptr, [4 x ptr] }
%struct.jpeg_forward_dct = type { ptr, ptr }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.jpeg_component_info = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }
%struct.JQUANT_TBL = type { [64 x i16], i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "aanscales", scope: !2, file: !3, line: 99, type: !555, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "start_pass_fdctmgr", scope: !3, file: !3, line: 54, type: !4, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !396, retainedNodes: !554)
!3 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jcdctmgr.c", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "95c917f33d937a00e781bad6d69b6d94")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_compress_ptr", file: !7, line: 249, baseType: !8)
!7 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpeglib.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "2a2b23235fe587b10147d741e3371e67")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !7, line: 255, size: 3968, elements: !10)
!10 = !{!11, !139, !140, !141, !142, !143, !158, !159, !160, !161, !171, !173, !174, !175, !176, !211, !215, !231, !232, !236, !237, !238, !239, !252, !253, !254, !255, !256, !257, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !279, !280, !281, !282, !286, !287, !288, !289, !290, !300, !320, !331, !340, !355, !364, !374, !383}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !9, file: !7, line: 256, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !7, line: 618, size: 1344, elements: !14)
!14 = !{!15, !107, !108, !109, !115, !116, !117, !128, !129, !130, !135, !136, !137, !138}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !13, file: !7, line: 620, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !7, line: 248, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !7, line: 240, size: 256, elements: !22)
!22 = !{!23, !24, !96, !105, !106}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !21, file: !7, line: 241, baseType: !12, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !21, file: !7, line: 241, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !7, line: 731, size: 768, elements: !27)
!27 = !{!28, !37, !38, !51, !65, !73, !80, !81, !85, !89, !93, !94}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !26, file: !7, line: 733, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !19, !33, !34}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !35, line: 18, baseType: !36)
!35 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!36 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !26, file: !7, line: 735, baseType: !29, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !26, file: !7, line: 737, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !19, !33, !49, !49}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !7, line: 67, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !7, line: 66, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !47, line: 59, baseType: !48)
!47 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!48 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !47, line: 171, baseType: !50)
!50 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !26, file: !7, line: 740, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !19, !33, !49, !49}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !7, line: 72, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !7, line: 71, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !7, line: 70, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1024, elements: !63)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !47, line: 99, baseType: !62)
!62 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!63 = !{!64}
!64 = !DISubrange(count: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !26, file: !7, line: 743, baseType: !66, size: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !19, !33, !72, !49, !49, !49}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !7, line: 727, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !7, line: 727, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !47, line: 227, baseType: !33)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !26, file: !7, line: 749, baseType: !74, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !19, !33, !72, !49, !49, !49}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !7, line: 728, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !7, line: 728, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !26, file: !7, line: 755, baseType: !16, size: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !26, file: !7, line: 756, baseType: !82, size: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!42, !19, !69, !49, !49, !72}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !26, file: !7, line: 761, baseType: !86, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!55, !19, !77, !49, !49, !72}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !26, file: !7, line: 766, baseType: !90, size: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !19, !33}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !26, file: !7, line: 767, baseType: !16, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !26, file: !7, line: 774, baseType: !95, size: 64, offset: 704)
!95 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !21, file: !7, line: 241, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !7, line: 676, size: 256, elements: !99)
!99 = !{!100, !101, !102, !103, !104}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !98, file: !7, line: 677, baseType: !16, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !98, file: !7, line: 679, baseType: !95, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !98, file: !7, line: 680, baseType: !95, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !98, file: !7, line: 681, baseType: !33, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !98, file: !7, line: 682, baseType: !33, size: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !21, file: !7, line: 241, baseType: !72, size: 32, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !21, file: !7, line: 241, baseType: !33, size: 32, offset: 224)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !13, file: !7, line: 622, baseType: !90, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !13, file: !7, line: 624, baseType: !16, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !13, file: !7, line: 626, baseType: !110, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !19, !113}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !13, file: !7, line: 629, baseType: !16, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !13, file: !7, line: 634, baseType: !33, size: 32, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !13, file: !7, line: 639, baseType: !118, size: 640, offset: 352)
!118 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !13, file: !7, line: 636, size: 640, elements: !119)
!119 = !{!120, !124}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !118, file: !7, line: 637, baseType: !121, size: 256)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 256, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 8)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !118, file: !7, line: 638, baseType: !125, size: 640)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 640, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 80)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !13, file: !7, line: 643, baseType: !33, size: 32, offset: 992)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !13, file: !7, line: 651, baseType: !95, size: 64, offset: 1024)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !13, file: !7, line: 663, baseType: !131, size: 64, offset: 1088)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !13, file: !7, line: 664, baseType: !33, size: 32, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !13, file: !7, line: 668, baseType: !131, size: 64, offset: 1216)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !13, file: !7, line: 669, baseType: !33, size: 32, offset: 1280)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !13, file: !7, line: 670, baseType: !33, size: 32, offset: 1312)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !9, file: !7, line: 256, baseType: !25, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !9, file: !7, line: 256, baseType: !97, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !9, file: !7, line: 256, baseType: !72, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !9, file: !7, line: 256, baseType: !33, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !9, file: !7, line: 259, baseType: !144, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !7, line: 688, size: 320, elements: !146)
!146 = !{!147, !150, !151, !153, !157}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !145, file: !7, line: 689, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !47, line: 110, baseType: !48)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !145, file: !7, line: 690, baseType: !34, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !145, file: !7, line: 692, baseType: !152, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !145, file: !7, line: 693, baseType: !154, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!72, !6}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !145, file: !7, line: 694, baseType: !152, size: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !9, file: !7, line: 266, baseType: !49, size: 32, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !9, file: !7, line: 267, baseType: !49, size: 32, offset: 352)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "input_components", scope: !9, file: !7, line: 268, baseType: !33, size: 32, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "in_color_space", scope: !9, file: !7, line: 269, baseType: !162, size: 32, offset: 416)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !7, line: 201, baseType: !163)
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 194, baseType: !50, size: 32, elements: !164)
!164 = !{!165, !166, !167, !168, !169, !170}
!165 = !DIEnumerator(name: "JCS_UNKNOWN", value: 0)
!166 = !DIEnumerator(name: "JCS_GRAYSCALE", value: 1)
!167 = !DIEnumerator(name: "JCS_RGB", value: 2)
!168 = !DIEnumerator(name: "JCS_YCbCr", value: 3)
!169 = !DIEnumerator(name: "JCS_CMYK", value: 4)
!170 = !DIEnumerator(name: "JCS_YCCK", value: 5)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "input_gamma", scope: !9, file: !7, line: 271, baseType: !172, size: 64, offset: 448)
!172 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !9, file: !7, line: 281, baseType: !33, size: 32, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !9, file: !7, line: 283, baseType: !33, size: 32, offset: 544)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !9, file: !7, line: 284, baseType: !162, size: 32, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !9, file: !7, line: 286, baseType: !177, size: 64, offset: 640)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !7, line: 179, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 116, size: 768, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !210}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !179, file: !7, line: 120, baseType: !33, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !179, file: !7, line: 121, baseType: !33, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !179, file: !7, line: 122, baseType: !33, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !179, file: !7, line: 123, baseType: !33, size: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !179, file: !7, line: 124, baseType: !33, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !179, file: !7, line: 129, baseType: !33, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !179, file: !7, line: 130, baseType: !33, size: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !179, file: !7, line: 139, baseType: !49, size: 32, offset: 224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !179, file: !7, line: 140, baseType: !49, size: 32, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !179, file: !7, line: 147, baseType: !33, size: 32, offset: 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !179, file: !7, line: 154, baseType: !49, size: 32, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !179, file: !7, line: 155, baseType: !49, size: 32, offset: 352)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !179, file: !7, line: 160, baseType: !72, size: 32, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !179, file: !7, line: 164, baseType: !33, size: 32, offset: 416)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !179, file: !7, line: 165, baseType: !33, size: 32, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !179, file: !7, line: 166, baseType: !33, size: 32, offset: 480)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !179, file: !7, line: 167, baseType: !33, size: 32, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !179, file: !7, line: 168, baseType: !33, size: 32, offset: 544)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !179, file: !7, line: 169, baseType: !33, size: 32, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !179, file: !7, line: 175, baseType: !201, size: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !7, line: 95, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 83, size: 1056, elements: !204)
!204 = !{!205, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !203, file: !7, line: 88, baseType: !206, size: 1024)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 1024, elements: !63)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !47, line: 147, baseType: !208)
!208 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !203, file: !7, line: 94, baseType: !72, size: 32, offset: 1024)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !179, file: !7, line: 178, baseType: !32, size: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !9, file: !7, line: 289, baseType: !212, size: 256, offset: 704)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 256, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 4)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !9, file: !7, line: 292, baseType: !216, size: 256, offset: 960)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 256, elements: !213)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !7, line: 111, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 100, size: 2240, elements: !220)
!220 = !{!221, !226, !230}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !219, file: !7, line: 102, baseType: !222, size: 136)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 136, elements: !224)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !47, line: 135, baseType: !48)
!224 = !{!225}
!225 = !DISubrange(count: 17)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !219, file: !7, line: 104, baseType: !227, size: 2048, offset: 136)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 2048, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !219, file: !7, line: 110, baseType: !72, size: 32, offset: 2208)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !9, file: !7, line: 293, baseType: !216, size: 256, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !9, file: !7, line: 296, baseType: !233, size: 128, offset: 1472)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 128, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !9, file: !7, line: 297, baseType: !233, size: 128, offset: 1600)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !9, file: !7, line: 298, baseType: !233, size: 128, offset: 1728)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "num_scans", scope: !9, file: !7, line: 300, baseType: !33, size: 32, offset: 1856)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "scan_info", scope: !9, file: !7, line: 301, baseType: !240, size: 64, offset: 1920)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_scan_info", file: !7, line: 189, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 184, size: 288, elements: !244)
!244 = !{!245, !246, !248, !249, !250, !251}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !243, file: !7, line: 185, baseType: !33, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !243, file: !7, line: 186, baseType: !247, size: 128, offset: 32)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, elements: !213)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !243, file: !7, line: 187, baseType: !33, size: 32, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !243, file: !7, line: 187, baseType: !33, size: 32, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !243, file: !7, line: 188, baseType: !33, size: 32, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !243, file: !7, line: 188, baseType: !33, size: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_in", scope: !9, file: !7, line: 307, baseType: !72, size: 32, offset: 1984)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !9, file: !7, line: 308, baseType: !72, size: 32, offset: 2016)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_coding", scope: !9, file: !7, line: 309, baseType: !72, size: 32, offset: 2048)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !9, file: !7, line: 310, baseType: !72, size: 32, offset: 2080)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "smoothing_factor", scope: !9, file: !7, line: 311, baseType: !33, size: 32, offset: 2112)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !9, file: !7, line: 312, baseType: !258, size: 32, offset: 2144)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !7, line: 209, baseType: !259)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 205, baseType: !50, size: 32, elements: !260)
!260 = !{!261, !262, !263}
!261 = !DIEnumerator(name: "JDCT_ISLOW", value: 0)
!262 = !DIEnumerator(name: "JDCT_IFAST", value: 1)
!263 = !DIEnumerator(name: "JDCT_FLOAT", value: 2)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !9, file: !7, line: 319, baseType: !50, size: 32, offset: 2176)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "restart_in_rows", scope: !9, file: !7, line: 320, baseType: !33, size: 32, offset: 2208)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "write_JFIF_header", scope: !9, file: !7, line: 324, baseType: !72, size: 32, offset: 2240)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !9, file: !7, line: 329, baseType: !223, size: 8, offset: 2272)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !9, file: !7, line: 330, baseType: !207, size: 16, offset: 2288)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !9, file: !7, line: 331, baseType: !207, size: 16, offset: 2304)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "write_Adobe_marker", scope: !9, file: !7, line: 332, baseType: !72, size: 32, offset: 2336)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next_scanline", scope: !9, file: !7, line: 339, baseType: !49, size: 32, offset: 2368)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !9, file: !7, line: 348, baseType: !72, size: 32, offset: 2400)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !9, file: !7, line: 349, baseType: !33, size: 32, offset: 2432)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !9, file: !7, line: 350, baseType: !33, size: 32, offset: 2464)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !9, file: !7, line: 352, baseType: !49, size: 32, offset: 2496)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !9, file: !7, line: 363, baseType: !33, size: 32, offset: 2528)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !9, file: !7, line: 364, baseType: !278, size: 256, offset: 2560)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 256, elements: !213)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !9, file: !7, line: 367, baseType: !49, size: 32, offset: 2816)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !9, file: !7, line: 368, baseType: !49, size: 32, offset: 2848)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !9, file: !7, line: 370, baseType: !33, size: 32, offset: 2880)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !9, file: !7, line: 371, baseType: !283, size: 320, offset: 2912)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 320, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 10)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !9, file: !7, line: 375, baseType: !33, size: 32, offset: 3232)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !9, file: !7, line: 375, baseType: !33, size: 32, offset: 3264)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !9, file: !7, line: 375, baseType: !33, size: 32, offset: 3296)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !9, file: !7, line: 375, baseType: !33, size: 32, offset: 3328)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !9, file: !7, line: 380, baseType: !291, size: 64, offset: 3392)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_comp_master", file: !293, line: 45, size: 256, elements: !294)
!293 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpegint.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "87e9869e13f29b8e74a9dee50528c6c5")
!294 = !{!295, !296, !297, !298, !299}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_pass", scope: !292, file: !293, line: 46, baseType: !152, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pass_startup", scope: !292, file: !293, line: 47, baseType: !152, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !292, file: !293, line: 48, baseType: !152, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "call_pass_startup", scope: !292, file: !293, line: 51, baseType: !72, size: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "is_last_pass", scope: !292, file: !293, line: 52, baseType: !72, size: 32, offset: 224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !9, file: !7, line: 381, baseType: !301, size: 64, offset: 3456)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_main_controller", file: !293, line: 56, size: 128, elements: !303)
!303 = !{!304, !315}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !302, file: !293, line: 57, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !6, !308}
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !293, line: 22, baseType: !309)
!309 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !293, line: 16, baseType: !50, size: 32, elements: !310)
!310 = !{!311, !312, !313, !314}
!311 = !DIEnumerator(name: "JBUF_PASS_THRU", value: 0)
!312 = !DIEnumerator(name: "JBUF_SAVE_SOURCE", value: 1)
!313 = !DIEnumerator(name: "JBUF_CRANK_DEST", value: 2)
!314 = !DIEnumerator(name: "JBUF_SAVE_AND_PASS", value: 3)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !302, file: !293, line: 58, baseType: !316, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !6, !42, !319, !49}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "prep", scope: !9, file: !7, line: 382, baseType: !321, size: 64, offset: 3520)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_prep_controller", file: !293, line: 64, size: 128, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !322, file: !293, line: 65, baseType: !305, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pre_process_data", scope: !322, file: !293, line: 66, baseType: !326, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !6, !42, !319, !49, !329, !319, !49}
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !7, line: 68, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !9, file: !7, line: 383, baseType: !332, size: 64, offset: 3584)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_coef_controller", file: !293, line: 76, size: 128, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !333, file: !293, line: 77, baseType: !305, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "compress_data", scope: !333, file: !293, line: 78, baseType: !337, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!72, !6, !329}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !9, file: !7, line: 384, baseType: !341, size: 64, offset: 3648)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_writer", file: !293, line: 120, size: 384, elements: !343)
!343 = !{!344, !350, !351, !352, !353, !354}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "write_any_marker", scope: !342, file: !293, line: 123, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !6, !33, !348, !50}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_header", scope: !342, file: !293, line: 125, baseType: !152, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame_header", scope: !342, file: !293, line: 126, baseType: !152, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "write_scan_header", scope: !342, file: !293, line: 127, baseType: !152, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_trailer", scope: !342, file: !293, line: 128, baseType: !152, size: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "write_tables_only", scope: !342, file: !293, line: 129, baseType: !152, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !9, file: !7, line: 385, baseType: !356, size: 64, offset: 3712)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_converter", file: !293, line: 83, size: 128, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !357, file: !293, line: 84, baseType: !152, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !357, file: !293, line: 85, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !6, !42, !329, !49, !33}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !9, file: !7, line: 386, baseType: !365, size: 64, offset: 3776)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_downsampler", file: !293, line: 91, size: 192, elements: !367)
!367 = !{!368, !369, !373}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !366, file: !293, line: 92, baseType: !152, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !366, file: !293, line: 93, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !6, !329, !49, !329, !49}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !366, file: !293, line: 98, baseType: !72, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !9, file: !7, line: 387, baseType: !375, size: 64, offset: 3840)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_forward_dct", file: !293, line: 102, size: 128, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !376, file: !293, line: 103, baseType: !152, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "forward_DCT", scope: !376, file: !293, line: 105, baseType: !380, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !6, !177, !42, !57, !49, !49, !49}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !9, file: !7, line: 388, baseType: !384, size: 64, offset: 3904)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_encoder", file: !293, line: 113, size: 192, elements: !386)
!386 = !{!387, !391, !395}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !385, file: !293, line: 114, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !6, !72}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "encode_mcu", scope: !385, file: !293, line: 115, baseType: !392, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!72, !6, !56}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !385, file: !293, line: 116, baseType: !152, size: 64, offset: 128)
!396 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !397, retainedTypes: !522, globals: !549, splitDebugInlining: false, nameTableKind: None)
!397 = !{!163, !259, !309, !398}
!398 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !399, line: 33, baseType: !50, size: 32, elements: !400)
!399 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jerror.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "a232f2460ff0049c960896e323d8710b")
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521}
!401 = !DIEnumerator(name: "JMSG_NOMESSAGE", value: 0)
!402 = !DIEnumerator(name: "JERR_ARITH_NOTIMPL", value: 1)
!403 = !DIEnumerator(name: "JERR_BAD_ALIGN_TYPE", value: 2)
!404 = !DIEnumerator(name: "JERR_BAD_ALLOC_CHUNK", value: 3)
!405 = !DIEnumerator(name: "JERR_BAD_BUFFER_MODE", value: 4)
!406 = !DIEnumerator(name: "JERR_BAD_COMPONENT_ID", value: 5)
!407 = !DIEnumerator(name: "JERR_BAD_DCTSIZE", value: 6)
!408 = !DIEnumerator(name: "JERR_BAD_IN_COLORSPACE", value: 7)
!409 = !DIEnumerator(name: "JERR_BAD_J_COLORSPACE", value: 8)
!410 = !DIEnumerator(name: "JERR_BAD_LENGTH", value: 9)
!411 = !DIEnumerator(name: "JERR_BAD_LIB_VERSION", value: 10)
!412 = !DIEnumerator(name: "JERR_BAD_MCU_SIZE", value: 11)
!413 = !DIEnumerator(name: "JERR_BAD_POOL_ID", value: 12)
!414 = !DIEnumerator(name: "JERR_BAD_PRECISION", value: 13)
!415 = !DIEnumerator(name: "JERR_BAD_PROGRESSION", value: 14)
!416 = !DIEnumerator(name: "JERR_BAD_PROG_SCRIPT", value: 15)
!417 = !DIEnumerator(name: "JERR_BAD_SAMPLING", value: 16)
!418 = !DIEnumerator(name: "JERR_BAD_SCAN_SCRIPT", value: 17)
!419 = !DIEnumerator(name: "JERR_BAD_STATE", value: 18)
!420 = !DIEnumerator(name: "JERR_BAD_STRUCT_SIZE", value: 19)
!421 = !DIEnumerator(name: "JERR_BAD_VIRTUAL_ACCESS", value: 20)
!422 = !DIEnumerator(name: "JERR_BUFFER_SIZE", value: 21)
!423 = !DIEnumerator(name: "JERR_CANT_SUSPEND", value: 22)
!424 = !DIEnumerator(name: "JERR_CCIR601_NOTIMPL", value: 23)
!425 = !DIEnumerator(name: "JERR_COMPONENT_COUNT", value: 24)
!426 = !DIEnumerator(name: "JERR_CONVERSION_NOTIMPL", value: 25)
!427 = !DIEnumerator(name: "JERR_DAC_INDEX", value: 26)
!428 = !DIEnumerator(name: "JERR_DAC_VALUE", value: 27)
!429 = !DIEnumerator(name: "JERR_DHT_COUNTS", value: 28)
!430 = !DIEnumerator(name: "JERR_DHT_INDEX", value: 29)
!431 = !DIEnumerator(name: "JERR_DQT_INDEX", value: 30)
!432 = !DIEnumerator(name: "JERR_EMPTY_IMAGE", value: 31)
!433 = !DIEnumerator(name: "JERR_EMS_READ", value: 32)
!434 = !DIEnumerator(name: "JERR_EMS_WRITE", value: 33)
!435 = !DIEnumerator(name: "JERR_EOI_EXPECTED", value: 34)
!436 = !DIEnumerator(name: "JERR_FILE_READ", value: 35)
!437 = !DIEnumerator(name: "JERR_FILE_WRITE", value: 36)
!438 = !DIEnumerator(name: "JERR_FRACT_SAMPLE_NOTIMPL", value: 37)
!439 = !DIEnumerator(name: "JERR_HUFF_CLEN_OVERFLOW", value: 38)
!440 = !DIEnumerator(name: "JERR_HUFF_MISSING_CODE", value: 39)
!441 = !DIEnumerator(name: "JERR_IMAGE_TOO_BIG", value: 40)
!442 = !DIEnumerator(name: "JERR_INPUT_EMPTY", value: 41)
!443 = !DIEnumerator(name: "JERR_INPUT_EOF", value: 42)
!444 = !DIEnumerator(name: "JERR_MISMATCHED_QUANT_TABLE", value: 43)
!445 = !DIEnumerator(name: "JERR_MISSING_DATA", value: 44)
!446 = !DIEnumerator(name: "JERR_MODE_CHANGE", value: 45)
!447 = !DIEnumerator(name: "JERR_NOTIMPL", value: 46)
!448 = !DIEnumerator(name: "JERR_NOT_COMPILED", value: 47)
!449 = !DIEnumerator(name: "JERR_NO_BACKING_STORE", value: 48)
!450 = !DIEnumerator(name: "JERR_NO_HUFF_TABLE", value: 49)
!451 = !DIEnumerator(name: "JERR_NO_IMAGE", value: 50)
!452 = !DIEnumerator(name: "JERR_NO_QUANT_TABLE", value: 51)
!453 = !DIEnumerator(name: "JERR_NO_SOI", value: 52)
!454 = !DIEnumerator(name: "JERR_OUT_OF_MEMORY", value: 53)
!455 = !DIEnumerator(name: "JERR_QUANT_COMPONENTS", value: 54)
!456 = !DIEnumerator(name: "JERR_QUANT_FEW_COLORS", value: 55)
!457 = !DIEnumerator(name: "JERR_QUANT_MANY_COLORS", value: 56)
!458 = !DIEnumerator(name: "JERR_SOF_DUPLICATE", value: 57)
!459 = !DIEnumerator(name: "JERR_SOF_NO_SOS", value: 58)
!460 = !DIEnumerator(name: "JERR_SOF_UNSUPPORTED", value: 59)
!461 = !DIEnumerator(name: "JERR_SOI_DUPLICATE", value: 60)
!462 = !DIEnumerator(name: "JERR_SOS_NO_SOF", value: 61)
!463 = !DIEnumerator(name: "JERR_TFILE_CREATE", value: 62)
!464 = !DIEnumerator(name: "JERR_TFILE_READ", value: 63)
!465 = !DIEnumerator(name: "JERR_TFILE_SEEK", value: 64)
!466 = !DIEnumerator(name: "JERR_TFILE_WRITE", value: 65)
!467 = !DIEnumerator(name: "JERR_TOO_LITTLE_DATA", value: 66)
!468 = !DIEnumerator(name: "JERR_UNKNOWN_MARKER", value: 67)
!469 = !DIEnumerator(name: "JERR_VIRTUAL_BUG", value: 68)
!470 = !DIEnumerator(name: "JERR_WIDTH_OVERFLOW", value: 69)
!471 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!472 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!473 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!474 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!475 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!476 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!477 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!478 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!479 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!480 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!481 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!482 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!483 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!484 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!485 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!486 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!487 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!488 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!489 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!490 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!491 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!492 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!493 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!494 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!495 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!496 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!497 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!498 = !DIEnumerator(name: "JTRC_RST", value: 97)
!499 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!500 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!501 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!502 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!503 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!504 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!505 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!506 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!507 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!508 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!509 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!510 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!511 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!512 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!513 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!514 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!515 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!516 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!517 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!518 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!519 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!520 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!521 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!522 = !{!523, !19, !34, !375, !32, !535, !536, !548, !544, !545, !172, !33, !61}
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_fdct_ptr", file: !3, line: 41, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_fdct_controller", file: !3, line: 39, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 22, size: 768, elements: !527)
!527 = !{!528, !529, !537, !539, !546}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !526, file: !3, line: 23, baseType: !376, size: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "do_dct", scope: !526, file: !3, line: 26, baseType: !530, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "forward_DCT_method_ptr", file: !531, line: 35, baseType: !532)
!531 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jdct.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "18978d93cfb1aabf5618c3caa5dbcf5a")
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCTELEM", file: !531, line: 30, baseType: !33)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "divisors", scope: !526, file: !3, line: 32, baseType: !538, size: 256, offset: 192)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 256, elements: !213)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "do_float_dct", scope: !526, file: !3, line: 36, baseType: !540, size: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_DCT_method_ptr", file: !531, line: 36, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !544}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "float_divisors", scope: !526, file: !3, line: 37, baseType: !547, size: 256, offset: 512)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 256, elements: !213)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !47, line: 161, baseType: !95)
!549 = !{!0, !550}
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "aanscalefactor", scope: !2, file: !3, line: 140, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 512, elements: !122)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!554 = !{}
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 1024, elements: !63)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !47, line: 155, baseType: !62)
!558 = !{i32 7, !"Dwarf Version", i32 5}
!559 = !{i32 2, !"Debug Info Version", i32 3}
!560 = !{i32 1, !"wchar_size", i32 4}
!561 = !{i32 8, !"PIC Level", i32 2}
!562 = !{i32 7, !"PIE Level", i32 2}
!563 = !{i32 7, !"uwtable", i32 2}
!564 = !{i32 7, !"frame-pointer", i32 2}
!565 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!566 = distinct !DISubprogram(name: "jinit_forward_dct", scope: !3, file: !3, line: 345, type: !4, scopeLine: 346, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !396, retainedNodes: !554)
!567 = !DILocalVariable(name: "cinfo", arg: 1, scope: !566, file: !3, line: 345, type: !6)
!568 = !DILocation(line: 345, column: 35, scope: !566)
!569 = !DILocalVariable(name: "fdct", scope: !566, file: !3, line: 347, type: !523)
!570 = !DILocation(line: 347, column: 15, scope: !566)
!571 = !DILocalVariable(name: "i", scope: !566, file: !3, line: 348, type: !33)
!572 = !DILocation(line: 348, column: 7, scope: !566)
!573 = !DILocation(line: 351, column: 7, scope: !566)
!574 = !DILocation(line: 351, column: 14, scope: !566)
!575 = !DILocation(line: 351, column: 19, scope: !566)
!576 = !DILocation(line: 351, column: 48, scope: !566)
!577 = !DILocation(line: 351, column: 5, scope: !566)
!578 = !DILocation(line: 350, column: 8, scope: !566)
!579 = !DILocation(line: 353, column: 45, scope: !566)
!580 = !DILocation(line: 353, column: 3, scope: !566)
!581 = !DILocation(line: 353, column: 10, scope: !566)
!582 = !DILocation(line: 353, column: 15, scope: !566)
!583 = !DILocation(line: 354, column: 3, scope: !566)
!584 = !DILocation(line: 354, column: 9, scope: !566)
!585 = !DILocation(line: 354, column: 13, scope: !566)
!586 = !DILocation(line: 354, column: 24, scope: !566)
!587 = !DILocation(line: 356, column: 11, scope: !566)
!588 = !DILocation(line: 356, column: 18, scope: !566)
!589 = !DILocation(line: 356, column: 3, scope: !566)
!590 = !DILocation(line: 359, column: 5, scope: !591)
!591 = distinct !DILexicalBlock(scope: !566, file: !3, line: 356, column: 30)
!592 = !DILocation(line: 359, column: 11, scope: !591)
!593 = !DILocation(line: 359, column: 15, scope: !591)
!594 = !DILocation(line: 359, column: 27, scope: !591)
!595 = !DILocation(line: 360, column: 5, scope: !591)
!596 = !DILocation(line: 360, column: 11, scope: !591)
!597 = !DILocation(line: 360, column: 18, scope: !591)
!598 = !DILocation(line: 361, column: 5, scope: !591)
!599 = !DILocation(line: 365, column: 5, scope: !591)
!600 = !DILocation(line: 365, column: 11, scope: !591)
!601 = !DILocation(line: 365, column: 15, scope: !591)
!602 = !DILocation(line: 365, column: 27, scope: !591)
!603 = !DILocation(line: 366, column: 5, scope: !591)
!604 = !DILocation(line: 366, column: 11, scope: !591)
!605 = !DILocation(line: 366, column: 18, scope: !591)
!606 = !DILocation(line: 367, column: 5, scope: !591)
!607 = !DILocation(line: 371, column: 5, scope: !591)
!608 = !DILocation(line: 371, column: 11, scope: !591)
!609 = !DILocation(line: 371, column: 15, scope: !591)
