; ModuleID = 'cBench/consumer_jpeg_c/src/jchuff.c'
source_filename = "cBench/consumer_jpeg_c/src/jchuff.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_compress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, double, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], [16 x i8], [16 x i8], [16 x i8], i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.JHUFF_TBL = type { [17 x i8], [256 x i8], i32 }
%struct.c_derived_tbl = type { [256 x i32], [256 x i8] }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.huff_entropy_encoder = type { %struct.jpeg_entropy_encoder, %struct.savable_state, i32, i32, [4 x ptr], [4 x ptr], [4 x ptr], [4 x ptr] }
%struct.jpeg_entropy_encoder = type { ptr, ptr, ptr }
%struct.savable_state = type { i64, i32, [4 x i32] }
%struct.jpeg_component_info = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }
%struct.working_state = type { ptr, i64, %struct.savable_state, ptr }

!61 = !DIEnumerator(name: "JERR_EMS_WRITE", value: 33)
!62 = !DIEnumerator(name: "JERR_EOI_EXPECTED", value: 34)
!63 = !DIEnumerator(name: "JERR_FILE_READ", value: 35)
!64 = !DIEnumerator(name: "JERR_FILE_WRITE", value: 36)
!65 = !DIEnumerator(name: "JERR_FRACT_SAMPLE_NOTIMPL", value: 37)
!66 = !DIEnumerator(name: "JERR_HUFF_CLEN_OVERFLOW", value: 38)
!67 = !DIEnumerator(name: "JERR_HUFF_MISSING_CODE", value: 39)
!68 = !DIEnumerator(name: "JERR_IMAGE_TOO_BIG", value: 40)
!69 = !DIEnumerator(name: "JERR_INPUT_EMPTY", value: 41)
!70 = !DIEnumerator(name: "JERR_INPUT_EOF", value: 42)
!71 = !DIEnumerator(name: "JERR_MISMATCHED_QUANT_TABLE", value: 43)
!72 = !DIEnumerator(name: "JERR_MISSING_DATA", value: 44)
!73 = !DIEnumerator(name: "JERR_MODE_CHANGE", value: 45)
!74 = !DIEnumerator(name: "JERR_NOTIMPL", value: 46)
!75 = !DIEnumerator(name: "JERR_NOT_COMPILED", value: 47)
!76 = !DIEnumerator(name: "JERR_NO_BACKING_STORE", value: 48)
!77 = !DIEnumerator(name: "JERR_NO_HUFF_TABLE", value: 49)
!78 = !DIEnumerator(name: "JERR_NO_IMAGE", value: 50)
!79 = !DIEnumerator(name: "JERR_NO_QUANT_TABLE", value: 51)
!80 = !DIEnumerator(name: "JERR_NO_SOI", value: 52)
!81 = !DIEnumerator(name: "JERR_OUT_OF_MEMORY", value: 53)
!82 = !DIEnumerator(name: "JERR_QUANT_COMPONENTS", value: 54)
!83 = !DIEnumerator(name: "JERR_QUANT_FEW_COLORS", value: 55)
!84 = !DIEnumerator(name: "JERR_QUANT_MANY_COLORS", value: 56)
!85 = !DIEnumerator(name: "JERR_SOF_DUPLICATE", value: 57)
!86 = !DIEnumerator(name: "JERR_SOF_NO_SOS", value: 58)
!87 = !DIEnumerator(name: "JERR_SOF_UNSUPPORTED", value: 59)
!88 = !DIEnumerator(name: "JERR_SOI_DUPLICATE", value: 60)
!89 = !DIEnumerator(name: "JERR_SOS_NO_SOF", value: 61)
!90 = !DIEnumerator(name: "JERR_TFILE_CREATE", value: 62)
!91 = !DIEnumerator(name: "JERR_TFILE_READ", value: 63)
!92 = !DIEnumerator(name: "JERR_TFILE_SEEK", value: 64)
!93 = !DIEnumerator(name: "JERR_TFILE_WRITE", value: 65)
!94 = !DIEnumerator(name: "JERR_TOO_LITTLE_DATA", value: 66)
!95 = !DIEnumerator(name: "JERR_UNKNOWN_MARKER", value: 67)
!96 = !DIEnumerator(name: "JERR_VIRTUAL_BUG", value: 68)
!97 = !DIEnumerator(name: "JERR_WIDTH_OVERFLOW", value: 69)
!98 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!99 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!100 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!101 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!102 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!103 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!104 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!105 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!106 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!107 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!108 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!109 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!110 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!111 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!112 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!113 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!114 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!115 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!116 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!117 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!118 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!119 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!120 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!121 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!122 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!123 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!124 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!125 = !DIEnumerator(name: "JTRC_RST", value: 97)
!126 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!127 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!128 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!129 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!130 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!131 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!132 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!133 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!134 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!135 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!136 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!137 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!138 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!139 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!140 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!141 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!142 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!143 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!144 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!145 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!146 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!147 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!148 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!149 = !{!150, !151, !163, !219, !179, !162, !287, !289, !290, !531, !552, !317, !542, !5}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "c_derived_tbl", file: !153, line: 19, baseType: !154)
!153 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jchuff.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "5bae8b1c561c9841cb394bb534daf1ce")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 15, size: 10240, elements: !155)
!155 = !{!156, !160}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ehufco", scope: !154, file: !153, line: 16, baseType: !157, size: 8192)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8192, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ehufsi", scope: !154, file: !153, line: 17, baseType: !161, size: 2048, offset: 8192)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 2048, elements: !158)
!162 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !166)
!166 = !{!167, !211, !276, !285, !286}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !165, file: !4, line: 241, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !170)
!170 = !{!171, !175, !180, !181, !186, !187, !188, !199, !200, !202, !207, !208, !209, !210}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !169, file: !4, line: 620, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !163}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !169, file: !4, line: 622, baseType: !176, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !163, !179}
!179 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !169, file: !4, line: 624, baseType: !172, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !169, file: !4, line: 626, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !163, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !169, file: !4, line: 629, baseType: !172, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !169, file: !4, line: 634, baseType: !179, size: 32, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !169, file: !4, line: 639, baseType: !189, size: 640, offset: 352)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !4, line: 636, size: 640, elements: !190)
!190 = !{!191, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !189, file: !4, line: 637, baseType: !192, size: 256)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 256, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 8)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !189, file: !4, line: 638, baseType: !196, size: 640)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 640, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 80)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !169, file: !4, line: 643, baseType: !179, size: 32, offset: 992)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !169, file: !4, line: 651, baseType: !201, size: 64, offset: 1024)
!201 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !169, file: !4, line: 663, baseType: !203, size: 64, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !169, file: !4, line: 664, baseType: !179, size: 32, offset: 1152)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !169, file: !4, line: 668, baseType: !203, size: 64, offset: 1216)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !169, file: !4, line: 669, baseType: !179, size: 32, offset: 1280)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !169, file: !4, line: 670, baseType: !179, size: 32, offset: 1312)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !165, file: !4, line: 241, baseType: !212, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !214)
!214 = !{!215, !222, !223, !235, !249, !257, !264, !265, !269, !273, !274, !275}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !213, file: !4, line: 733, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!150, !163, !179, !219}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 18, baseType: !221)
!220 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!221 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !213, file: !4, line: 735, baseType: !216, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !213, file: !4, line: 737, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !163, !179, !234, !234}
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !232, line: 59, baseType: !233)
!232 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!233 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !232, line: 171, baseType: !5)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !213, file: !4, line: 740, baseType: !236, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !163, !179, !234, !234}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 1024, elements: !247)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !232, line: 99, baseType: !246)
!246 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!247 = !{!248}
!248 = !DISubrange(count: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !213, file: !4, line: 743, baseType: !250, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!253, !163, !179, !256, !234, !234, !234}
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !232, line: 227, baseType: !179)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !213, file: !4, line: 749, baseType: !258, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !163, !179, !256, !234, !234, !234}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !213, file: !4, line: 755, baseType: !172, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !213, file: !4, line: 756, baseType: !266, size: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!227, !163, !253, !234, !234, !256}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !213, file: !4, line: 761, baseType: !270, size: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!239, !163, !261, !234, !234, !256}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !213, file: !4, line: 766, baseType: !176, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !213, file: !4, line: 767, baseType: !172, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !213, file: !4, line: 774, baseType: !201, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !165, file: !4, line: 241, baseType: !277, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !278, file: !4, line: 677, baseType: !172, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !278, file: !4, line: 679, baseType: !201, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !278, file: !4, line: 680, baseType: !201, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !278, file: !4, line: 681, baseType: !179, size: 32, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !278, file: !4, line: 682, baseType: !179, size: 32, offset: 224)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !165, file: !4, line: 241, baseType: !256, size: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !165, file: !4, line: 241, baseType: !179, size: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !232, line: 135, baseType: !233)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "huff_entropy_ptr", file: !1, line: 74, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "huff_entropy_encoder", file: !1, line: 72, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 55, size: 1536, elements: !294)
!294 = !{!295, !537, !545, !546, !547, !549, !550, !553}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !293, file: !1, line: 56, baseType: !296, size: 192)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_encoder", file: !19, line: 113, size: 192, elements: !297)
!297 = !{!298, !532, !536}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !296, file: !19, line: 114, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !302, !256}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_compress_ptr", file: !4, line: 249, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !4, line: 255, size: 3968, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !328, !329, !330, !331, !333, !335, !336, !337, !338, !373, !377, !390, !391, !395, !396, !397, !398, !411, !412, !413, !414, !415, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !433, !434, !435, !436, !440, !441, !442, !443, !444, !453, !467, !478, !487, !502, !511, !521, !530}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !304, file: !4, line: 256, baseType: !168, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !304, file: !4, line: 256, baseType: !212, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !304, file: !4, line: 256, baseType: !277, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !304, file: !4, line: 256, baseType: !256, size: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !304, file: !4, line: 256, baseType: !179, size: 32, offset: 224)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !304, file: !4, line: 259, baseType: !312, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !4, line: 688, size: 320, elements: !314)
!314 = !{!315, !318, !319, !323, !327}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !313, file: !4, line: 689, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !232, line: 110, baseType: !233)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !313, file: !4, line: 690, baseType: !219, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !313, file: !4, line: 692, baseType: !320, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !302}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !313, file: !4, line: 693, baseType: !324, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!256, !302}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !313, file: !4, line: 694, baseType: !320, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !304, file: !4, line: 266, baseType: !234, size: 32, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !304, file: !4, line: 267, baseType: !234, size: 32, offset: 352)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "input_components", scope: !304, file: !4, line: 268, baseType: !179, size: 32, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "in_color_space", scope: !304, file: !4, line: 269, baseType: !332, size: 32, offset: 416)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "input_gamma", scope: !304, file: !4, line: 271, baseType: !334, size: 64, offset: 448)
!334 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !304, file: !4, line: 281, baseType: !179, size: 32, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !304, file: !4, line: 283, baseType: !179, size: 32, offset: 544)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !304, file: !4, line: 284, baseType: !332, size: 32, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !304, file: !4, line: 286, baseType: !339, size: 64, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !372}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !341, file: !4, line: 120, baseType: !179, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !341, file: !4, line: 121, baseType: !179, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !341, file: !4, line: 122, baseType: !179, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !341, file: !4, line: 123, baseType: !179, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !341, file: !4, line: 124, baseType: !179, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !341, file: !4, line: 129, baseType: !179, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !341, file: !4, line: 130, baseType: !179, size: 32, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !341, file: !4, line: 139, baseType: !234, size: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !341, file: !4, line: 140, baseType: !234, size: 32, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !341, file: !4, line: 147, baseType: !179, size: 32, offset: 288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !341, file: !4, line: 154, baseType: !234, size: 32, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !341, file: !4, line: 155, baseType: !234, size: 32, offset: 352)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !341, file: !4, line: 160, baseType: !256, size: 32, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !341, file: !4, line: 164, baseType: !179, size: 32, offset: 416)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !341, file: !4, line: 165, baseType: !179, size: 32, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !341, file: !4, line: 166, baseType: !179, size: 32, offset: 480)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !341, file: !4, line: 167, baseType: !179, size: 32, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !341, file: !4, line: 168, baseType: !179, size: 32, offset: 544)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !341, file: !4, line: 169, baseType: !179, size: 32, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !341, file: !4, line: 175, baseType: !363, size: 64, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !366)
!366 = !{!367, !371}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !365, file: !4, line: 88, baseType: !368, size: 1024)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 1024, elements: !247)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !232, line: 147, baseType: !370)
!370 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !365, file: !4, line: 94, baseType: !256, size: 32, offset: 1024)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !341, file: !4, line: 178, baseType: !150, size: 64, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !304, file: !4, line: 289, baseType: !374, size: 256, offset: 704)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 256, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 4)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !304, file: !4, line: 292, baseType: !378, size: 256, offset: 960)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 256, elements: !375)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !382)
!382 = !{!383, !387, !389}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !381, file: !4, line: 102, baseType: !384, size: 136)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 136, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 17)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !381, file: !4, line: 104, baseType: !388, size: 2048, offset: 136)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 2048, elements: !158)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !381, file: !4, line: 110, baseType: !256, size: 32, offset: 2208)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !304, file: !4, line: 293, baseType: !378, size: 256, offset: 1216)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !304, file: !4, line: 296, baseType: !392, size: 128, offset: 1472)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 128, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 16)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !304, file: !4, line: 297, baseType: !392, size: 128, offset: 1600)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !304, file: !4, line: 298, baseType: !392, size: 128, offset: 1728)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "num_scans", scope: !304, file: !4, line: 300, baseType: !179, size: 32, offset: 1856)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "scan_info", scope: !304, file: !4, line: 301, baseType: !399, size: 64, offset: 1920)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_scan_info", file: !4, line: 189, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 184, size: 288, elements: !403)
!403 = !{!404, !405, !407, !408, !409, !410}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !402, file: !4, line: 185, baseType: !179, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !402, file: !4, line: 186, baseType: !406, size: 128, offset: 32)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 128, elements: !375)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !402, file: !4, line: 187, baseType: !179, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !402, file: !4, line: 187, baseType: !179, size: 32, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !402, file: !4, line: 188, baseType: !179, size: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !402, file: !4, line: 188, baseType: !179, size: 32, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_in", scope: !304, file: !4, line: 307, baseType: !256, size: 32, offset: 1984)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !304, file: !4, line: 308, baseType: !256, size: 32, offset: 2016)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_coding", scope: !304, file: !4, line: 309, baseType: !256, size: 32, offset: 2048)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !304, file: !4, line: 310, baseType: !256, size: 32, offset: 2080)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "smoothing_factor", scope: !304, file: !4, line: 311, baseType: !179, size: 32, offset: 2112)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !304, file: !4, line: 312, baseType: !417, size: 32, offset: 2144)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !304, file: !4, line: 319, baseType: !5, size: 32, offset: 2176)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "restart_in_rows", scope: !304, file: !4, line: 320, baseType: !179, size: 32, offset: 2208)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "write_JFIF_header", scope: !304, file: !4, line: 324, baseType: !256, size: 32, offset: 2240)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !304, file: !4, line: 329, baseType: !289, size: 8, offset: 2272)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !304, file: !4, line: 330, baseType: !369, size: 16, offset: 2288)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !304, file: !4, line: 331, baseType: !369, size: 16, offset: 2304)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "write_Adobe_marker", scope: !304, file: !4, line: 332, baseType: !256, size: 32, offset: 2336)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next_scanline", scope: !304, file: !4, line: 339, baseType: !234, size: 32, offset: 2368)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !304, file: !4, line: 348, baseType: !256, size: 32, offset: 2400)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !304, file: !4, line: 349, baseType: !179, size: 32, offset: 2432)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !304, file: !4, line: 350, baseType: !179, size: 32, offset: 2464)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !304, file: !4, line: 352, baseType: !234, size: 32, offset: 2496)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !304, file: !4, line: 363, baseType: !179, size: 32, offset: 2528)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !304, file: !4, line: 364, baseType: !432, size: 256, offset: 2560)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 256, elements: !375)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !304, file: !4, line: 367, baseType: !234, size: 32, offset: 2816)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !304, file: !4, line: 368, baseType: !234, size: 32, offset: 2848)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !304, file: !4, line: 370, baseType: !179, size: 32, offset: 2880)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !304, file: !4, line: 371, baseType: !437, size: 320, offset: 2912)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 320, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 10)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !304, file: !4, line: 375, baseType: !179, size: 32, offset: 3232)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !304, file: !4, line: 375, baseType: !179, size: 32, offset: 3264)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !304, file: !4, line: 375, baseType: !179, size: 32, offset: 3296)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !304, file: !4, line: 375, baseType: !179, size: 32, offset: 3328)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !304, file: !4, line: 380, baseType: !445, size: 64, offset: 3392)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_comp_master", file: !19, line: 45, size: 256, elements: !447)
!447 = !{!448, !449, !450, !451, !452}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_pass", scope: !446, file: !19, line: 46, baseType: !320, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pass_startup", scope: !446, file: !19, line: 47, baseType: !320, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !446, file: !19, line: 48, baseType: !320, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "call_pass_startup", scope: !446, file: !19, line: 51, baseType: !256, size: 32, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "is_last_pass", scope: !446, file: !19, line: 52, baseType: !256, size: 32, offset: 224)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !304, file: !4, line: 381, baseType: !454, size: 64, offset: 3456)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_main_controller", file: !19, line: 56, size: 128, elements: !456)
!456 = !{!457, !462}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !455, file: !19, line: 57, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !302, !461}
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !19, line: 22, baseType: !18)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !455, file: !19, line: 58, baseType: !463, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !302, !227, !466, !234}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "prep", scope: !304, file: !4, line: 382, baseType: !468, size: 64, offset: 3520)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_prep_controller", file: !19, line: 64, size: 128, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !469, file: !19, line: 65, baseType: !458, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pre_process_data", scope: !469, file: !19, line: 66, baseType: !473, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !302, !227, !466, !234, !476, !466, !234}
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !4, line: 68, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !304, file: !4, line: 383, baseType: !479, size: 64, offset: 3584)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_coef_controller", file: !19, line: 76, size: 128, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !480, file: !19, line: 77, baseType: !458, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "compress_data", scope: !480, file: !19, line: 78, baseType: !484, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!256, !302, !476}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !304, file: !4, line: 384, baseType: !488, size: 64, offset: 3648)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_writer", file: !19, line: 120, size: 384, elements: !490)
!490 = !{!491, !497, !498, !499, !500, !501}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "write_any_marker", scope: !489, file: !19, line: 123, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !302, !179, !495, !5}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_header", scope: !489, file: !19, line: 125, baseType: !320, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame_header", scope: !489, file: !19, line: 126, baseType: !320, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "write_scan_header", scope: !489, file: !19, line: 127, baseType: !320, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_trailer", scope: !489, file: !19, line: 128, baseType: !320, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "write_tables_only", scope: !489, file: !19, line: 129, baseType: !320, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !304, file: !4, line: 385, baseType: !503, size: 64, offset: 3712)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_converter", file: !19, line: 83, size: 128, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !504, file: !19, line: 84, baseType: !320, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !504, file: !19, line: 85, baseType: !508, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !302, !227, !476, !234, !179}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !304, file: !4, line: 386, baseType: !512, size: 64, offset: 3776)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_downsampler", file: !19, line: 91, size: 192, elements: !514)
!514 = !{!515, !516, !520}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !513, file: !19, line: 92, baseType: !320, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !513, file: !19, line: 93, baseType: !517, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !302, !476, !234, !476, !234}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !513, file: !19, line: 98, baseType: !256, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !304, file: !4, line: 387, baseType: !522, size: 64, offset: 3840)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_forward_dct", file: !19, line: 102, size: 128, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !523, file: !19, line: 103, baseType: !320, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "forward_DCT", scope: !523, file: !19, line: 105, baseType: !527, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !302, !339, !227, !241, !234, !234, !234}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !304, file: !4, line: 388, baseType: !531, size: 64, offset: 3904)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "encode_mcu", scope: !296, file: !19, line: 115, baseType: !533, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!256, !302, !240}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !296, file: !19, line: 116, baseType: !320, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !293, file: !1, line: 58, baseType: !538, size: 256, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "savable_state", file: !1, line: 33, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 29, size: 256, elements: !540)
!540 = !{!541, !543, !544}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "put_buffer", scope: !539, file: !1, line: 30, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !232, line: 161, baseType: !201)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "put_bits", scope: !539, file: !1, line: 31, baseType: !179, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "last_dc_val", scope: !539, file: !1, line: 32, baseType: !406, size: 128, offset: 96)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "restarts_to_go", scope: !293, file: !1, line: 61, baseType: !5, size: 32, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next_restart_num", scope: !293, file: !1, line: 62, baseType: !179, size: 32, offset: 480)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dc_derived_tbls", scope: !293, file: !1, line: 65, baseType: !548, size: 256, offset: 512)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 256, elements: !375)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ac_derived_tbls", scope: !293, file: !1, line: 66, baseType: !548, size: 256, offset: 768)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "dc_count_ptrs", scope: !293, file: !1, line: 69, baseType: !551, size: 256, offset: 1024)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 256, elements: !375)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ac_count_ptrs", scope: !293, file: !1, line: 70, baseType: !551, size: 256, offset: 1280)
!554 = !{i32 7, !"Dwarf Version", i32 5}
!555 = !{i32 2, !"Debug Info Version", i32 3}
!556 = !{i32 1, !"wchar_size", i32 4}
!557 = !{i32 8, !"PIC Level", i32 2}
!558 = !{i32 7, !"PIE Level", i32 2}
!559 = !{i32 7, !"uwtable", i32 2}
!560 = !{i32 7, !"frame-pointer", i32 2}
!561 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!562 = distinct !DISubprogram(name: "jpeg_make_c_derived_tbl", scope: !1, file: !1, line: 179, type: !563, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !566)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !302, !379, !565}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!566 = !{}
!567 = !DILocalVariable(name: "cinfo", arg: 1, scope: !562, file: !1, line: 179, type: !302)
!568 = !DILocation(line: 179, column: 41, scope: !562)
!569 = !DILocalVariable(name: "htbl", arg: 2, scope: !562, file: !1, line: 179, type: !379)
!570 = !DILocation(line: 179, column: 60, scope: !562)
!571 = !DILocalVariable(name: "pdtbl", arg: 3, scope: !562, file: !1, line: 180, type: !565)
!572 = !DILocation(line: 180, column: 22, scope: !562)
!573 = !DILocalVariable(name: "dtbl", scope: !562, file: !1, line: 182, type: !151)
!574 = !DILocation(line: 182, column: 18, scope: !562)
!575 = !DILocalVariable(name: "p", scope: !562, file: !1, line: 183, type: !179)
!576 = !DILocation(line: 183, column: 7, scope: !562)
!577 = !DILocalVariable(name: "i", scope: !562, file: !1, line: 183, type: !179)
!578 = !DILocation(line: 183, column: 10, scope: !562)
!579 = !DILocalVariable(name: "l", scope: !562, file: !1, line: 183, type: !179)
!580 = !DILocation(line: 183, column: 13, scope: !562)
!581 = !DILocalVariable(name: "lastp", scope: !562, file: !1, line: 183, type: !179)
!582 = !DILocation(line: 183, column: 16, scope: !562)
!583 = !DILocalVariable(name: "si", scope: !562, file: !1, line: 183, type: !179)
!584 = !DILocation(line: 183, column: 23, scope: !562)
!585 = !DILocalVariable(name: "huffsize", scope: !562, file: !1, line: 184, type: !586)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 2056, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 257)
!589 = !DILocation(line: 184, column: 8, scope: !562)
!590 = !DILocalVariable(name: "huffcode", scope: !562, file: !1, line: 185, type: !591)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8224, elements: !587)
!592 = !DILocation(line: 185, column: 16, scope: !562)
!593 = !DILocalVariable(name: "code", scope: !562, file: !1, line: 186, type: !5)
!594 = !DILocation(line: 186, column: 16, scope: !562)
!595 = !DILocation(line: 189, column: 8, scope: !596)
!596 = distinct !DILexicalBlock(scope: !562, file: !1, line: 189, column: 7)
!597 = !DILocation(line: 189, column: 7, scope: !596)
!598 = !DILocation(line: 189, column: 14, scope: !596)
!599 = !DILocation(line: 191, column: 9, scope: !596)
!600 = !DILocation(line: 191, column: 16, scope: !596)
!601 = !DILocation(line: 191, column: 21, scope: !596)
!602 = !DILocation(line: 191, column: 50, scope: !596)
!603 = !DILocation(line: 191, column: 7, scope: !596)
!604 = !DILocation(line: 190, column: 6, scope: !596)
!605 = !DILocation(line: 190, column: 12, scope: !596)
!606 = !DILocation(line: 190, column: 5, scope: !596)
!607 = !DILocation(line: 193, column: 11, scope: !562)
!608 = !DILocation(line: 193, column: 10, scope: !562)
!609 = !DILocation(line: 193, column: 8, scope: !562)
!610 = !DILocation(line: 198, column: 5, scope: !562)
!611 = !DILocation(line: 199, column: 10, scope: !612)
!612 = distinct !DILexicalBlock(scope: !562, file: !1, line: 199, column: 3)
!613 = !DILocation(line: 199, column: 8, scope: !612)
!614 = !DILocation(line: 199, column: 15, scope: !615)
!615 = distinct !DILexicalBlock(scope: !612, file: !1, line: 199, column: 3)
!616 = !DILocation(line: 199, column: 17, scope: !615)
!617 = !DILocation(line: 199, column: 3, scope: !612)
!618 = !DILocation(line: 200, column: 12, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !1, line: 200, column: 5)
!620 = distinct !DILexicalBlock(scope: !615, file: !1, line: 199, column: 29)
!621 = !DILocation(line: 200, column: 10, scope: !619)
!622 = !DILocation(line: 200, column: 17, scope: !623)
!623 = distinct !DILexicalBlock(scope: !619, file: !1, line: 200, column: 5)
!624 = !DILocation(line: 200, column: 28, scope: !623)
!625 = !DILocation(line: 200, column: 34, scope: !623)
!626 = !DILocation(line: 200, column: 39, scope: !623)
!627 = !DILocation(line: 200, column: 22, scope: !623)
!628 = !DILocation(line: 200, column: 19, scope: !623)
!629 = !DILocation(line: 200, column: 5, scope: !619)
!630 = !DILocation(line: 201, column: 30, scope: !623)
!631 = !DILocation(line: 201, column: 23, scope: !623)
!632 = !DILocation(line: 201, column: 17, scope: !623)
!633 = !DILocation(line: 201, column: 7, scope: !623)
!634 = !DILocation(line: 201, column: 21, scope: !623)
!635 = !DILocation(line: 200, column: 44, scope: !623)
!636 = !DILocation(line: 200, column: 5, scope: !623)
!637 = distinct !{!637, !629, !638, !639}
!638 = !DILocation(line: 201, column: 30, scope: !619)
!639 = !{!"llvm.loop.mustprogress"}
!640 = !DILocation(line: 202, column: 3, scope: !620)
!641 = !DILocation(line: 199, column: 25, scope: !615)
!642 = !DILocation(line: 199, column: 3, scope: !615)
!643 = distinct !{!643, !617, !644, !639}
!644 = !DILocation(line: 202, column: 3, scope: !612)
!645 = !DILocation(line: 203, column: 12, scope: !562)
!646 = !DILocation(line: 203, column: 3, scope: !562)
!647 = !DILocation(line: 203, column: 15, scope: !562)
!648 = !DILocation(line: 204, column: 11, scope: !562)
!649 = !DILocation(line: 204, column: 9, scope: !562)
!650 = !DILocation(line: 209, column: 8, scope: !562)
!651 = !DILocation(line: 210, column: 8, scope: !562)
!652 = !DILocation(line: 210, column: 6, scope: !562)
!653 = !DILocation(line: 211, column: 5, scope: !562)
!654 = !DILocation(line: 212, column: 3, scope: !562)
!655 = !DILocation(line: 212, column: 19, scope: !562)
!656 = !DILocation(line: 212, column: 10, scope: !562)
!657 = !DILocation(line: 213, column: 5, scope: !658)
!658 = distinct !DILexicalBlock(scope: !562, file: !1, line: 212, column: 23)
!659 = !DILocation(line: 213, column: 28, scope: !658)
!660 = !DILocation(line: 213, column: 19, scope: !658)
!661 = !DILocation(line: 213, column: 13, scope: !658)
!662 = !DILocation(line: 213, column: 35, scope: !658)
!663 = !DILocation(line: 213, column: 32, scope: !658)
!664 = !DILocation(line: 214, column: 23, scope: !665)
!665 = distinct !DILexicalBlock(scope: !658, file: !1, line: 213, column: 39)
!666 = !DILocation(line: 214, column: 17, scope: !665)
!667 = !DILocation(line: 214, column: 7, scope: !665)
!668 = !DILocation(line: 214, column: 21, scope: !665)
!669 = !DILocation(line: 215, column: 11, scope: !665)
!670 = distinct !{!670, !657, !671, !639}
!671 = !DILocation(line: 216, column: 5, scope: !658)
!672 = !DILocation(line: 217, column: 10, scope: !658)
!673 = !DILocation(line: 218, column: 7, scope: !658)
!674 = distinct !{!674, !654, !675, !639}
!675 = !DILocation(line: 219, column: 3, scope: !562)
!676 = !DILocation(line: 227, column: 3, scope: !562)
!677 = !DILocation(line: 229, column: 10, scope: !678)
!678 = distinct !DILexicalBlock(scope: !562, file: !1, line: 229, column: 3)
!679 = !DILocation(line: 229, column: 8, scope: !678)
!680 = !DILocation(line: 229, column: 15, scope: !681)
!681 = distinct !DILexicalBlock(scope: !678, file: !1, line: 229, column: 3)
!682 = !DILocation(line: 229, column: 19, scope: !681)
!683 = !DILocation(line: 229, column: 17, scope: !681)
!684 = !DILocation(line: 229, column: 3, scope: !678)
!685 = !DILocation(line: 230, column: 47, scope: !686)
!686 = distinct !DILexicalBlock(scope: !681, file: !1, line: 229, column: 31)
!687 = !DILocation(line: 230, column: 38, scope: !686)
!688 = !DILocation(line: 230, column: 5, scope: !686)
!689 = !DILocation(line: 230, column: 11, scope: !686)
!690 = !DILocation(line: 230, column: 18, scope: !686)
!691 = !DILocation(line: 230, column: 24, scope: !686)
!692 = !DILocation(line: 230, column: 32, scope: !686)
!693 = !DILocation(line: 230, column: 36, scope: !686)
!694 = !DILocation(line: 231, column: 47, scope: !686)
!695 = !DILocation(line: 231, column: 38, scope: !686)
!696 = !DILocation(line: 231, column: 5, scope: !686)
!697 = !DILocation(line: 231, column: 11, scope: !686)
!698 = !DILocation(line: 231, column: 18, scope: !686)
!699 = !DILocation(line: 231, column: 24, scope: !686)
!700 = !DILocation(line: 231, column: 32, scope: !686)
!701 = !DILocation(line: 231, column: 36, scope: !686)
!702 = !DILocation(line: 232, column: 3, scope: !686)
!703 = !DILocation(line: 229, column: 27, scope: !681)
!704 = !DILocation(line: 229, column: 3, scope: !681)
!705 = distinct !{!705, !684, !706, !639}
!706 = !DILocation(line: 232, column: 3, scope: !678)
!707 = !DILocation(line: 233, column: 1, scope: !562)
!708 = distinct !DISubprogram(name: "jpeg_gen_optimal_table", scope: !1, file: !1, line: 642, type: !709, scopeLine: 643, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !566)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !302, !379, !552}
!711 = !DILocalVariable(name: "cinfo", arg: 1, scope: !708, file: !1, line: 642, type: !302)
!712 = !DILocation(line: 642, column: 40, scope: !708)
!713 = !DILocalVariable(name: "htbl", arg: 2, scope: !708, file: !1, line: 642, type: !379)
!714 = !DILocation(line: 642, column: 59, scope: !708)
!715 = !DILocalVariable(name: "freq", arg: 3, scope: !708, file: !1, line: 642, type: !552)
!716 = !DILocation(line: 642, column: 70, scope: !708)
!717 = !DILocalVariable(name: "bits", scope: !708, file: !1, line: 645, type: !718)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 264, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 33)
!721 = !DILocation(line: 645, column: 9, scope: !708)
!722 = !DILocalVariable(name: "codesize", scope: !708, file: !1, line: 646, type: !723)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 8224, elements: !587)
!724 = !DILocation(line: 646, column: 7, scope: !708)
!725 = !DILocalVariable(name: "others", scope: !708, file: !1, line: 647, type: !723)
!726 = !DILocation(line: 647, column: 7, scope: !708)
!727 = !DILocalVariable(name: "c1", scope: !708, file: !1, line: 648, type: !179)
!728 = !DILocation(line: 648, column: 7, scope: !708)
!729 = !DILocalVariable(name: "c2", scope: !708, file: !1, line: 648, type: !179)
!730 = !DILocation(line: 648, column: 11, scope: !708)
!731 = !DILocalVariable(name: "p", scope: !708, file: !1, line: 649, type: !179)
!732 = !DILocation(line: 649, column: 7, scope: !708)
!733 = !DILocalVariable(name: "i", scope: !708, file: !1, line: 649, type: !179)
!734 = !DILocation(line: 649, column: 10, scope: !708)
!735 = !DILocalVariable(name: "j", scope: !708, file: !1, line: 649, type: !179)
!736 = !DILocation(line: 649, column: 13, scope: !708)
!737 = !DILocalVariable(name: "v", scope: !708, file: !1, line: 650, type: !201)
!738 = !DILocation(line: 650, column: 8, scope: !708)
!739 = !DILocation(line: 654, column: 3, scope: !708)
!740 = !DILocation(line: 655, column: 3, scope: !708)
!741 = !DILocation(line: 656, column: 10, scope: !742)
!742 = distinct !DILexicalBlock(scope: !708, file: !1, line: 656, column: 3)
!743 = !DILocation(line: 656, column: 8, scope: !742)
!744 = !DILocation(line: 656, column: 15, scope: !745)
!745 = distinct !DILexicalBlock(scope: !742, file: !1, line: 656, column: 3)
!746 = !DILocation(line: 656, column: 17, scope: !745)
!747 = !DILocation(line: 656, column: 3, scope: !742)
!748 = !DILocation(line: 657, column: 12, scope: !745)
!749 = !DILocation(line: 657, column: 5, scope: !745)
!750 = !DILocation(line: 657, column: 15, scope: !745)
!751 = !DILocation(line: 656, column: 25, scope: !745)
!752 = !DILocation(line: 656, column: 3, scope: !745)
!753 = distinct !{!753, !747, !754, !639}
!754 = !DILocation(line: 657, column: 18, scope: !742)
!755 = !DILocation(line: 659, column: 3, scope: !708)
!756 = !DILocation(line: 659, column: 13, scope: !708)
!757 = !DILocation(line: 667, column: 3, scope: !708)
!758 = !DILocation(line: 670, column: 8, scope: !759)
!759 = distinct !DILexicalBlock(scope: !760, file: !1, line: 667, column: 12)
!760 = distinct !DILexicalBlock(scope: !761, file: !1, line: 667, column: 3)
!761 = distinct !DILexicalBlock(scope: !708, file: !1, line: 667, column: 3)
!762 = !DILocation(line: 671, column: 7, scope: !759)
!763 = !DILocation(line: 672, column: 12, scope: !764)
!764 = distinct !DILexicalBlock(scope: !759, file: !1, line: 672, column: 5)
!765 = !DILocation(line: 672, column: 10, scope: !764)
!766 = !DILocation(line: 672, column: 17, scope: !767)
!767 = distinct !DILexicalBlock(scope: !764, file: !1, line: 672, column: 5)
!768 = !DILocation(line: 672, column: 19, scope: !767)
!769 = !DILocation(line: 672, column: 5, scope: !764)
!770 = !DILocation(line: 673, column: 11, scope: !771)
!771 = distinct !DILexicalBlock(scope: !772, file: !1, line: 673, column: 11)
!772 = distinct !DILexicalBlock(scope: !767, file: !1, line: 672, column: 32)
!773 = !DILocation(line: 673, column: 16, scope: !771)
!774 = !DILocation(line: 673, column: 19, scope: !771)
!775 = !DILocation(line: 673, column: 22, scope: !771)
!776 = !DILocation(line: 673, column: 27, scope: !771)
!777 = !DILocation(line: 673, column: 33, scope: !771)
!778 = !DILocation(line: 673, column: 30, scope: !771)
!779 = !DILocation(line: 674, column: 6, scope: !780)
!780 = distinct !DILexicalBlock(scope: !771, file: !1, line: 673, column: 36)
!781 = !DILocation(line: 674, column: 11, scope: !780)
!782 = !DILocation(line: 674, column: 4, scope: !780)
!783 = !DILocation(line: 675, column: 7, scope: !780)
!784 = !DILocation(line: 675, column: 5, scope: !780)
!785 = !DILocation(line: 676, column: 7, scope: !780)
!786 = !DILocation(line: 677, column: 5, scope: !772)
!787 = !DILocation(line: 672, column: 28, scope: !767)
!788 = !DILocation(line: 672, column: 5, scope: !767)
!789 = distinct !{!789, !769, !790, !639}
!790 = !DILocation(line: 677, column: 5, scope: !764)
!791 = !DILocation(line: 681, column: 8, scope: !759)
!792 = !DILocation(line: 682, column: 7, scope: !759)
!793 = !DILocation(line: 683, column: 12, scope: !794)
!794 = distinct !DILexicalBlock(scope: !759, file: !1, line: 683, column: 5)
!795 = !DILocation(line: 683, column: 10, scope: !794)
!796 = !DILocation(line: 683, column: 17, scope: !797)
!797 = distinct !DILexicalBlock(scope: !794, file: !1, line: 683, column: 5)
!798 = !DILocation(line: 683, column: 19, scope: !797)
!799 = !DILocation(line: 683, column: 5, scope: !794)
!800 = !DILocation(line: 684, column: 11, scope: !801)
!801 = distinct !DILexicalBlock(scope: !802, file: !1, line: 684, column: 11)
!802 = distinct !DILexicalBlock(scope: !797, file: !1, line: 683, column: 32)
!803 = !DILocation(line: 684, column: 16, scope: !801)
!804 = !DILocation(line: 684, column: 19, scope: !801)
!805 = !DILocation(line: 684, column: 22, scope: !801)
!806 = !DILocation(line: 684, column: 27, scope: !801)
!807 = !DILocation(line: 684, column: 33, scope: !801)
!808 = !DILocation(line: 684, column: 30, scope: !801)
!809 = !DILocation(line: 684, column: 35, scope: !801)
!810 = !DILocation(line: 684, column: 38, scope: !801)
!811 = !DILocation(line: 684, column: 43, scope: !801)
!812 = !DILocation(line: 684, column: 40, scope: !801)
!813 = !DILocation(line: 685, column: 6, scope: !814)
!814 = distinct !DILexicalBlock(scope: !801, file: !1, line: 684, column: 47)
!815 = !DILocation(line: 685, column: 11, scope: !814)
!816 = !DILocation(line: 685, column: 4, scope: !814)
!817 = !DILocation(line: 686, column: 7, scope: !814)
!818 = !DILocation(line: 686, column: 5, scope: !814)
!819 = !DILocation(line: 687, column: 7, scope: !814)
!820 = !DILocation(line: 688, column: 5, scope: !802)
!821 = !DILocation(line: 683, column: 28, scope: !797)
!822 = !DILocation(line: 683, column: 5, scope: !797)
!823 = distinct !{!823, !799, !824, !639}
!824 = !DILocation(line: 688, column: 5, scope: !794)
!825 = !DILocation(line: 691, column: 9, scope: !826)
!826 = distinct !DILexicalBlock(scope: !759, file: !1, line: 691, column: 9)
!827 = !DILocation(line: 691, column: 12, scope: !826)
!828 = !DILocation(line: 692, column: 7, scope: !826)
!829 = !DILocation(line: 695, column: 17, scope: !759)
!830 = !DILocation(line: 695, column: 22, scope: !759)
!831 = !DILocation(line: 695, column: 5, scope: !759)
!832 = !DILocation(line: 695, column: 10, scope: !759)
!833 = !DILocation(line: 695, column: 14, scope: !759)
!834 = !DILocation(line: 696, column: 5, scope: !759)
!835 = !DILocation(line: 696, column: 10, scope: !759)
!836 = !DILocation(line: 696, column: 14, scope: !759)
!837 = !DILocation(line: 699, column: 14, scope: !759)
!838 = !DILocation(line: 699, column: 5, scope: !759)
!839 = !DILocation(line: 699, column: 17, scope: !759)
!840 = !DILocation(line: 700, column: 5, scope: !759)
!841 = !DILocation(line: 700, column: 19, scope: !759)
!842 = !DILocation(line: 700, column: 12, scope: !759)
!843 = !DILocation(line: 700, column: 23, scope: !759)
!844 = !DILocation(line: 701, column: 19, scope: !845)
!845 = distinct !DILexicalBlock(scope: !759, file: !1, line: 700, column: 29)
!846 = !DILocation(line: 701, column: 12, scope: !845)
!847 = !DILocation(line: 701, column: 10, scope: !845)
!848 = !DILocation(line: 702, column: 16, scope: !845)
!849 = !DILocation(line: 702, column: 7, scope: !845)
!850 = !DILocation(line: 702, column: 19, scope: !845)
!851 = distinct !{!851, !840, !852, !639}
!852 = !DILocation(line: 703, column: 5, scope: !759)
!853 = !DILocation(line: 705, column: 18, scope: !759)
!854 = !DILocation(line: 705, column: 12, scope: !759)
!855 = !DILocation(line: 705, column: 5, scope: !759)
!856 = !DILocation(line: 705, column: 16, scope: !759)
!857 = !DILocation(line: 708, column: 14, scope: !759)
!858 = !DILocation(line: 708, column: 5, scope: !759)
!859 = !DILocation(line: 708, column: 17, scope: !759)
!860 = !DILocation(line: 709, column: 5, scope: !759)
!861 = !DILocation(line: 709, column: 19, scope: !759)
!862 = !DILocation(line: 709, column: 12, scope: !759)
!863 = !DILocation(line: 709, column: 23, scope: !759)
!864 = !DILocation(line: 710, column: 19, scope: !865)
!865 = distinct !DILexicalBlock(scope: !759, file: !1, line: 709, column: 29)
!866 = !DILocation(line: 710, column: 12, scope: !865)
!867 = !DILocation(line: 710, column: 10, scope: !865)
!868 = !DILocation(line: 711, column: 16, scope: !865)
!869 = !DILocation(line: 711, column: 7, scope: !865)
!870 = !DILocation(line: 711, column: 19, scope: !865)
!871 = distinct !{!871, !860, !872, !639}
!872 = !DILocation(line: 712, column: 5, scope: !759)
!873 = !DILocation(line: 667, column: 3, scope: !760)
!874 = distinct !{!874, !875, !876}
!875 = !DILocation(line: 667, column: 3, scope: !761)
!876 = !DILocation(line: 713, column: 3, scope: !761)
!877 = !DILocation(line: 716, column: 10, scope: !878)
!878 = distinct !DILexicalBlock(scope: !708, file: !1, line: 716, column: 3)
!879 = !DILocation(line: 716, column: 8, scope: !878)
!880 = !DILocation(line: 716, column: 15, scope: !881)
!881 = distinct !DILexicalBlock(scope: !878, file: !1, line: 716, column: 3)
!882 = !DILocation(line: 716, column: 17, scope: !881)
!883 = !DILocation(line: 716, column: 3, scope: !878)
!884 = !DILocation(line: 717, column: 18, scope: !885)
!885 = distinct !DILexicalBlock(scope: !886, file: !1, line: 717, column: 9)
!886 = distinct !DILexicalBlock(scope: !881, file: !1, line: 716, column: 30)
!887 = !DILocation(line: 717, column: 9, scope: !885)
!888 = !DILocation(line: 720, column: 20, scope: !889)
!889 = distinct !DILexicalBlock(scope: !890, file: !1, line: 720, column: 11)
!890 = distinct !DILexicalBlock(scope: !885, file: !1, line: 717, column: 22)
!891 = !DILocation(line: 720, column: 11, scope: !889)
!892 = !DILocation(line: 720, column: 23, scope: !889)
!893 = !DILocation(line: 721, column: 2, scope: !889)
!894 = !DILocation(line: 723, column: 21, scope: !890)
!895 = !DILocation(line: 723, column: 12, scope: !890)
!896 = !DILocation(line: 723, column: 7, scope: !890)
!897 = !DILocation(line: 723, column: 24, scope: !890)
!898 = !DILocation(line: 724, column: 5, scope: !890)
!899 = !DILocation(line: 725, column: 3, scope: !886)
!900 = !DILocation(line: 716, column: 26, scope: !881)
!901 = !DILocation(line: 716, column: 3, scope: !881)
!902 = distinct !{!902, !883, !903, !639}
!903 = !DILocation(line: 725, column: 3, scope: !878)
!904 = !DILocation(line: 738, column: 10, scope: !905)
!905 = distinct !DILexicalBlock(scope: !708, file: !1, line: 738, column: 3)
!906 = !DILocation(line: 738, column: 8, scope: !905)
!907 = !DILocation(line: 738, column: 22, scope: !908)
!908 = distinct !DILexicalBlock(scope: !905, file: !1, line: 738, column: 3)
!909 = !DILocation(line: 738, column: 24, scope: !908)
!910 = !DILocation(line: 738, column: 3, scope: !905)
!911 = !DILocation(line: 739, column: 5, scope: !912)
!912 = distinct !DILexicalBlock(scope: !908, file: !1, line: 738, column: 35)
!913 = !DILocation(line: 739, column: 17, scope: !912)
!914 = !DILocation(line: 739, column: 12, scope: !912)
!915 = !DILocation(line: 739, column: 20, scope: !912)
!916 = !DILocation(line: 740, column: 11, scope: !917)
!917 = distinct !DILexicalBlock(scope: !912, file: !1, line: 739, column: 25)
!918 = !DILocation(line: 740, column: 13, scope: !917)
!919 = !DILocation(line: 740, column: 9, scope: !917)
!920 = !DILocation(line: 741, column: 7, scope: !917)
!921 = !DILocation(line: 741, column: 19, scope: !917)
!922 = !DILocation(line: 741, column: 14, scope: !917)
!923 = !DILocation(line: 741, column: 22, scope: !917)
!924 = !DILocation(line: 742, column: 3, scope: !917)
!925 = distinct !{!925, !920, !924, !639}
!926 = !DILocation(line: 744, column: 12, scope: !917)
!927 = !DILocation(line: 744, column: 7, scope: !917)
!928 = !DILocation(line: 744, column: 15, scope: !917)
!929 = !DILocation(line: 745, column: 12, scope: !917)
!930 = !DILocation(line: 745, column: 13, scope: !917)
!931 = !DILocation(line: 745, column: 7, scope: !917)
!932 = !DILocation(line: 745, column: 16, scope: !917)
!933 = !DILocation(line: 746, column: 12, scope: !917)
!934 = !DILocation(line: 746, column: 13, scope: !917)
!935 = !DILocation(line: 746, column: 7, scope: !917)
!936 = !DILocation(line: 746, column: 17, scope: !917)
!937 = !DILocation(line: 747, column: 12, scope: !917)
!938 = !DILocation(line: 747, column: 7, scope: !917)
!939 = !DILocation(line: 747, column: 14, scope: !917)
!940 = distinct !{!940, !911, !941, !639}
!941 = !DILocation(line: 748, column: 5, scope: !912)
!942 = !DILocation(line: 749, column: 3, scope: !912)
!943 = !DILocation(line: 738, column: 31, scope: !908)
!944 = !DILocation(line: 738, column: 3, scope: !908)
!945 = distinct !{!945, !910, !946, !639}
!946 = !DILocation(line: 749, column: 3, scope: !905)
!947 = !DILocation(line: 752, column: 3, scope: !708)
!948 = !DILocation(line: 752, column: 15, scope: !708)
!949 = !DILocation(line: 752, column: 10, scope: !708)
!950 = !DILocation(line: 752, column: 18, scope: !708)
!951 = !DILocation(line: 753, column: 6, scope: !708)
!952 = distinct !{!952, !947, !951, !639}
!953 = !DILocation(line: 754, column: 8, scope: !708)
!954 = !DILocation(line: 754, column: 3, scope: !708)
!955 = !DILocation(line: 754, column: 10, scope: !708)
!956 = !DILocation(line: 757, column: 3, scope: !708)
!957 = !DILocation(line: 763, column: 5, scope: !708)
!958 = !DILocation(line: 764, column: 10, scope: !959)
!959 = distinct !DILexicalBlock(scope: !708, file: !1, line: 764, column: 3)
!960 = !DILocation(line: 764, column: 8, scope: !959)
!961 = !DILocation(line: 764, column: 15, scope: !962)
!962 = distinct !DILexicalBlock(scope: !959, file: !1, line: 764, column: 3)
!963 = !DILocation(line: 764, column: 17, scope: !962)
!964 = !DILocation(line: 764, column: 3, scope: !959)
!965 = !DILocation(line: 765, column: 12, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !1, line: 765, column: 5)
!967 = distinct !DILexicalBlock(scope: !962, file: !1, line: 764, column: 35)
!968 = !DILocation(line: 765, column: 10, scope: !966)
!969 = !DILocation(line: 765, column: 17, scope: !970)
!970 = distinct !DILexicalBlock(scope: !966, file: !1, line: 765, column: 5)
!971 = !DILocation(line: 765, column: 19, scope: !970)
!972 = !DILocation(line: 765, column: 5, scope: !966)
!973 = !DILocation(line: 766, column: 20, scope: !974)
!974 = distinct !DILexicalBlock(scope: !975, file: !1, line: 766, column: 11)
!975 = distinct !DILexicalBlock(scope: !970, file: !1, line: 765, column: 32)
!976 = !DILocation(line: 766, column: 11, scope: !974)
!977 = !DILocation(line: 766, column: 26, scope: !974)
!978 = !DILocation(line: 766, column: 23, scope: !974)
!979 = !DILocation(line: 767, column: 29, scope: !980)
!980 = distinct !DILexicalBlock(scope: !974, file: !1, line: 766, column: 29)
!981 = !DILocation(line: 767, column: 21, scope: !980)
!982 = !DILocation(line: 767, column: 2, scope: !980)
!983 = !DILocation(line: 767, column: 8, scope: !980)
!984 = !DILocation(line: 767, column: 16, scope: !980)
!985 = !DILocation(line: 767, column: 19, scope: !980)
!986 = !DILocation(line: 768, column: 3, scope: !980)
!987 = !DILocation(line: 769, column: 7, scope: !980)
!988 = !DILocation(line: 770, column: 5, scope: !975)
!989 = !DILocation(line: 765, column: 28, scope: !970)
!990 = !DILocation(line: 765, column: 5, scope: !970)
!991 = distinct !{!991, !972, !992, !639}
!992 = !DILocation(line: 770, column: 5, scope: !966)
!993 = !DILocation(line: 771, column: 3, scope: !967)
!994 = !DILocation(line: 764, column: 31, scope: !962)
!995 = !DILocation(line: 764, column: 3, scope: !962)
!996 = distinct !{!996, !964, !997, !639}
!997 = !DILocation(line: 771, column: 3, scope: !959)
!998 = !DILocation(line: 774, column: 3, scope: !708)
!999 = !DILocation(line: 774, column: 9, scope: !708)
!1000 = !DILocation(line: 774, column: 20, scope: !708)
!1001 = !DILocation(line: 775, column: 1, scope: !708)
!1002 = distinct !DISubprogram(name: "jinit_huff_encoder", scope: !1, file: !1, line: 828, type: !321, scopeLine: 829, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !566)
!1003 = !DILocalVariable(name: "cinfo", arg: 1, scope: !1002, file: !1, line: 828, type: !302)
!1004 = !DILocation(line: 828, column: 36, scope: !1002)
!1005 = !DILocalVariable(name: "entropy", scope: !1002, file: !1, line: 830, type: !290)
!1006 = !DILocation(line: 830, column: 20, scope: !1002)
!1007 = !DILocalVariable(name: "i", scope: !1002, file: !1, line: 831, type: !179)
!1008 = !DILocation(line: 831, column: 7, scope: !1002)
!1009 = !DILocation(line: 834, column: 7, scope: !1002)
!1010 = !DILocation(line: 834, column: 14, scope: !1002)
!1011 = !DILocation(line: 834, column: 19, scope: !1002)
!1012 = !DILocation(line: 834, column: 48, scope: !1002)
!1013 = !DILocation(line: 834, column: 5, scope: !1002)
!1014 = !DILocation(line: 833, column: 11, scope: !1002)
!1015 = !DILocation(line: 836, column: 52, scope: !1002)
!1016 = !DILocation(line: 836, column: 3, scope: !1002)
!1017 = !DILocation(line: 836, column: 10, scope: !1002)
!1018 = !DILocation(line: 836, column: 18, scope: !1002)
!1019 = !DILocation(line: 837, column: 3, scope: !1002)
!1020 = !DILocation(line: 837, column: 12, scope: !1002)
!1021 = !DILocation(line: 837, column: 16, scope: !1002)
!1022 = !DILocation(line: 837, column: 27, scope: !1002)
!1023 = !DILocation(line: 840, column: 10, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1002, file: !1, line: 840, column: 3)
!1025 = !DILocation(line: 840, column: 8, scope: !1024)
!1026 = !DILocation(line: 840, column: 15, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1024, file: !1, line: 840, column: 3)
!1028 = !DILocation(line: 840, column: 17, scope: !1027)
!1029 = !DILocation(line: 840, column: 3, scope: !1024)
!1030 = !DILocation(line: 841, column: 35, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1027, file: !1, line: 840, column: 39)
!1032 = !DILocation(line: 841, column: 44, scope: !1031)
!1033 = !DILocation(line: 841, column: 60, scope: !1031)
!1034 = !DILocation(line: 841, column: 63, scope: !1031)
!1035 = !DILocation(line: 841, column: 5, scope: !1031)
!1036 = !DILocation(line: 841, column: 14, scope: !1031)
!1037 = !DILocation(line: 841, column: 30, scope: !1031)
!1038 = !DILocation(line: 841, column: 33, scope: !1031)
!1039 = !DILocation(line: 843, column: 33, scope: !1031)
!1040 = !DILocation(line: 843, column: 42, scope: !1031)
!1041 = !DILocation(line: 843, column: 56, scope: !1031)
!1042 = !DILocation(line: 843, column: 59, scope: !1031)
!1043 = !DILocation(line: 843, column: 5, scope: !1031)
!1044 = !DILocation(line: 843, column: 14, scope: !1031)
!1045 = !DILocation(line: 843, column: 28, scope: !1031)
!1046 = !DILocation(line: 843, column: 31, scope: !1031)
!1047 = !DILocation(line: 845, column: 3, scope: !1031)
!1048 = !DILocation(line: 840, column: 35, scope: !1027)
!1049 = !DILocation(line: 840, column: 3, scope: !1027)
!1050 = distinct !{!1050, !1029, !1051, !639}
!1051 = !DILocation(line: 845, column: 3, scope: !1024)
!1052 = !DILocation(line: 846, column: 1, scope: !1002)
!1053 = distinct !DISubprogram(name: "start_pass_huff", scope: !1, file: !1, line: 106, type: !300, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !566)
!1054 = !DILocalVariable(name: "cinfo", arg: 1, scope: !1053, file: !1, line: 106, type: !302)
!1055 = !DILocation(line: 106, column: 33, scope: !1053)
!1056 = !DILocalVariable(name: "gather_statistics", arg: 2, scope: !1053, file: !1, line: 106, type: !256)
!1057 = !DILocation(line: 106, column: 48, scope: !1053)
!1058 = !DILocalVariable(name: "entropy", scope: !1053, file: !1, line: 108, type: !290)
!1059 = !DILocation(line: 108, column: 20, scope: !1053)
!1060 = !DILocation(line: 108, column: 49, scope: !1053)
!1061 = !DILocation(line: 108, column: 56, scope: !1053)
!1062 = !DILocalVariable(name: "ci", scope: !1053, file: !1, line: 109, type: !179)
!1063 = !DILocation(line: 109, column: 7, scope: !1053)
!1064 = !DILocalVariable(name: "dctbl", scope: !1053, file: !1, line: 109, type: !179)
!1065 = !DILocation(line: 109, column: 11, scope: !1053)
!1066 = !DILocalVariable(name: "actbl", scope: !1053, file: !1, line: 109, type: !179)
!1067 = !DILocation(line: 109, column: 18, scope: !1053)
!1068 = !DILocalVariable(name: "compptr", scope: !1053, file: !1, line: 110, type: !339)
!1069 = !DILocation(line: 110, column: 25, scope: !1053)
!1070 = !DILocation(line: 112, column: 7, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1053, file: !1, line: 112, column: 7)
!1072 = !DILocation(line: 114, column: 5, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1071, file: !1, line: 112, column: 26)
!1074 = !DILocation(line: 114, column: 14, scope: !1073)
!1075 = !DILocation(line: 114, column: 18, scope: !1073)
!1076 = !DILocation(line: 114, column: 29, scope: !1073)
!1077 = !DILocation(line: 115, column: 5, scope: !1073)
!1078 = !DILocation(line: 115, column: 14, scope: !1073)
!1079 = !DILocation(line: 115, column: 18, scope: !1073)
!1080 = !DILocation(line: 115, column: 30, scope: !1073)
!1081 = !DILocation(line: 119, column: 3, scope: !1073)
!1082 = !DILocation(line: 120, column: 5, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1071, file: !1, line: 119, column: 10)
!1084 = !DILocation(line: 120, column: 14, scope: !1083)
!1085 = !DILocation(line: 120, column: 18, scope: !1083)
!1086 = !DILocation(line: 120, column: 29, scope: !1083)
!1087 = !DILocation(line: 121, column: 5, scope: !1083)
!1088 = !DILocation(line: 121, column: 14, scope: !1083)
!1089 = !DILocation(line: 121, column: 18, scope: !1083)
!1090 = !DILocation(line: 121, column: 30, scope: !1083)
!1091 = !DILocation(line: 124, column: 11, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1053, file: !1, line: 124, column: 3)
!1093 = !DILocation(line: 124, column: 8, scope: !1092)
!1094 = !DILocation(line: 124, column: 16, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 124, column: 3)
!1096 = !DILocation(line: 124, column: 21, scope: !1095)
!1097 = !DILocation(line: 124, column: 28, scope: !1095)
!1098 = !DILocation(line: 124, column: 19, scope: !1095)
!1099 = !DILocation(line: 124, column: 3, scope: !1092)
!1100 = !DILocation(line: 125, column: 15, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1095, file: !1, line: 124, column: 49)
!1102 = !DILocation(line: 125, column: 22, scope: !1101)
!1103 = !DILocation(line: 125, column: 36, scope: !1101)
!1104 = !DILocation(line: 125, column: 13, scope: !1101)
!1105 = !DILocation(line: 126, column: 13, scope: !1101)
!1106 = !DILocation(line: 126, column: 22, scope: !1101)
!1107 = !DILocation(line: 126, column: 11, scope: !1101)
!1108 = !DILocation(line: 127, column: 13, scope: !1101)
!1109 = !DILocation(line: 127, column: 22, scope: !1101)
!1110 = !DILocation(line: 127, column: 11, scope: !1101)
!1111 = !DILocation(line: 130, column: 9, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1101, file: !1, line: 130, column: 9)
!1113 = !DILocation(line: 130, column: 15, scope: !1112)
!1114 = !DILocation(line: 130, column: 19, scope: !1112)
!1115 = !DILocation(line: 130, column: 22, scope: !1112)
!1116 = !DILocation(line: 130, column: 28, scope: !1112)
!1117 = !DILocation(line: 130, column: 45, scope: !1112)
!1118 = !DILocation(line: 131, column: 3, scope: !1112)
!1119 = !DILocation(line: 131, column: 10, scope: !1112)
!1120 = !DILocation(line: 131, column: 27, scope: !1112)
!1121 = !DILocation(line: 131, column: 34, scope: !1112)
!1122 = !DILocation(line: 131, column: 42, scope: !1112)
!1123 = !DILocation(line: 131, column: 46, scope: !1112)
!1124 = !DILocation(line: 132, column: 7, scope: !1112)
!1125 = !DILocation(line: 133, column: 9, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1101, file: !1, line: 133, column: 9)
!1127 = !DILocation(line: 133, column: 15, scope: !1126)
!1128 = !DILocation(line: 133, column: 19, scope: !1126)
!1129 = !DILocation(line: 133, column: 22, scope: !1126)
!1130 = !DILocation(line: 133, column: 28, scope: !1126)
!1131 = !DILocation(line: 133, column: 45, scope: !1126)
!1132 = !DILocation(line: 134, column: 3, scope: !1126)
!1133 = !DILocation(line: 134, column: 10, scope: !1126)
!1134 = !DILocation(line: 134, column: 27, scope: !1126)
!1135 = !DILocation(line: 134, column: 34, scope: !1126)
!1136 = !DILocation(line: 134, column: 42, scope: !1126)
!1137 = !DILocation(line: 134, column: 46, scope: !1126)
!1138 = !DILocation(line: 135, column: 7, scope: !1126)
!1139 = !DILocation(line: 136, column: 9, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1101, file: !1, line: 136, column: 9)
!1141 = !DILocation(line: 140, column: 11, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !1, line: 140, column: 11)
!1143 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 136, column: 28)
!1144 = !DILocation(line: 140, column: 20, scope: !1142)
!1145 = !DILocation(line: 140, column: 34, scope: !1142)
!1146 = !DILocation(line: 140, column: 41, scope: !1142)
!1147 = !DILocation(line: 142, column: 6, scope: !1142)
!1148 = !DILocation(line: 142, column: 13, scope: !1142)
!1149 = !DILocation(line: 142, column: 18, scope: !1142)
!1150 = !DILocation(line: 142, column: 47, scope: !1142)
!1151 = !DILocation(line: 142, column: 4, scope: !1142)
!1152 = !DILocation(line: 141, column: 2, scope: !1142)
!1153 = !DILocation(line: 141, column: 11, scope: !1142)
!1154 = !DILocation(line: 141, column: 25, scope: !1142)
!1155 = !DILocation(line: 141, column: 32, scope: !1142)
!1156 = !DILocation(line: 144, column: 7, scope: !1143)
!1157 = !DILocation(line: 145, column: 11, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1143, file: !1, line: 145, column: 11)
!1159 = !DILocation(line: 145, column: 20, scope: !1158)
!1160 = !DILocation(line: 145, column: 34, scope: !1158)
!1161 = !DILocation(line: 145, column: 41, scope: !1158)
!1162 = !DILocation(line: 147, column: 6, scope: !1158)
!1163 = !DILocation(line: 147, column: 13, scope: !1158)
!1164 = !DILocation(line: 147, column: 18, scope: !1158)
!1165 = !DILocation(line: 147, column: 47, scope: !1158)
!1166 = !DILocation(line: 147, column: 4, scope: !1158)
!1167 = !DILocation(line: 146, column: 2, scope: !1158)
!1168 = !DILocation(line: 146, column: 11, scope: !1158)
!1169 = !DILocation(line: 146, column: 25, scope: !1158)
!1170 = !DILocation(line: 146, column: 32, scope: !1158)
!1171 = !DILocation(line: 149, column: 7, scope: !1143)
!1172 = !DILocation(line: 151, column: 5, scope: !1143)
!1173 = !DILocation(line: 154, column: 31, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 151, column: 12)
!1175 = !DILocation(line: 154, column: 38, scope: !1174)
!1176 = !DILocation(line: 154, column: 45, scope: !1174)
!1177 = !DILocation(line: 154, column: 62, scope: !1174)
!1178 = !DILocation(line: 155, column: 12, scope: !1174)
!1179 = !DILocation(line: 155, column: 21, scope: !1174)
!1180 = !DILocation(line: 155, column: 37, scope: !1174)
!1181 = !DILocation(line: 154, column: 7, scope: !1174)
!1182 = !DILocation(line: 156, column: 31, scope: !1174)
!1183 = !DILocation(line: 156, column: 38, scope: !1174)
!1184 = !DILocation(line: 156, column: 45, scope: !1174)
!1185 = !DILocation(line: 156, column: 62, scope: !1174)
!1186 = !DILocation(line: 157, column: 12, scope: !1174)
!1187 = !DILocation(line: 157, column: 21, scope: !1174)
!1188 = !DILocation(line: 157, column: 37, scope: !1174)
!1189 = !DILocation(line: 156, column: 7, scope: !1174)
!1190 = !DILocation(line: 160, column: 5, scope: !1101)
!1191 = !DILocation(line: 160, column: 14, scope: !1101)
!1192 = !DILocation(line: 160, column: 20, scope: !1101)
!1193 = !DILocation(line: 160, column: 32, scope: !1101)
!1194 = !DILocation(line: 160, column: 36, scope: !1101)
!1195 = !DILocation(line: 161, column: 3, scope: !1101)
!1196 = !DILocation(line: 124, column: 45, scope: !1095)
!1197 = !DILocation(line: 124, column: 3, scope: !1095)
!1198 = distinct !{!1198, !1099, !1199, !639}
!1199 = !DILocation(line: 161, column: 3, scope: !1092)
!1200 = !DILocation(line: 164, column: 3, scope: !1053)
!1201 = !DILocation(line: 164, column: 12, scope: !1053)
!1202 = !DILocation(line: 164, column: 18, scope: !1053)
!1203 = !DILocation(line: 164, column: 29, scope: !1053)
!1204 = !DILocation(line: 165, column: 3, scope: !1053)
!1205 = !DILocation(line: 165, column: 12, scope: !1053)
!1206 = !DILocation(line: 165, column: 18, scope: !1053)
!1207 = !DILocation(line: 165, column: 27, scope: !1053)
!1208 = !DILocation(line: 168, column: 29, scope: !1053)
!1209 = !DILocation(line: 168, column: 36, scope: !1053)
!1210 = !DILocation(line: 168, column: 3, scope: !1053)
!1211 = !DILocation(line: 168, column: 12, scope: !1053)
!1212 = !DILocation(line: 168, column: 27, scope: !1053)
!1213 = !DILocation(line: 169, column: 3, scope: !1053)
!1214 = !DILocation(line: 169, column: 12, scope: !1053)
!1215 = !DILocation(line: 169, column: 29, scope: !1053)
!1216 = !DILocation(line: 170, column: 1, scope: !1053)
!1217 = distinct !DISubprogram(name: "encode_mcu_gather", scope: !1, file: !1, line: 605, type: !534, scopeLine: 606, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !566)
!1218 = !DILocalVariable(name: "cinfo", arg: 1, scope: !1217, file: !1, line: 605, type: !302)
!1219 = !DILocation(line: 605, column: 35, scope: !1217)
!1220 = !DILocalVariable(name: "MCU_data", arg: 2, scope: !1217, file: !1, line: 605, type: !240)
!1221 = !DILocation(line: 605, column: 53, scope: !1217)
!1222 = !DILocalVariable(name: "entropy", scope: !1217, file: !1, line: 607, type: !290)
!1223 = !DILocation(line: 607, column: 20, scope: !1217)
!1224 = !DILocation(line: 607, column: 49, scope: !1217)
!1225 = !DILocation(line: 607, column: 56, scope: !1217)
!1226 = !DILocalVariable(name: "blkn", scope: !1217, file: !1, line: 608, type: !179)
!1227 = !DILocation(line: 608, column: 7, scope: !1217)
!1228 = !DILocalVariable(name: "ci", scope: !1217, file: !1, line: 608, type: !179)
!1229 = !DILocation(line: 608, column: 13, scope: !1217)
!1230 = !DILocalVariable(name: "compptr", scope: !1217, file: !1, line: 609, type: !339)
!1231 = !DILocation(line: 609, column: 25, scope: !1217)
!1232 = !DILocation(line: 612, column: 7, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1217, file: !1, line: 612, column: 7)
!1234 = !DILocation(line: 612, column: 14, scope: !1233)
!1235 = !DILocation(line: 613, column: 9, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1237, file: !1, line: 613, column: 9)
!1237 = distinct !DILexicalBlock(scope: !1233, file: !1, line: 612, column: 32)
!1238 = !DILocation(line: 613, column: 18, scope: !1236)
!1239 = !DILocation(line: 613, column: 33, scope: !1236)
!1240 = !DILocation(line: 615, column: 15, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1242, file: !1, line: 615, column: 7)
!1242 = distinct !DILexicalBlock(scope: !1236, file: !1, line: 613, column: 39)
!1243 = !DILocation(line: 615, column: 12, scope: !1241)
!1244 = !DILocation(line: 615, column: 20, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1241, file: !1, line: 615, column: 7)
!1246 = !DILocation(line: 615, column: 25, scope: !1245)
!1247 = !DILocation(line: 615, column: 32, scope: !1245)
!1248 = !DILocation(line: 615, column: 23, scope: !1245)
!1249 = !DILocation(line: 615, column: 7, scope: !1241)
!1250 = !DILocation(line: 616, column: 2, scope: !1245)
!1251 = !DILocation(line: 616, column: 11, scope: !1245)
!1252 = !DILocation(line: 616, column: 17, scope: !1245)
!1253 = !DILocation(line: 616, column: 29, scope: !1245)
!1254 = !DILocation(line: 616, column: 33, scope: !1245)
!1255 = !DILocation(line: 615, column: 49, scope: !1245)
!1256 = !DILocation(line: 615, column: 7, scope: !1245)
!1257 = distinct !{!1257, !1249, !1258, !639}
!1258 = !DILocation(line: 616, column: 35, scope: !1241)
!1259 = !DILocation(line: 618, column: 33, scope: !1242)
!1260 = !DILocation(line: 618, column: 40, scope: !1242)
!1261 = !DILocation(line: 618, column: 7, scope: !1242)
!1262 = !DILocation(line: 618, column: 16, scope: !1242)
!1263 = !DILocation(line: 618, column: 31, scope: !1242)
!1264 = !DILocation(line: 619, column: 5, scope: !1242)
!1265 = !DILocation(line: 620, column: 5, scope: !1237)
!1266 = !DILocation(line: 620, column: 14, scope: !1237)
!1267 = !DILocation(line: 620, column: 28, scope: !1237)
!1268 = !DILocation(line: 621, column: 3, scope: !1237)
!1269 = !DILocation(line: 623, column: 13, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1217, file: !1, line: 623, column: 3)
!1271 = !DILocation(line: 623, column: 8, scope: !1270)
!1272 = !DILocation(line: 623, column: 18, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1270, file: !1, line: 623, column: 3)
!1274 = !DILocation(line: 623, column: 25, scope: !1273)
!1275 = !DILocation(line: 623, column: 32, scope: !1273)
!1276 = !DILocation(line: 623, column: 23, scope: !1273)
!1277 = !DILocation(line: 623, column: 3, scope: !1270)
!1278 = !DILocation(line: 624, column: 10, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1273, file: !1, line: 623, column: 55)
!1280 = !DILocation(line: 624, column: 17, scope: !1279)
!1281 = !DILocation(line: 624, column: 32, scope: !1279)
!1282 = !DILocation(line: 624, column: 8, scope: !1279)
!1283 = !DILocation(line: 625, column: 15, scope: !1279)
!1284 = !DILocation(line: 625, column: 22, scope: !1279)
!1285 = !DILocation(line: 625, column: 36, scope: !1279)
!1286 = !DILocation(line: 625, column: 13, scope: !1279)
!1287 = !DILocation(line: 626, column: 21, scope: !1279)
!1288 = !DILocation(line: 626, column: 30, scope: !1279)
!1289 = !DILocation(line: 626, column: 40, scope: !1279)
!1290 = !DILocation(line: 626, column: 49, scope: !1279)
!1291 = !DILocation(line: 626, column: 55, scope: !1279)
!1292 = !DILocation(line: 626, column: 67, scope: !1279)
!1293 = !DILocation(line: 627, column: 7, scope: !1279)
!1294 = !DILocation(line: 627, column: 16, scope: !1279)
!1295 = !DILocation(line: 627, column: 30, scope: !1279)
!1296 = !DILocation(line: 627, column: 39, scope: !1279)
!1297 = !DILocation(line: 628, column: 7, scope: !1279)
!1298 = !DILocation(line: 628, column: 16, scope: !1279)
!1299 = !DILocation(line: 628, column: 30, scope: !1279)
!1300 = !DILocation(line: 628, column: 39, scope: !1279)
!1301 = !DILocation(line: 626, column: 5, scope: !1279)
!1302 = !DILocation(line: 629, column: 38, scope: !1279)
!1303 = !DILocation(line: 629, column: 47, scope: !1279)
!1304 = !DILocation(line: 629, column: 5, scope: !1279)
!1305 = !DILocation(line: 629, column: 14, scope: !1279)
!1306 = !DILocation(line: 629, column: 20, scope: !1279)
!1307 = !DILocation(line: 629, column: 32, scope: !1279)
!1308 = !DILocation(line: 629, column: 36, scope: !1279)
!1309 = !DILocation(line: 630, column: 3, scope: !1279)
!1310 = !DILocation(line: 623, column: 51, scope: !1273)
!1311 = !DILocation(line: 623, column: 3, scope: !1273)
!1312 = distinct !{!1312, !1277, !1313, !639}
!1313 = !DILocation(line: 630, column: 3, scope: !1270)
!1314 = !DILocation(line: 632, column: 3, scope: !1217)
!1315 = distinct !DISubprogram(name: "finish_pass_gather", scope: !1, file: !1, line: 783, type: !321, scopeLine: 784, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !566)
!1316 = !DILocalVariable(name: "cinfo", arg: 1, scope: !1315, file: !1, line: 783, type: !302)
!1317 = !DILocation(line: 783, column: 36, scope: !1315)
!1318 = !DILocalVariable(name: "entropy", scope: !1315, file: !1, line: 785, type: !290)
!1319 = !DILocation(line: 785, column: 20, scope: !1315)
!1320 = !DILocation(line: 785, column: 49, scope: !1315)
!1321 = !DILocation(line: 785, column: 56, scope: !1315)
!1322 = !DILocalVariable(name: "ci", scope: !1315, file: !1, line: 786, type: !179)
!1323 = !DILocation(line: 786, column: 7, scope: !1315)
!1324 = !DILocalVariable(name: "dctbl", scope: !1315, file: !1, line: 786, type: !179)
!1325 = !DILocation(line: 786, column: 11, scope: !1315)
!1326 = !DILocalVariable(name: "actbl", scope: !1315, file: !1, line: 786, type: !179)
!1327 = !DILocation(line: 786, column: 18, scope: !1315)
!1328 = !DILocalVariable(name: "compptr", scope: !1315, file: !1, line: 787, type: !339)
!1329 = !DILocation(line: 787, column: 25, scope: !1315)
!1330 = !DILocalVariable(name: "htblptr", scope: !1315, file: !1, line: 788, type: !1331)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!1332 = !DILocation(line: 788, column: 15, scope: !1315)
!1333 = !DILocalVariable(name: "did_dc", scope: !1315, file: !1, line: 789, type: !1334)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 128, elements: !375)
!1335 = !DILocation(line: 789, column: 11, scope: !1315)
!1336 = !DILocalVariable(name: "did_ac", scope: !1315, file: !1, line: 790, type: !1334)
!1337 = !DILocation(line: 790, column: 11, scope: !1315)
!1338 = !DILocation(line: 795, column: 3, scope: !1315)
!1339 = !DILocation(line: 796, column: 3, scope: !1315)
!1340 = !DILocation(line: 798, column: 11, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1315, file: !1, line: 798, column: 3)
!1342 = !DILocation(line: 798, column: 8, scope: !1341)
!1343 = !DILocation(line: 798, column: 16, scope: !1344)
!1344 = distinct !DILexicalBlock(scope: !1341, file: !1, line: 798, column: 3)
!1345 = !DILocation(line: 798, column: 21, scope: !1344)
!1346 = !DILocation(line: 798, column: 28, scope: !1344)
!1347 = !DILocation(line: 798, column: 19, scope: !1344)
!1348 = !DILocation(line: 798, column: 3, scope: !1341)
!1349 = !DILocation(line: 799, column: 15, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !1344, file: !1, line: 798, column: 49)
!1351 = !DILocation(line: 799, column: 22, scope: !1350)
!1352 = !DILocation(line: 799, column: 36, scope: !1350)
!1353 = !DILocation(line: 799, column: 13, scope: !1350)
!1354 = !DILocation(line: 800, column: 13, scope: !1350)
!1355 = !DILocation(line: 800, column: 22, scope: !1350)
!1356 = !DILocation(line: 800, column: 11, scope: !1350)
!1357 = !DILocation(line: 801, column: 13, scope: !1350)
!1358 = !DILocation(line: 801, column: 22, scope: !1350)
!1359 = !DILocation(line: 801, column: 11, scope: !1350)
!1360 = !DILocation(line: 802, column: 18, scope: !1361)
!1361 = distinct !DILexicalBlock(scope: !1350, file: !1, line: 802, column: 9)
!1362 = !DILocation(line: 802, column: 11, scope: !1361)
!1363 = !DILocation(line: 802, column: 9, scope: !1361)
!1364 = !DILocation(line: 803, column: 19, scope: !1365)
!1365 = distinct !DILexicalBlock(scope: !1361, file: !1, line: 802, column: 26)
!1366 = !DILocation(line: 803, column: 26, scope: !1365)
!1367 = !DILocation(line: 803, column: 43, scope: !1365)
!1368 = !DILocation(line: 803, column: 15, scope: !1365)
!1369 = !DILocation(line: 804, column: 12, scope: !1370)
!1370 = distinct !DILexicalBlock(scope: !1365, file: !1, line: 804, column: 11)
!1371 = !DILocation(line: 804, column: 11, scope: !1370)
!1372 = !DILocation(line: 804, column: 20, scope: !1370)
!1373 = !DILocation(line: 805, column: 50, scope: !1370)
!1374 = !DILocation(line: 805, column: 13, scope: !1370)
!1375 = !DILocation(line: 805, column: 3, scope: !1370)
!1376 = !DILocation(line: 805, column: 11, scope: !1370)
!1377 = !DILocation(line: 805, column: 2, scope: !1370)
!1378 = !DILocation(line: 806, column: 30, scope: !1365)
!1379 = !DILocation(line: 806, column: 38, scope: !1365)
!1380 = !DILocation(line: 806, column: 37, scope: !1365)
!1381 = !DILocation(line: 806, column: 47, scope: !1365)
!1382 = !DILocation(line: 806, column: 56, scope: !1365)
!1383 = !DILocation(line: 806, column: 70, scope: !1365)
!1384 = !DILocation(line: 806, column: 7, scope: !1365)
!1385 = !DILocation(line: 807, column: 14, scope: !1365)
!1386 = !DILocation(line: 807, column: 7, scope: !1365)
!1387 = !DILocation(line: 807, column: 21, scope: !1365)
!1388 = !DILocation(line: 808, column: 5, scope: !1365)
!1389 = !DILocation(line: 809, column: 18, scope: !1390)
!1390 = distinct !DILexicalBlock(scope: !1350, file: !1, line: 809, column: 9)
!1391 = !DILocation(line: 809, column: 11, scope: !1390)
!1392 = !DILocation(line: 809, column: 9, scope: !1390)
!1393 = !DILocation(line: 810, column: 19, scope: !1394)
!1394 = distinct !DILexicalBlock(scope: !1390, file: !1, line: 809, column: 26)
!1395 = !DILocation(line: 810, column: 26, scope: !1394)
!1396 = !DILocation(line: 810, column: 43, scope: !1394)
!1397 = !DILocation(line: 810, column: 15, scope: !1394)
!1398 = !DILocation(line: 811, column: 12, scope: !1399)
!1399 = distinct !DILexicalBlock(scope: !1394, file: !1, line: 811, column: 11)
!1400 = !DILocation(line: 811, column: 11, scope: !1399)
!1401 = !DILocation(line: 811, column: 20, scope: !1399)
!1402 = !DILocation(line: 812, column: 50, scope: !1399)
!1403 = !DILocation(line: 812, column: 13, scope: !1399)
!1404 = !DILocation(line: 812, column: 3, scope: !1399)
!1405 = !DILocation(line: 812, column: 11, scope: !1399)
!1406 = !DILocation(line: 812, column: 2, scope: !1399)
!1407 = !DILocation(line: 813, column: 30, scope: !1394)
!1408 = !DILocation(line: 813, column: 38, scope: !1394)
!1409 = !DILocation(line: 813, column: 37, scope: !1394)
!1410 = !DILocation(line: 813, column: 47, scope: !1394)
!1411 = !DILocation(line: 813, column: 56, scope: !1394)
!1412 = !DILocation(line: 813, column: 70, scope: !1394)
!1413 = !DILocation(line: 813, column: 7, scope: !1394)
!1414 = !DILocation(line: 814, column: 14, scope: !1394)
!1415 = !DILocation(line: 814, column: 7, scope: !1394)
!1416 = !DILocation(line: 814, column: 21, scope: !1394)
!1417 = !DILocation(line: 815, column: 5, scope: !1394)
!1418 = !DILocation(line: 816, column: 3, scope: !1350)
!1419 = !DILocation(line: 798, column: 45, scope: !1344)
!1420 = !DILocation(line: 798, column: 3, scope: !1344)
!1421 = distinct !{!1421, !1348, !1422, !639}
!1422 = !DILocation(line: 816, column: 3, scope: !1341)
!1423 = !DILocation(line: 817, column: 1, scope: !1315)
!1424 = distinct !DISubprogram(name: "encode_mcu_huff", scope: !1, file: !1, line: 437, type: !534, scopeLine: 438, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !566)
!1425 = !DILocalVariable(name: "cinfo", arg: 1, scope: !1424, file: !1, line: 437, type: !302)
!1426 = !DILocation(line: 437, column: 33, scope: !1424)
!1427 = !DILocalVariable(name: "MCU_data", arg: 2, scope: !1424, file: !1, line: 437, type: !240)
!1428 = !DILocation(line: 437, column: 51, scope: !1424)
