; ModuleID = 'cBench/consumer_jpeg_c/src/jcinit.c'
source_filename = "cBench/consumer_jpeg_c/src/jcinit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_compress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, double, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], [16 x i8], [16 x i8], [16 x i8], i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.jpeg_marker_writer = type { ptr, ptr, ptr, ptr, ptr, ptr }

; Function Attrs: noinline nounwind uwtable
define dso_local void @jinit_compress_master(ptr noundef %0) #0 !dbg !284 {
  %2 = alloca ptr, align 8
  store ptr %0, ptr %2, align 8
    #dbg_declare(ptr %2, !530, !DIExpression(), !531)
  %3 = load ptr, ptr %2, align 8, !dbg !532
  call void @jinit_c_master_control(ptr noundef %3, i32 noundef 0), !dbg !533
  %4 = load ptr, ptr %2, align 8, !dbg !534
  %5 = getelementptr inbounds nuw %struct.jpeg_compress_struct, ptr %4, i32 0, i32 23, !dbg !536
  %6 = load i32, ptr %5, align 8, !dbg !536

!63 = !DIEnumerator(name: "JERR_FILE_READ", value: 35)
!64 = !DIEnumerator(name: "JERR_FILE_WRITE", value: 36)
!65 = !DIEnumerator(name: "JERR_FRACT_SAMPLE_NOTIMPL", value: 37)
!66 = !DIEnumerator(name: "JERR_HUFF_CLEN_OVERFLOW", value: 38)
!67 = !DIEnumerator(name: "JERR_HUFF_MISSING_CODE", value: 39)
!68 = !DIEnumerator(name: "JERR_IMAGE_TOO_BIG", value: 40)
!69 = !DIEnumerator(name: "JERR_INPUT_EMPTY", value: 41)
!70 = !DIEnumerator(name: "JERR_INPUT_EOF", value: 42)
!71 = !DIEnumerator(name: "JERR_MISMATCHED_QUANT_TABLE", value: 43)
!72 = !DIEnumerator(name: "JERR_MISSING_DATA", value: 44)
!73 = !DIEnumerator(name: "JERR_MODE_CHANGE", value: 45)
!74 = !DIEnumerator(name: "JERR_NOTIMPL", value: 46)
!75 = !DIEnumerator(name: "JERR_NOT_COMPILED", value: 47)
!76 = !DIEnumerator(name: "JERR_NO_BACKING_STORE", value: 48)
!77 = !DIEnumerator(name: "JERR_NO_HUFF_TABLE", value: 49)
!78 = !DIEnumerator(name: "JERR_NO_IMAGE", value: 50)
!79 = !DIEnumerator(name: "JERR_NO_QUANT_TABLE", value: 51)
!80 = !DIEnumerator(name: "JERR_NO_SOI", value: 52)
!81 = !DIEnumerator(name: "JERR_OUT_OF_MEMORY", value: 53)
!82 = !DIEnumerator(name: "JERR_QUANT_COMPONENTS", value: 54)
!83 = !DIEnumerator(name: "JERR_QUANT_FEW_COLORS", value: 55)
!84 = !DIEnumerator(name: "JERR_QUANT_MANY_COLORS", value: 56)
!85 = !DIEnumerator(name: "JERR_SOF_DUPLICATE", value: 57)
!86 = !DIEnumerator(name: "JERR_SOF_NO_SOS", value: 58)
!87 = !DIEnumerator(name: "JERR_SOF_UNSUPPORTED", value: 59)
!88 = !DIEnumerator(name: "JERR_SOI_DUPLICATE", value: 60)
!89 = !DIEnumerator(name: "JERR_SOS_NO_SOF", value: 61)
!90 = !DIEnumerator(name: "JERR_TFILE_CREATE", value: 62)
!91 = !DIEnumerator(name: "JERR_TFILE_READ", value: 63)
!92 = !DIEnumerator(name: "JERR_TFILE_SEEK", value: 64)
!93 = !DIEnumerator(name: "JERR_TFILE_WRITE", value: 65)
!94 = !DIEnumerator(name: "JERR_TOO_LITTLE_DATA", value: 66)
!95 = !DIEnumerator(name: "JERR_UNKNOWN_MARKER", value: 67)
!96 = !DIEnumerator(name: "JERR_VIRTUAL_BUG", value: 68)
!97 = !DIEnumerator(name: "JERR_WIDTH_OVERFLOW", value: 69)
!98 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!99 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!100 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!101 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!102 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!103 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!104 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!105 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!106 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!107 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!108 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!109 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!110 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!111 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!112 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!113 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!114 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!115 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!116 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!117 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!118 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!119 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!120 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!121 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!122 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!123 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!124 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!125 = !DIEnumerator(name: "JTRC_RST", value: 97)
!126 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!127 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!128 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!129 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!130 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!131 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!132 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!133 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!134 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!135 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!136 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!137 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!138 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!139 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!140 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!141 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!142 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!143 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!144 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!145 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!146 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!147 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!148 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !153)
!153 = !{!154, !199, !265, !274, !275}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !152, file: !4, line: 241, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !157)
!157 = !{!158, !162, !167, !168, !174, !175, !176, !187, !188, !190, !195, !196, !197, !198}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !156, file: !4, line: 620, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !150}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !156, file: !4, line: 622, baseType: !163, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !150, !166}
!166 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !156, file: !4, line: 624, baseType: !159, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !156, file: !4, line: 626, baseType: !169, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !150, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !156, file: !4, line: 629, baseType: !159, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !156, file: !4, line: 634, baseType: !166, size: 32, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !156, file: !4, line: 639, baseType: !177, size: 640, offset: 352)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !156, file: !4, line: 636, size: 640, elements: !178)
!178 = !{!179, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !177, file: !4, line: 637, baseType: !180, size: 256)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 256, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 8)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !177, file: !4, line: 638, baseType: !184, size: 640)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 640, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 80)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !156, file: !4, line: 643, baseType: !166, size: 32, offset: 992)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !156, file: !4, line: 651, baseType: !189, size: 64, offset: 1024)
!189 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !156, file: !4, line: 663, baseType: !191, size: 64, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !156, file: !4, line: 664, baseType: !166, size: 32, offset: 1152)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !156, file: !4, line: 668, baseType: !191, size: 64, offset: 1216)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !156, file: !4, line: 669, baseType: !166, size: 32, offset: 1280)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !156, file: !4, line: 670, baseType: !166, size: 32, offset: 1312)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !152, file: !4, line: 241, baseType: !200, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !202)
!202 = !{!203, !211, !212, !224, !238, !246, !253, !254, !258, !262, !263, !264}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !201, file: !4, line: 733, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!207, !150, !166, !208}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !209, line: 18, baseType: !210)
!209 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!210 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !201, file: !4, line: 735, baseType: !204, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !201, file: !4, line: 737, baseType: !213, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !150, !166, !223, !223}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !221, line: 59, baseType: !222)
!221 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!222 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !221, line: 171, baseType: !5)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !201, file: !4, line: 740, baseType: !225, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !150, !166, !223, !223}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !233)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 1024, elements: !236)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !221, line: 99, baseType: !235)
!235 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!236 = !{!237}
!237 = !DISubrange(count: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !201, file: !4, line: 743, baseType: !239, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!242, !150, !166, !245, !223, !223, !223}
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !221, line: 227, baseType: !166)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !201, file: !4, line: 749, baseType: !247, size: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !150, !166, !245, !223, !223, !223}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !201, file: !4, line: 755, baseType: !159, size: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !201, file: !4, line: 756, baseType: !255, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!216, !150, !242, !223, !223, !245}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !201, file: !4, line: 761, baseType: !259, size: 64, offset: 512)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!228, !150, !250, !223, !223, !245}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !201, file: !4, line: 766, baseType: !163, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !201, file: !4, line: 767, baseType: !159, size: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !201, file: !4, line: 774, baseType: !189, size: 64, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !152, file: !4, line: 241, baseType: !266, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !268)
!268 = !{!269, !270, !271, !272, !273}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !267, file: !4, line: 677, baseType: !159, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !267, file: !4, line: 679, baseType: !189, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !267, file: !4, line: 680, baseType: !189, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !267, file: !4, line: 681, baseType: !166, size: 32, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !267, file: !4, line: 682, baseType: !166, size: 32, offset: 224)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !152, file: !4, line: 241, baseType: !245, size: 32, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !152, file: !4, line: 241, baseType: !166, size: 32, offset: 224)
!276 = !{i32 7, !"Dwarf Version", i32 5}
!277 = !{i32 2, !"Debug Info Version", i32 3}
!278 = !{i32 1, !"wchar_size", i32 4}
!279 = !{i32 8, !"PIC Level", i32 2}
!280 = !{i32 7, !"PIE Level", i32 2}
!281 = !{i32 7, !"uwtable", i32 2}
!282 = !{i32 7, !"frame-pointer", i32 2}
!283 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!284 = distinct !DISubprogram(name: "jinit_compress_master", scope: !1, file: !1, line: 30, type: !285, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !529)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !287}
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_compress_ptr", file: !4, line: 249, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !4, line: 255, size: 3968, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !311, !312, !313, !314, !316, !318, !319, !320, !321, !356, !360, !376, !377, !381, !382, !383, !384, !397, !398, !399, !400, !401, !402, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !419, !420, !421, !422, !426, !427, !428, !429, !430, !439, !453, !464, !473, !488, !497, !507, !516}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !289, file: !4, line: 256, baseType: !155, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !289, file: !4, line: 256, baseType: !200, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !289, file: !4, line: 256, baseType: !266, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !289, file: !4, line: 256, baseType: !245, size: 32, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !289, file: !4, line: 256, baseType: !166, size: 32, offset: 224)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !289, file: !4, line: 259, baseType: !297, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !4, line: 688, size: 320, elements: !299)
!299 = !{!300, !303, !304, !306, !310}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !298, file: !4, line: 689, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !221, line: 110, baseType: !222)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !298, file: !4, line: 690, baseType: !208, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !298, file: !4, line: 692, baseType: !305, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !298, file: !4, line: 693, baseType: !307, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!245, !287}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !298, file: !4, line: 694, baseType: !305, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !289, file: !4, line: 266, baseType: !223, size: 32, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !289, file: !4, line: 267, baseType: !223, size: 32, offset: 352)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "input_components", scope: !289, file: !4, line: 268, baseType: !166, size: 32, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "in_color_space", scope: !289, file: !4, line: 269, baseType: !315, size: 32, offset: 416)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "input_gamma", scope: !289, file: !4, line: 271, baseType: !317, size: 64, offset: 448)
!317 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !289, file: !4, line: 281, baseType: !166, size: 32, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !289, file: !4, line: 283, baseType: !166, size: 32, offset: 544)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !289, file: !4, line: 284, baseType: !315, size: 32, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !289, file: !4, line: 286, baseType: !322, size: 64, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !355}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !324, file: !4, line: 120, baseType: !166, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !324, file: !4, line: 121, baseType: !166, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !324, file: !4, line: 122, baseType: !166, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !324, file: !4, line: 123, baseType: !166, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !324, file: !4, line: 124, baseType: !166, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !324, file: !4, line: 129, baseType: !166, size: 32, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !324, file: !4, line: 130, baseType: !166, size: 32, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !324, file: !4, line: 139, baseType: !223, size: 32, offset: 224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !324, file: !4, line: 140, baseType: !223, size: 32, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !324, file: !4, line: 147, baseType: !166, size: 32, offset: 288)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !324, file: !4, line: 154, baseType: !223, size: 32, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !324, file: !4, line: 155, baseType: !223, size: 32, offset: 352)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !324, file: !4, line: 160, baseType: !245, size: 32, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !324, file: !4, line: 164, baseType: !166, size: 32, offset: 416)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !324, file: !4, line: 165, baseType: !166, size: 32, offset: 448)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !324, file: !4, line: 166, baseType: !166, size: 32, offset: 480)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !324, file: !4, line: 167, baseType: !166, size: 32, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !324, file: !4, line: 168, baseType: !166, size: 32, offset: 544)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !324, file: !4, line: 169, baseType: !166, size: 32, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !324, file: !4, line: 175, baseType: !346, size: 64, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !349)
!349 = !{!350, !354}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !348, file: !4, line: 88, baseType: !351, size: 1024)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 1024, elements: !236)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !221, line: 147, baseType: !353)
!353 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !348, file: !4, line: 94, baseType: !245, size: 32, offset: 1024)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !324, file: !4, line: 178, baseType: !207, size: 64, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !289, file: !4, line: 289, baseType: !357, size: 256, offset: 704)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 256, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 4)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !289, file: !4, line: 292, baseType: !361, size: 256, offset: 960)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 256, elements: !358)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !365)
!365 = !{!366, !371, !375}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !364, file: !4, line: 102, baseType: !367, size: 136)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 136, elements: !369)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !221, line: 135, baseType: !222)
!369 = !{!370}
!370 = !DISubrange(count: 17)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !364, file: !4, line: 104, baseType: !372, size: 2048, offset: 136)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 2048, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !364, file: !4, line: 110, baseType: !245, size: 32, offset: 2208)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !289, file: !4, line: 293, baseType: !361, size: 256, offset: 1216)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !289, file: !4, line: 296, baseType: !378, size: 128, offset: 1472)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 128, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 16)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !289, file: !4, line: 297, baseType: !378, size: 128, offset: 1600)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !289, file: !4, line: 298, baseType: !378, size: 128, offset: 1728)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "num_scans", scope: !289, file: !4, line: 300, baseType: !166, size: 32, offset: 1856)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "scan_info", scope: !289, file: !4, line: 301, baseType: !385, size: 64, offset: 1920)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_scan_info", file: !4, line: 189, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 184, size: 288, elements: !389)
!389 = !{!390, !391, !393, !394, !395, !396}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !388, file: !4, line: 185, baseType: !166, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !388, file: !4, line: 186, baseType: !392, size: 128, offset: 32)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 128, elements: !358)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !388, file: !4, line: 187, baseType: !166, size: 32, offset: 160)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !388, file: !4, line: 187, baseType: !166, size: 32, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !388, file: !4, line: 188, baseType: !166, size: 32, offset: 224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !388, file: !4, line: 188, baseType: !166, size: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_in", scope: !289, file: !4, line: 307, baseType: !245, size: 32, offset: 1984)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !289, file: !4, line: 308, baseType: !245, size: 32, offset: 2016)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_coding", scope: !289, file: !4, line: 309, baseType: !245, size: 32, offset: 2048)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !289, file: !4, line: 310, baseType: !245, size: 32, offset: 2080)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "smoothing_factor", scope: !289, file: !4, line: 311, baseType: !166, size: 32, offset: 2112)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !289, file: !4, line: 312, baseType: !403, size: 32, offset: 2144)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !289, file: !4, line: 319, baseType: !5, size: 32, offset: 2176)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "restart_in_rows", scope: !289, file: !4, line: 320, baseType: !166, size: 32, offset: 2208)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "write_JFIF_header", scope: !289, file: !4, line: 324, baseType: !245, size: 32, offset: 2240)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !289, file: !4, line: 329, baseType: !368, size: 8, offset: 2272)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !289, file: !4, line: 330, baseType: !352, size: 16, offset: 2288)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !289, file: !4, line: 331, baseType: !352, size: 16, offset: 2304)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "write_Adobe_marker", scope: !289, file: !4, line: 332, baseType: !245, size: 32, offset: 2336)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "next_scanline", scope: !289, file: !4, line: 339, baseType: !223, size: 32, offset: 2368)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !289, file: !4, line: 348, baseType: !245, size: 32, offset: 2400)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !289, file: !4, line: 349, baseType: !166, size: 32, offset: 2432)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !289, file: !4, line: 350, baseType: !166, size: 32, offset: 2464)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !289, file: !4, line: 352, baseType: !223, size: 32, offset: 2496)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !289, file: !4, line: 363, baseType: !166, size: 32, offset: 2528)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !289, file: !4, line: 364, baseType: !418, size: 256, offset: 2560)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 256, elements: !358)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !289, file: !4, line: 367, baseType: !223, size: 32, offset: 2816)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !289, file: !4, line: 368, baseType: !223, size: 32, offset: 2848)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !289, file: !4, line: 370, baseType: !166, size: 32, offset: 2880)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !289, file: !4, line: 371, baseType: !423, size: 320, offset: 2912)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 320, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 10)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !289, file: !4, line: 375, baseType: !166, size: 32, offset: 3232)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !289, file: !4, line: 375, baseType: !166, size: 32, offset: 3264)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !289, file: !4, line: 375, baseType: !166, size: 32, offset: 3296)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !289, file: !4, line: 375, baseType: !166, size: 32, offset: 3328)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !289, file: !4, line: 380, baseType: !431, size: 64, offset: 3392)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_comp_master", file: !19, line: 45, size: 256, elements: !433)
!433 = !{!434, !435, !436, !437, !438}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_pass", scope: !432, file: !19, line: 46, baseType: !305, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pass_startup", scope: !432, file: !19, line: 47, baseType: !305, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !432, file: !19, line: 48, baseType: !305, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "call_pass_startup", scope: !432, file: !19, line: 51, baseType: !245, size: 32, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "is_last_pass", scope: !432, file: !19, line: 52, baseType: !245, size: 32, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !289, file: !4, line: 381, baseType: !440, size: 64, offset: 3456)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_main_controller", file: !19, line: 56, size: 128, elements: !442)
!442 = !{!443, !448}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !441, file: !19, line: 57, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !287, !447}
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !19, line: 22, baseType: !18)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !441, file: !19, line: 58, baseType: !449, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !287, !216, !452, !223}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "prep", scope: !289, file: !4, line: 382, baseType: !454, size: 64, offset: 3520)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_prep_controller", file: !19, line: 64, size: 128, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !455, file: !19, line: 65, baseType: !444, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pre_process_data", scope: !455, file: !19, line: 66, baseType: !459, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !287, !216, !452, !223, !462, !452, !223}
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !4, line: 68, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !289, file: !4, line: 383, baseType: !465, size: 64, offset: 3584)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_coef_controller", file: !19, line: 76, size: 128, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !466, file: !19, line: 77, baseType: !444, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "compress_data", scope: !466, file: !19, line: 78, baseType: !470, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!245, !287, !462}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !289, file: !4, line: 384, baseType: !474, size: 64, offset: 3648)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_writer", file: !19, line: 120, size: 384, elements: !476)
!476 = !{!477, !483, !484, !485, !486, !487}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "write_any_marker", scope: !475, file: !19, line: 123, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !287, !166, !481, !5}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_header", scope: !475, file: !19, line: 125, baseType: !305, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame_header", scope: !475, file: !19, line: 126, baseType: !305, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "write_scan_header", scope: !475, file: !19, line: 127, baseType: !305, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_trailer", scope: !475, file: !19, line: 128, baseType: !305, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "write_tables_only", scope: !475, file: !19, line: 129, baseType: !305, size: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !289, file: !4, line: 385, baseType: !489, size: 64, offset: 3712)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_converter", file: !19, line: 83, size: 128, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !490, file: !19, line: 84, baseType: !305, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !490, file: !19, line: 85, baseType: !494, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !287, !216, !462, !223, !166}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !289, file: !4, line: 386, baseType: !498, size: 64, offset: 3776)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_downsampler", file: !19, line: 91, size: 192, elements: !500)
!500 = !{!501, !502, !506}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !499, file: !19, line: 92, baseType: !305, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !499, file: !19, line: 93, baseType: !503, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !287, !462, !223, !462, !223}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !499, file: !19, line: 98, baseType: !245, size: 32, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !289, file: !4, line: 387, baseType: !508, size: 64, offset: 3840)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_forward_dct", file: !19, line: 102, size: 128, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !509, file: !19, line: 103, baseType: !305, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "forward_DCT", scope: !509, file: !19, line: 105, baseType: !513, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !287, !322, !216, !230, !223, !223, !223}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !289, file: !4, line: 388, baseType: !517, size: 64, offset: 3904)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_encoder", file: !19, line: 113, size: 192, elements: !519)
!519 = !{!520, !524, !528}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !518, file: !19, line: 114, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !287, !245}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "encode_mcu", scope: !518, file: !19, line: 115, baseType: !525, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!245, !287, !229}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !518, file: !19, line: 116, baseType: !305, size: 64, offset: 128)
!529 = !{}
!530 = !DILocalVariable(name: "cinfo", arg: 1, scope: !284, file: !1, line: 30, type: !287)
!531 = !DILocation(line: 30, column: 39, scope: !284)
!532 = !DILocation(line: 33, column: 26, scope: !284)
!533 = !DILocation(line: 33, column: 3, scope: !284)
!534 = !DILocation(line: 36, column: 9, scope: !535)
!535 = distinct !DILexicalBlock(scope: !284, file: !1, line: 36, column: 7)
!536 = !DILocation(line: 36, column: 16, scope: !535)
!537 = !DILocation(line: 36, column: 7, scope: !535)
!538 = !DILocation(line: 37, column: 27, scope: !539)
!539 = distinct !DILexicalBlock(scope: !535, file: !1, line: 36, column: 29)
!540 = !DILocation(line: 37, column: 5, scope: !539)
!541 = !DILocation(line: 38, column: 23, scope: !539)
!542 = !DILocation(line: 38, column: 5, scope: !539)
!543 = !DILocation(line: 39, column: 29, scope: !539)
!544 = !DILocation(line: 39, column: 5, scope: !539)
!545 = !DILocation(line: 40, column: 3, scope: !539)
!546 = !DILocation(line: 42, column: 21, scope: !284)
!547 = !DILocation(line: 42, column: 3, scope: !284)
!548 = !DILocation(line: 44, column: 7, scope: !549)
!549 = distinct !DILexicalBlock(scope: !284, file: !1, line: 44, column: 7)
!550 = !DILocation(line: 44, column: 14, scope: !549)
!551 = !DILocation(line: 45, column: 5, scope: !552)
!552 = distinct !DILexicalBlock(scope: !549, file: !1, line: 44, column: 26)
!553 = !DILocation(line: 46, column: 3, scope: !552)
!554 = !DILocation(line: 47, column: 9, scope: !555)
!555 = distinct !DILexicalBlock(scope: !556, file: !1, line: 47, column: 9)
!556 = distinct !DILexicalBlock(scope: !549, file: !1, line: 46, column: 10)
!557 = !DILocation(line: 47, column: 16, scope: !555)
!558 = !DILocation(line: 49, column: 27, scope: !559)
!559 = distinct !DILexicalBlock(scope: !555, file: !1, line: 47, column: 34)
!560 = !DILocation(line: 49, column: 7, scope: !559)
!561 = !DILocation(line: 53, column: 5, scope: !559)
!562 = !DILocation(line: 54, column: 26, scope: !555)
!563 = !DILocation(line: 54, column: 7, scope: !555)
!564 = !DILocation(line: 58, column: 27, scope: !284)
!565 = !DILocation(line: 59, column: 7, scope: !284)
!566 = !DILocation(line: 59, column: 14, scope: !284)
!567 = !DILocation(line: 59, column: 24, scope: !284)
!568 = !DILocation(line: 59, column: 28, scope: !284)
!569 = !DILocation(line: 59, column: 31, scope: !284)
!570 = !DILocation(line: 59, column: 38, scope: !284)
!571 = !DILocation(line: 58, column: 3, scope: !284)
!572 = !DILocation(line: 60, column: 27, scope: !284)
!573 = !DILocation(line: 60, column: 3, scope: !284)
!574 = !DILocation(line: 62, column: 23, scope: !284)
!575 = !DILocation(line: 62, column: 3, scope: !284)
!576 = !DILocation(line: 65, column: 5, scope: !284)
!577 = !DILocation(line: 65, column: 12, scope: !284)
!578 = !DILocation(line: 65, column: 17, scope: !284)
!579 = !DILocation(line: 65, column: 54, scope: !284)
!580 = !DILocation(line: 65, column: 3, scope: !284)
!581 = !DILocation(line: 71, column: 5, scope: !284)
!582 = !DILocation(line: 71, column: 12, scope: !284)
!583 = !DILocation(line: 71, column: 20, scope: !284)
!584 = !DILocation(line: 71, column: 40, scope: !284)
!585 = !DILocation(line: 71, column: 3, scope: !284)
!586 = !DILocation(line: 72, column: 1, scope: !284)
