; ModuleID = 'cBench/consumer_jpeg_c/src/jcmarker.c'
source_filename = "cBench/consumer_jpeg_c/src/jcmarker.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_compress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, double, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], [16 x i8], [16 x i8], [16 x i8], i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.jpeg_marker_writer = type { ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_component_info = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.jpeg_destination_mgr = type { ptr, i64, ptr, ptr, ptr }
%struct.JQUANT_TBL = type { [64 x i16], i32 }
%struct.JHUFF_TBL = type { [17 x i8], [256 x i8], i32 }

@jpeg_natural_order = external constant [0 x i32], align 4

; Function Attrs: noinline nounwind uwtable
define dso_local void @jinit_marker_writer(ptr noundef %0) #0 !dbg !584 {
  %2 = alloca ptr, align 8

!142 = !DIEnumerator(name: "JERR_SOF_UNSUPPORTED", value: 59)
!143 = !DIEnumerator(name: "JERR_SOI_DUPLICATE", value: 60)
!144 = !DIEnumerator(name: "JERR_SOS_NO_SOF", value: 61)
!145 = !DIEnumerator(name: "JERR_TFILE_CREATE", value: 62)
!146 = !DIEnumerator(name: "JERR_TFILE_READ", value: 63)
!147 = !DIEnumerator(name: "JERR_TFILE_SEEK", value: 64)
!148 = !DIEnumerator(name: "JERR_TFILE_WRITE", value: 65)
!149 = !DIEnumerator(name: "JERR_TOO_LITTLE_DATA", value: 66)
!150 = !DIEnumerator(name: "JERR_UNKNOWN_MARKER", value: 67)
!151 = !DIEnumerator(name: "JERR_VIRTUAL_BUG", value: 68)
!152 = !DIEnumerator(name: "JERR_WIDTH_OVERFLOW", value: 69)
!153 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!154 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!155 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!156 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!157 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!158 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!159 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!160 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!161 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!162 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!163 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!164 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!165 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!166 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!167 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!168 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!169 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!170 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!171 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!172 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!173 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!174 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!175 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!176 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!177 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!178 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!179 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!180 = !DIEnumerator(name: "JTRC_RST", value: 97)
!181 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!182 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!183 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!184 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!185 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!186 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!187 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!188 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!189 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!190 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!191 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!192 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!193 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!194 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!195 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!196 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!197 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!198 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!199 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!200 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!201 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!202 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!203 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!204 = !{!205, !224, !239, !5, !575, !238, !353, !237, !299}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_writer", file: !19, line: 120, size: 384, elements: !207)
!207 = !{!208, !570, !571, !572, !573, !574}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "write_any_marker", scope: !206, file: !19, line: 123, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212, !238, !568, !5}
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_compress_ptr", file: !4, line: 249, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !4, line: 255, size: 3968, elements: !215)
!215 = !{!216, !343, !344, !345, !346, !347, !364, !365, !366, !367, !369, !371, !372, !373, !374, !409, !413, !429, !430, !434, !435, !436, !437, !450, !451, !452, !453, !454, !455, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !472, !473, !474, !475, !479, !480, !481, !482, !483, !492, !506, !517, !526, !527, !536, !546, !555}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !214, file: !4, line: 256, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !219)
!219 = !{!220, !311, !312, !313, !319, !320, !321, !332, !333, !334, !339, !340, !341, !342}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !218, file: !4, line: 620, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !224}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !227)
!227 = !{!228, !229, !300, !309, !310}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !226, file: !4, line: 241, baseType: !217, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !226, file: !4, line: 241, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !232)
!232 = !{!233, !242, !243, !255, !269, !277, !284, !285, !289, !293, !297, !298}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !231, file: !4, line: 733, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !224, !238, !239}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!238 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !240, line: 18, baseType: !241)
!240 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!241 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !231, file: !4, line: 735, baseType: !234, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !231, file: !4, line: 737, baseType: !244, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !224, !238, !254, !254}
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !252, line: 59, baseType: !253)
!252 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!253 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !252, line: 171, baseType: !5)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !231, file: !4, line: 740, baseType: !256, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !224, !238, !254, !254}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !264)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 1024, elements: !267)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !252, line: 99, baseType: !266)
!266 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!267 = !{!268}
!268 = !DISubrange(count: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !231, file: !4, line: 743, baseType: !270, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !224, !238, !276, !254, !254, !254}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !252, line: 227, baseType: !238)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !231, file: !4, line: 749, baseType: !278, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!281, !224, !238, !276, !254, !254, !254}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !231, file: !4, line: 755, baseType: !221, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !231, file: !4, line: 756, baseType: !286, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!247, !224, !273, !254, !254, !276}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !231, file: !4, line: 761, baseType: !290, size: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!259, !224, !281, !254, !254, !276}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !231, file: !4, line: 766, baseType: !294, size: 64, offset: 576)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !224, !238}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !231, file: !4, line: 767, baseType: !221, size: 64, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !231, file: !4, line: 774, baseType: !299, size: 64, offset: 704)
!299 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !226, file: !4, line: 241, baseType: !301, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !303)
!303 = !{!304, !305, !306, !307, !308}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !302, file: !4, line: 677, baseType: !221, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !302, file: !4, line: 679, baseType: !299, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !302, file: !4, line: 680, baseType: !299, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !302, file: !4, line: 681, baseType: !238, size: 32, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !302, file: !4, line: 682, baseType: !238, size: 32, offset: 224)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !226, file: !4, line: 241, baseType: !276, size: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !226, file: !4, line: 241, baseType: !238, size: 32, offset: 224)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !218, file: !4, line: 622, baseType: !294, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !218, file: !4, line: 624, baseType: !221, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !218, file: !4, line: 626, baseType: !314, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !224, !317}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !218, file: !4, line: 629, baseType: !221, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !218, file: !4, line: 634, baseType: !238, size: 32, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !218, file: !4, line: 639, baseType: !322, size: 640, offset: 352)
!322 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !218, file: !4, line: 636, size: 640, elements: !323)
!323 = !{!324, !328}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !322, file: !4, line: 637, baseType: !325, size: 256)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 256, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 8)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !322, file: !4, line: 638, baseType: !329, size: 640)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 640, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 80)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !218, file: !4, line: 643, baseType: !238, size: 32, offset: 992)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !218, file: !4, line: 651, baseType: !299, size: 64, offset: 1024)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !218, file: !4, line: 663, baseType: !335, size: 64, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !218, file: !4, line: 664, baseType: !238, size: 32, offset: 1152)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !218, file: !4, line: 668, baseType: !335, size: 64, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !218, file: !4, line: 669, baseType: !238, size: 32, offset: 1280)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !218, file: !4, line: 670, baseType: !238, size: 32, offset: 1312)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !214, file: !4, line: 256, baseType: !230, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !214, file: !4, line: 256, baseType: !301, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !214, file: !4, line: 256, baseType: !276, size: 32, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !214, file: !4, line: 256, baseType: !238, size: 32, offset: 224)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !214, file: !4, line: 259, baseType: !348, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !4, line: 688, size: 320, elements: !350)
!350 = !{!351, !354, !355, !359, !363}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !349, file: !4, line: 689, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !252, line: 110, baseType: !253)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !349, file: !4, line: 690, baseType: !239, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !349, file: !4, line: 692, baseType: !356, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !212}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !349, file: !4, line: 693, baseType: !360, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!276, !212}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !349, file: !4, line: 694, baseType: !356, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !214, file: !4, line: 266, baseType: !254, size: 32, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !214, file: !4, line: 267, baseType: !254, size: 32, offset: 352)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "input_components", scope: !214, file: !4, line: 268, baseType: !238, size: 32, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "in_color_space", scope: !214, file: !4, line: 269, baseType: !368, size: 32, offset: 416)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "input_gamma", scope: !214, file: !4, line: 271, baseType: !370, size: 64, offset: 448)
!370 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !214, file: !4, line: 281, baseType: !238, size: 32, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !214, file: !4, line: 283, baseType: !238, size: 32, offset: 544)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !214, file: !4, line: 284, baseType: !368, size: 32, offset: 576)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !214, file: !4, line: 286, baseType: !375, size: 64, offset: 640)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !408}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !377, file: !4, line: 120, baseType: !238, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !377, file: !4, line: 121, baseType: !238, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !377, file: !4, line: 122, baseType: !238, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !377, file: !4, line: 123, baseType: !238, size: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !377, file: !4, line: 124, baseType: !238, size: 32, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !377, file: !4, line: 129, baseType: !238, size: 32, offset: 160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !377, file: !4, line: 130, baseType: !238, size: 32, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !377, file: !4, line: 139, baseType: !254, size: 32, offset: 224)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !377, file: !4, line: 140, baseType: !254, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !377, file: !4, line: 147, baseType: !238, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !377, file: !4, line: 154, baseType: !254, size: 32, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !377, file: !4, line: 155, baseType: !254, size: 32, offset: 352)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !377, file: !4, line: 160, baseType: !276, size: 32, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !377, file: !4, line: 164, baseType: !238, size: 32, offset: 416)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !377, file: !4, line: 165, baseType: !238, size: 32, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !377, file: !4, line: 166, baseType: !238, size: 32, offset: 480)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !377, file: !4, line: 167, baseType: !238, size: 32, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !377, file: !4, line: 168, baseType: !238, size: 32, offset: 544)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !377, file: !4, line: 169, baseType: !238, size: 32, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !377, file: !4, line: 175, baseType: !399, size: 64, offset: 640)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !402)
!402 = !{!403, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !401, file: !4, line: 88, baseType: !404, size: 1024)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 1024, elements: !267)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !252, line: 147, baseType: !406)
!406 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !401, file: !4, line: 94, baseType: !276, size: 32, offset: 1024)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !377, file: !4, line: 178, baseType: !237, size: 64, offset: 704)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !214, file: !4, line: 289, baseType: !410, size: 256, offset: 704)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 256, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 4)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !214, file: !4, line: 292, baseType: !414, size: 256, offset: 960)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 256, elements: !411)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !418)
!418 = !{!419, !424, !428}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !417, file: !4, line: 102, baseType: !420, size: 136)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 136, elements: !422)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !252, line: 135, baseType: !253)
!422 = !{!423}
!423 = !DISubrange(count: 17)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !417, file: !4, line: 104, baseType: !425, size: 2048, offset: 136)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 2048, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !417, file: !4, line: 110, baseType: !276, size: 32, offset: 2208)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !214, file: !4, line: 293, baseType: !414, size: 256, offset: 1216)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !214, file: !4, line: 296, baseType: !431, size: 128, offset: 1472)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 128, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 16)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !214, file: !4, line: 297, baseType: !431, size: 128, offset: 1600)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !214, file: !4, line: 298, baseType: !431, size: 128, offset: 1728)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "num_scans", scope: !214, file: !4, line: 300, baseType: !238, size: 32, offset: 1856)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "scan_info", scope: !214, file: !4, line: 301, baseType: !438, size: 64, offset: 1920)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_scan_info", file: !4, line: 189, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 184, size: 288, elements: !442)
!442 = !{!443, !444, !446, !447, !448, !449}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !441, file: !4, line: 185, baseType: !238, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !441, file: !4, line: 186, baseType: !445, size: 128, offset: 32)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 128, elements: !411)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !441, file: !4, line: 187, baseType: !238, size: 32, offset: 160)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !441, file: !4, line: 187, baseType: !238, size: 32, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !441, file: !4, line: 188, baseType: !238, size: 32, offset: 224)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !441, file: !4, line: 188, baseType: !238, size: 32, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_in", scope: !214, file: !4, line: 307, baseType: !276, size: 32, offset: 1984)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !214, file: !4, line: 308, baseType: !276, size: 32, offset: 2016)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_coding", scope: !214, file: !4, line: 309, baseType: !276, size: 32, offset: 2048)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !214, file: !4, line: 310, baseType: !276, size: 32, offset: 2080)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "smoothing_factor", scope: !214, file: !4, line: 311, baseType: !238, size: 32, offset: 2112)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !214, file: !4, line: 312, baseType: !456, size: 32, offset: 2144)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !214, file: !4, line: 319, baseType: !5, size: 32, offset: 2176)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "restart_in_rows", scope: !214, file: !4, line: 320, baseType: !238, size: 32, offset: 2208)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "write_JFIF_header", scope: !214, file: !4, line: 324, baseType: !276, size: 32, offset: 2240)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !214, file: !4, line: 329, baseType: !421, size: 8, offset: 2272)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !214, file: !4, line: 330, baseType: !405, size: 16, offset: 2288)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !214, file: !4, line: 331, baseType: !405, size: 16, offset: 2304)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "write_Adobe_marker", scope: !214, file: !4, line: 332, baseType: !276, size: 32, offset: 2336)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next_scanline", scope: !214, file: !4, line: 339, baseType: !254, size: 32, offset: 2368)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !214, file: !4, line: 348, baseType: !276, size: 32, offset: 2400)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !214, file: !4, line: 349, baseType: !238, size: 32, offset: 2432)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !214, file: !4, line: 350, baseType: !238, size: 32, offset: 2464)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !214, file: !4, line: 352, baseType: !254, size: 32, offset: 2496)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !214, file: !4, line: 363, baseType: !238, size: 32, offset: 2528)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !214, file: !4, line: 364, baseType: !471, size: 256, offset: 2560)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 256, elements: !411)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !214, file: !4, line: 367, baseType: !254, size: 32, offset: 2816)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !214, file: !4, line: 368, baseType: !254, size: 32, offset: 2848)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !214, file: !4, line: 370, baseType: !238, size: 32, offset: 2880)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !214, file: !4, line: 371, baseType: !476, size: 320, offset: 2912)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 320, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 10)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !214, file: !4, line: 375, baseType: !238, size: 32, offset: 3232)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !214, file: !4, line: 375, baseType: !238, size: 32, offset: 3264)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !214, file: !4, line: 375, baseType: !238, size: 32, offset: 3296)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !214, file: !4, line: 375, baseType: !238, size: 32, offset: 3328)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !214, file: !4, line: 380, baseType: !484, size: 64, offset: 3392)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_comp_master", file: !19, line: 45, size: 256, elements: !486)
!486 = !{!487, !488, !489, !490, !491}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_pass", scope: !485, file: !19, line: 46, baseType: !356, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pass_startup", scope: !485, file: !19, line: 47, baseType: !356, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !485, file: !19, line: 48, baseType: !356, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "call_pass_startup", scope: !485, file: !19, line: 51, baseType: !276, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "is_last_pass", scope: !485, file: !19, line: 52, baseType: !276, size: 32, offset: 224)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !214, file: !4, line: 381, baseType: !493, size: 64, offset: 3456)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_main_controller", file: !19, line: 56, size: 128, elements: !495)
!495 = !{!496, !501}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !494, file: !19, line: 57, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !212, !500}
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !19, line: 22, baseType: !18)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !494, file: !19, line: 58, baseType: !502, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !212, !247, !505, !254}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prep", scope: !214, file: !4, line: 382, baseType: !507, size: 64, offset: 3520)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_prep_controller", file: !19, line: 64, size: 128, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !508, file: !19, line: 65, baseType: !497, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pre_process_data", scope: !508, file: !19, line: 66, baseType: !512, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !212, !247, !505, !254, !515, !505, !254}
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !4, line: 68, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !214, file: !4, line: 383, baseType: !518, size: 64, offset: 3584)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_coef_controller", file: !19, line: 76, size: 128, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !519, file: !19, line: 77, baseType: !497, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "compress_data", scope: !519, file: !19, line: 78, baseType: !523, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!276, !212, !515}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !214, file: !4, line: 384, baseType: !205, size: 64, offset: 3648)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !214, file: !4, line: 385, baseType: !528, size: 64, offset: 3712)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_converter", file: !19, line: 83, size: 128, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !529, file: !19, line: 84, baseType: !356, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !529, file: !19, line: 85, baseType: !533, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !212, !247, !515, !254, !238}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !214, file: !4, line: 386, baseType: !537, size: 64, offset: 3776)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_downsampler", file: !19, line: 91, size: 192, elements: !539)
!539 = !{!540, !541, !545}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !538, file: !19, line: 92, baseType: !356, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !538, file: !19, line: 93, baseType: !542, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !212, !515, !254, !515, !254}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !538, file: !19, line: 98, baseType: !276, size: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !214, file: !4, line: 387, baseType: !547, size: 64, offset: 3840)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_forward_dct", file: !19, line: 102, size: 128, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !548, file: !19, line: 103, baseType: !356, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "forward_DCT", scope: !548, file: !19, line: 105, baseType: !552, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !212, !375, !247, !261, !254, !254, !254}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !214, file: !4, line: 388, baseType: !556, size: 64, offset: 3904)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_encoder", file: !19, line: 113, size: 192, elements: !558)
!558 = !{!559, !563, !567}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !557, file: !19, line: 114, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !212, !276}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "encode_mcu", scope: !557, file: !19, line: 115, baseType: !564, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!276, !212, !260}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !557, file: !19, line: 116, baseType: !356, size: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_header", scope: !206, file: !19, line: 125, baseType: !356, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame_header", scope: !206, file: !19, line: 126, baseType: !356, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "write_scan_header", scope: !206, file: !19, line: 127, baseType: !356, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_trailer", scope: !206, file: !19, line: 128, baseType: !356, size: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "write_tables_only", scope: !206, file: !19, line: 129, baseType: !356, size: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "JPEG_MARKER", file: !1, line: 81, baseType: !25)
!576 = !{i32 7, !"Dwarf Version", i32 5}
!577 = !{i32 2, !"Debug Info Version", i32 3}
!578 = !{i32 1, !"wchar_size", i32 4}
!579 = !{i32 8, !"PIC Level", i32 2}
!580 = !{i32 7, !"PIE Level", i32 2}
!581 = !{i32 7, !"uwtable", i32 2}
!582 = !{i32 7, !"frame-pointer", i32 2}
!583 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!584 = distinct !DISubprogram(name: "jinit_marker_writer", scope: !1, file: !1, line: 628, type: !357, scopeLine: 629, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !585)
!585 = !{}
!586 = !DILocalVariable(name: "cinfo", arg: 1, scope: !584, file: !1, line: 628, type: !212)
!587 = !DILocation(line: 628, column: 37, scope: !584)
!588 = !DILocation(line: 632, column: 7, scope: !584)
!589 = !DILocation(line: 632, column: 14, scope: !584)
!590 = !DILocation(line: 632, column: 19, scope: !584)
!591 = !DILocation(line: 632, column: 48, scope: !584)
!592 = !DILocation(line: 632, column: 5, scope: !584)
!593 = !DILocation(line: 631, column: 3, scope: !584)
!594 = !DILocation(line: 631, column: 10, scope: !584)
!595 = !DILocation(line: 631, column: 17, scope: !584)
!596 = !DILocation(line: 635, column: 3, scope: !584)
!597 = !DILocation(line: 635, column: 10, scope: !584)
!598 = !DILocation(line: 635, column: 18, scope: !584)
!599 = !DILocation(line: 635, column: 35, scope: !584)
!600 = !DILocation(line: 636, column: 3, scope: !584)
!601 = !DILocation(line: 636, column: 10, scope: !584)
!602 = !DILocation(line: 636, column: 18, scope: !584)
!603 = !DILocation(line: 636, column: 36, scope: !584)
!604 = !DILocation(line: 637, column: 3, scope: !584)
!605 = !DILocation(line: 637, column: 10, scope: !584)
!606 = !DILocation(line: 637, column: 18, scope: !584)
!607 = !DILocation(line: 637, column: 37, scope: !584)
!608 = !DILocation(line: 638, column: 3, scope: !584)
!609 = !DILocation(line: 638, column: 10, scope: !584)
!610 = !DILocation(line: 638, column: 18, scope: !584)
!611 = !DILocation(line: 638, column: 36, scope: !584)
!612 = !DILocation(line: 639, column: 3, scope: !584)
!613 = !DILocation(line: 639, column: 10, scope: !584)
!614 = !DILocation(line: 639, column: 18, scope: !584)
!615 = !DILocation(line: 639, column: 37, scope: !584)
!616 = !DILocation(line: 640, column: 3, scope: !584)
!617 = !DILocation(line: 640, column: 10, scope: !584)
!618 = !DILocation(line: 640, column: 18, scope: !584)
!619 = !DILocation(line: 640, column: 36, scope: !584)
!620 = !DILocation(line: 641, column: 1, scope: !584)
!621 = distinct !DISubprogram(name: "write_any_marker", scope: !1, file: !1, line: 430, type: !210, scopeLine: 433, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !585)
!622 = !DILocalVariable(name: "cinfo", arg: 1, scope: !621, file: !1, line: 430, type: !212)
!623 = !DILocation(line: 430, column: 34, scope: !621)
!624 = !DILocalVariable(name: "marker", arg: 2, scope: !621, file: !1, line: 430, type: !238)
!625 = !DILocation(line: 430, column: 45, scope: !621)
!626 = !DILocalVariable(name: "dataptr", arg: 3, scope: !621, file: !1, line: 431, type: !568)
!627 = !DILocation(line: 431, column: 19, scope: !621)
!628 = !DILocalVariable(name: "datalen", arg: 4, scope: !621, file: !1, line: 431, type: !5)
!629 = !DILocation(line: 431, column: 41, scope: !621)
!630 = !DILocation(line: 434, column: 7, scope: !631)
!631 = distinct !DILexicalBlock(scope: !621, file: !1, line: 434, column: 7)
!632 = !DILocation(line: 434, column: 15, scope: !631)
!633 = !DILocation(line: 435, column: 17, scope: !634)
!634 = distinct !DILexicalBlock(scope: !631, file: !1, line: 434, column: 40)
!635 = !DILocation(line: 435, column: 38, scope: !634)
