; ModuleID = 'cBench/consumer_jpeg_c/src/jcmaster.c'
source_filename = "cBench/consumer_jpeg_c/src/jcmaster.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_compress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, double, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], [16 x i8], [16 x i8], [16 x i8], i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.my_comp_master = type { %struct.jpeg_comp_master, i32, i32, i32, i32 }
%struct.jpeg_comp_master = type { ptr, ptr, ptr, i32, i32 }
%struct.jpeg_color_converter = type { ptr, ptr }
%struct.jpeg_downsampler = type { ptr, ptr, i32 }
%struct.jpeg_c_prep_controller = type { ptr, ptr }
%struct.jpeg_forward_dct = type { ptr, ptr }
%struct.jpeg_entropy_encoder = type { ptr, ptr, ptr }
%struct.jpeg_c_coef_controller = type { ptr, ptr }
%struct.jpeg_c_main_controller = type { ptr, ptr }
%struct.jpeg_marker_writer = type { ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }

!99 = !DIEnumerator(name: "JERR_TOO_LITTLE_DATA", value: 66)
!100 = !DIEnumerator(name: "JERR_UNKNOWN_MARKER", value: 67)
!101 = !DIEnumerator(name: "JERR_VIRTUAL_BUG", value: 68)
!102 = !DIEnumerator(name: "JERR_WIDTH_OVERFLOW", value: 69)
!103 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!104 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!105 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!106 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!107 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!108 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!109 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!110 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!111 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!112 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!113 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!114 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!115 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!116 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!117 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!118 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!119 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!120 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!121 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!122 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!123 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!124 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!125 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!126 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!127 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!128 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!129 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!130 = !DIEnumerator(name: "JTRC_RST", value: 97)
!131 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!132 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!133 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!134 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!135 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!136 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!137 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!138 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!139 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!140 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!141 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!142 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!143 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!144 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!145 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!146 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!147 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!148 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!149 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!150 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!151 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!152 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!153 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!154 = !{!155, !179, !194, !436, !192, !193, !209, !254, !5}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_master_ptr", file: !1, line: 38, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_comp_master", file: !1, line: 36, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 27, size: 384, elements: !159)
!159 = !{!160, !531, !533, !534, !535}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !158, file: !1, line: 28, baseType: !161, size: 256)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_comp_master", file: !19, line: 45, size: 256, elements: !162)
!162 = !{!163, !527, !528, !529, !530}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_pass", scope: !161, file: !19, line: 46, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !167}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_compress_ptr", file: !4, line: 249, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !4, line: 255, size: 3968, elements: !170)
!170 = !{!171, !298, !299, !300, !301, !302, !316, !317, !318, !319, !321, !323, !324, !325, !326, !361, !365, !381, !382, !386, !387, !388, !389, !402, !403, !404, !405, !406, !407, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !424, !425, !426, !427, !431, !432, !433, !434, !435, !437, !451, !462, !471, !486, !495, !505, !514}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !169, file: !4, line: 256, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !174)
!174 = !{!175, !266, !267, !268, !274, !275, !276, !287, !288, !289, !294, !295, !296, !297}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !173, file: !4, line: 620, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !179}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !182)
!182 = !{!183, !184, !255, !264, !265}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !181, file: !4, line: 241, baseType: !172, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !181, file: !4, line: 241, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !187)
!187 = !{!188, !197, !198, !210, !224, !232, !239, !240, !244, !248, !252, !253}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !186, file: !4, line: 733, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !179, !193, !194}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!193 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !195, line: 18, baseType: !196)
!195 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!196 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !186, file: !4, line: 735, baseType: !189, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !186, file: !4, line: 737, baseType: !199, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !179, !193, !209, !209}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !207, line: 59, baseType: !208)
!207 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!208 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !207, line: 171, baseType: !5)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !186, file: !4, line: 740, baseType: !211, size: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !179, !193, !209, !209}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 1024, elements: !222)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !207, line: 99, baseType: !221)
!221 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!222 = !{!223}
!223 = !DISubrange(count: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !186, file: !4, line: 743, baseType: !225, size: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !179, !193, !231, !209, !209, !209}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !207, line: 227, baseType: !193)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !186, file: !4, line: 749, baseType: !233, size: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !179, !193, !231, !209, !209, !209}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !186, file: !4, line: 755, baseType: !176, size: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !186, file: !4, line: 756, baseType: !241, size: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!202, !179, !228, !209, !209, !231}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !186, file: !4, line: 761, baseType: !245, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!214, !179, !236, !209, !209, !231}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !186, file: !4, line: 766, baseType: !249, size: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !179, !193}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !186, file: !4, line: 767, baseType: !176, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !186, file: !4, line: 774, baseType: !254, size: 64, offset: 704)
!254 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !181, file: !4, line: 241, baseType: !256, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !258)
!258 = !{!259, !260, !261, !262, !263}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !257, file: !4, line: 677, baseType: !176, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !257, file: !4, line: 679, baseType: !254, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !257, file: !4, line: 680, baseType: !254, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !257, file: !4, line: 681, baseType: !193, size: 32, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !257, file: !4, line: 682, baseType: !193, size: 32, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !181, file: !4, line: 241, baseType: !231, size: 32, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !181, file: !4, line: 241, baseType: !193, size: 32, offset: 224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !173, file: !4, line: 622, baseType: !249, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !173, file: !4, line: 624, baseType: !176, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !173, file: !4, line: 626, baseType: !269, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !179, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !173, file: !4, line: 629, baseType: !176, size: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !173, file: !4, line: 634, baseType: !193, size: 32, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !173, file: !4, line: 639, baseType: !277, size: 640, offset: 352)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !173, file: !4, line: 636, size: 640, elements: !278)
!278 = !{!279, !283}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !277, file: !4, line: 637, baseType: !280, size: 256)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 256, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !277, file: !4, line: 638, baseType: !284, size: 640)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 640, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 80)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !173, file: !4, line: 643, baseType: !193, size: 32, offset: 992)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !173, file: !4, line: 651, baseType: !254, size: 64, offset: 1024)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !173, file: !4, line: 663, baseType: !290, size: 64, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !173, file: !4, line: 664, baseType: !193, size: 32, offset: 1152)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !173, file: !4, line: 668, baseType: !290, size: 64, offset: 1216)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !173, file: !4, line: 669, baseType: !193, size: 32, offset: 1280)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !173, file: !4, line: 670, baseType: !193, size: 32, offset: 1312)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !169, file: !4, line: 256, baseType: !185, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !169, file: !4, line: 256, baseType: !256, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !169, file: !4, line: 256, baseType: !231, size: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !169, file: !4, line: 256, baseType: !193, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !169, file: !4, line: 259, baseType: !303, size: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !4, line: 688, size: 320, elements: !305)
!305 = !{!306, !309, !310, !311, !315}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !304, file: !4, line: 689, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !207, line: 110, baseType: !208)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !304, file: !4, line: 690, baseType: !194, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !304, file: !4, line: 692, baseType: !164, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !304, file: !4, line: 693, baseType: !312, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!231, !167}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !304, file: !4, line: 694, baseType: !164, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !169, file: !4, line: 266, baseType: !209, size: 32, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !169, file: !4, line: 267, baseType: !209, size: 32, offset: 352)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "input_components", scope: !169, file: !4, line: 268, baseType: !193, size: 32, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "in_color_space", scope: !169, file: !4, line: 269, baseType: !320, size: 32, offset: 416)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "input_gamma", scope: !169, file: !4, line: 271, baseType: !322, size: 64, offset: 448)
!322 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !169, file: !4, line: 281, baseType: !193, size: 32, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !169, file: !4, line: 283, baseType: !193, size: 32, offset: 544)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !169, file: !4, line: 284, baseType: !320, size: 32, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !169, file: !4, line: 286, baseType: !327, size: 64, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !360}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !329, file: !4, line: 120, baseType: !193, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !329, file: !4, line: 121, baseType: !193, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !329, file: !4, line: 122, baseType: !193, size: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !329, file: !4, line: 123, baseType: !193, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !329, file: !4, line: 124, baseType: !193, size: 32, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !329, file: !4, line: 129, baseType: !193, size: 32, offset: 160)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !329, file: !4, line: 130, baseType: !193, size: 32, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !329, file: !4, line: 139, baseType: !209, size: 32, offset: 224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !329, file: !4, line: 140, baseType: !209, size: 32, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !329, file: !4, line: 147, baseType: !193, size: 32, offset: 288)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !329, file: !4, line: 154, baseType: !209, size: 32, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !329, file: !4, line: 155, baseType: !209, size: 32, offset: 352)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !329, file: !4, line: 160, baseType: !231, size: 32, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !329, file: !4, line: 164, baseType: !193, size: 32, offset: 416)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !329, file: !4, line: 165, baseType: !193, size: 32, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !329, file: !4, line: 166, baseType: !193, size: 32, offset: 480)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !329, file: !4, line: 167, baseType: !193, size: 32, offset: 512)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !329, file: !4, line: 168, baseType: !193, size: 32, offset: 544)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !329, file: !4, line: 169, baseType: !193, size: 32, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !329, file: !4, line: 175, baseType: !351, size: 64, offset: 640)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !354)
!354 = !{!355, !359}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !353, file: !4, line: 88, baseType: !356, size: 1024)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 1024, elements: !222)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !207, line: 147, baseType: !358)
!358 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !353, file: !4, line: 94, baseType: !231, size: 32, offset: 1024)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !329, file: !4, line: 178, baseType: !192, size: 64, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !169, file: !4, line: 289, baseType: !362, size: 256, offset: 704)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 256, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 4)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !169, file: !4, line: 292, baseType: !366, size: 256, offset: 960)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 256, elements: !363)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !370)
!370 = !{!371, !376, !380}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !369, file: !4, line: 102, baseType: !372, size: 136)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 136, elements: !374)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !207, line: 135, baseType: !208)
!374 = !{!375}
!375 = !DISubrange(count: 17)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !369, file: !4, line: 104, baseType: !377, size: 2048, offset: 136)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 2048, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !369, file: !4, line: 110, baseType: !231, size: 32, offset: 2208)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !169, file: !4, line: 293, baseType: !366, size: 256, offset: 1216)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !169, file: !4, line: 296, baseType: !383, size: 128, offset: 1472)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 128, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 16)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !169, file: !4, line: 297, baseType: !383, size: 128, offset: 1600)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !169, file: !4, line: 298, baseType: !383, size: 128, offset: 1728)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "num_scans", scope: !169, file: !4, line: 300, baseType: !193, size: 32, offset: 1856)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "scan_info", scope: !169, file: !4, line: 301, baseType: !390, size: 64, offset: 1920)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_scan_info", file: !4, line: 189, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 184, size: 288, elements: !394)
!394 = !{!395, !396, !398, !399, !400, !401}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !393, file: !4, line: 185, baseType: !193, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !393, file: !4, line: 186, baseType: !397, size: 128, offset: 32)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 128, elements: !363)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !393, file: !4, line: 187, baseType: !193, size: 32, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !393, file: !4, line: 187, baseType: !193, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !393, file: !4, line: 188, baseType: !193, size: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !393, file: !4, line: 188, baseType: !193, size: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_in", scope: !169, file: !4, line: 307, baseType: !231, size: 32, offset: 1984)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !169, file: !4, line: 308, baseType: !231, size: 32, offset: 2016)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_coding", scope: !169, file: !4, line: 309, baseType: !231, size: 32, offset: 2048)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !169, file: !4, line: 310, baseType: !231, size: 32, offset: 2080)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "smoothing_factor", scope: !169, file: !4, line: 311, baseType: !193, size: 32, offset: 2112)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !169, file: !4, line: 312, baseType: !408, size: 32, offset: 2144)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !169, file: !4, line: 319, baseType: !5, size: 32, offset: 2176)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "restart_in_rows", scope: !169, file: !4, line: 320, baseType: !193, size: 32, offset: 2208)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "write_JFIF_header", scope: !169, file: !4, line: 324, baseType: !231, size: 32, offset: 2240)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !169, file: !4, line: 329, baseType: !373, size: 8, offset: 2272)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !169, file: !4, line: 330, baseType: !357, size: 16, offset: 2288)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !169, file: !4, line: 331, baseType: !357, size: 16, offset: 2304)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "write_Adobe_marker", scope: !169, file: !4, line: 332, baseType: !231, size: 32, offset: 2336)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "next_scanline", scope: !169, file: !4, line: 339, baseType: !209, size: 32, offset: 2368)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !169, file: !4, line: 348, baseType: !231, size: 32, offset: 2400)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !169, file: !4, line: 349, baseType: !193, size: 32, offset: 2432)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !169, file: !4, line: 350, baseType: !193, size: 32, offset: 2464)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !169, file: !4, line: 352, baseType: !209, size: 32, offset: 2496)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !169, file: !4, line: 363, baseType: !193, size: 32, offset: 2528)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !169, file: !4, line: 364, baseType: !423, size: 256, offset: 2560)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 256, elements: !363)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !169, file: !4, line: 367, baseType: !209, size: 32, offset: 2816)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !169, file: !4, line: 368, baseType: !209, size: 32, offset: 2848)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !169, file: !4, line: 370, baseType: !193, size: 32, offset: 2880)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !169, file: !4, line: 371, baseType: !428, size: 320, offset: 2912)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 320, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 10)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !169, file: !4, line: 375, baseType: !193, size: 32, offset: 3232)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !169, file: !4, line: 375, baseType: !193, size: 32, offset: 3264)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !169, file: !4, line: 375, baseType: !193, size: 32, offset: 3296)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !169, file: !4, line: 375, baseType: !193, size: 32, offset: 3328)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !169, file: !4, line: 380, baseType: !436, size: 64, offset: 3392)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !169, file: !4, line: 381, baseType: !438, size: 64, offset: 3456)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_main_controller", file: !19, line: 56, size: 128, elements: !440)
!440 = !{!441, !446}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !439, file: !19, line: 57, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !167, !445}
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !19, line: 22, baseType: !18)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !439, file: !19, line: 58, baseType: !447, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !167, !202, !450, !209}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "prep", scope: !169, file: !4, line: 382, baseType: !452, size: 64, offset: 3520)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_prep_controller", file: !19, line: 64, size: 128, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !453, file: !19, line: 65, baseType: !442, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pre_process_data", scope: !453, file: !19, line: 66, baseType: !457, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !167, !202, !450, !209, !460, !450, !209}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !4, line: 68, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !169, file: !4, line: 383, baseType: !463, size: 64, offset: 3584)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_coef_controller", file: !19, line: 76, size: 128, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !464, file: !19, line: 77, baseType: !442, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "compress_data", scope: !464, file: !19, line: 78, baseType: !468, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!231, !167, !460}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !169, file: !4, line: 384, baseType: !472, size: 64, offset: 3648)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_writer", file: !19, line: 120, size: 384, elements: !474)
!474 = !{!475, !481, !482, !483, !484, !485}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "write_any_marker", scope: !473, file: !19, line: 123, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !167, !193, !479, !5}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_header", scope: !473, file: !19, line: 125, baseType: !164, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame_header", scope: !473, file: !19, line: 126, baseType: !164, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "write_scan_header", scope: !473, file: !19, line: 127, baseType: !164, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_trailer", scope: !473, file: !19, line: 128, baseType: !164, size: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "write_tables_only", scope: !473, file: !19, line: 129, baseType: !164, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !169, file: !4, line: 385, baseType: !487, size: 64, offset: 3712)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_converter", file: !19, line: 83, size: 128, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !488, file: !19, line: 84, baseType: !164, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !488, file: !19, line: 85, baseType: !492, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !167, !202, !460, !209, !193}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !169, file: !4, line: 386, baseType: !496, size: 64, offset: 3776)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_downsampler", file: !19, line: 91, size: 192, elements: !498)
!498 = !{!499, !500, !504}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !497, file: !19, line: 92, baseType: !164, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !497, file: !19, line: 93, baseType: !501, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !167, !460, !209, !460, !209}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !497, file: !19, line: 98, baseType: !231, size: 32, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !169, file: !4, line: 387, baseType: !506, size: 64, offset: 3840)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_forward_dct", file: !19, line: 102, size: 128, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !507, file: !19, line: 103, baseType: !164, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "forward_DCT", scope: !507, file: !19, line: 105, baseType: !511, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !167, !327, !202, !216, !209, !209, !209}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !169, file: !4, line: 388, baseType: !515, size: 64, offset: 3904)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_encoder", file: !19, line: 113, size: 192, elements: !517)
!517 = !{!518, !522, !526}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !516, file: !19, line: 114, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !167, !231}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "encode_mcu", scope: !516, file: !19, line: 115, baseType: !523, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!231, !167, !215}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !516, file: !19, line: 116, baseType: !164, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pass_startup", scope: !161, file: !19, line: 47, baseType: !164, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !161, file: !19, line: 48, baseType: !164, size: 64, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "call_pass_startup", scope: !161, file: !19, line: 51, baseType: !231, size: 32, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "is_last_pass", scope: !161, file: !19, line: 52, baseType: !231, size: 32, offset: 224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pass_type", scope: !158, file: !1, line: 30, baseType: !532, size: 32, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "c_pass_type", file: !1, line: 25, baseType: !25)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !158, file: !1, line: 32, baseType: !193, size: 32, offset: 288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !158, file: !1, line: 33, baseType: !193, size: 32, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "scan_number", scope: !158, file: !1, line: 35, baseType: !193, size: 32, offset: 352)
!536 = !{i32 7, !"Dwarf Version", i32 5}
!537 = !{i32 2, !"Debug Info Version", i32 3}
!538 = !{i32 1, !"wchar_size", i32 4}
!539 = !{i32 8, !"PIC Level", i32 2}
!540 = !{i32 7, !"PIE Level", i32 2}
!541 = !{i32 7, !"uwtable", i32 2}
!542 = !{i32 7, !"frame-pointer", i32 2}
!543 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!544 = distinct !DISubprogram(name: "jinit_c_master_control", scope: !1, file: !1, line: 531, type: !520, scopeLine: 532, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !545)
!545 = !{}
!546 = !DILocalVariable(name: "cinfo", arg: 1, scope: !544, file: !1, line: 531, type: !167)
!547 = !DILocation(line: 531, column: 40, scope: !544)
!548 = !DILocalVariable(name: "transcode_only", arg: 2, scope: !544, file: !1, line: 531, type: !231)
!549 = !DILocation(line: 531, column: 55, scope: !544)
!550 = !DILocalVariable(name: "master", scope: !544, file: !1, line: 533, type: !155)
!551 = !DILocation(line: 533, column: 17, scope: !544)
!552 = !DILocation(line: 536, column: 9, scope: !544)
!553 = !DILocation(line: 536, column: 16, scope: !544)
!554 = !DILocation(line: 536, column: 21, scope: !544)
!555 = !DILocation(line: 536, column: 50, scope: !544)
!556 = !DILocation(line: 536, column: 7, scope: !544)
!557 = !DILocation(line: 535, column: 10, scope: !544)
!558 = !DILocation(line: 538, column: 47, scope: !544)
!559 = !DILocation(line: 538, column: 3, scope: !544)
!560 = !DILocation(line: 538, column: 10, scope: !544)
!561 = !DILocation(line: 538, column: 17, scope: !544)
!562 = !DILocation(line: 539, column: 3, scope: !544)
!563 = !DILocation(line: 539, column: 11, scope: !544)
!564 = !DILocation(line: 539, column: 15, scope: !544)
!565 = !DILocation(line: 539, column: 32, scope: !544)
!566 = !DILocation(line: 540, column: 3, scope: !544)
!567 = !DILocation(line: 540, column: 11, scope: !544)
!568 = !DILocation(line: 540, column: 15, scope: !544)
!569 = !DILocation(line: 540, column: 28, scope: !544)
!570 = !DILocation(line: 541, column: 3, scope: !544)
!571 = !DILocation(line: 541, column: 11, scope: !544)
!572 = !DILocation(line: 541, column: 15, scope: !544)
!573 = !DILocation(line: 541, column: 27, scope: !544)
!574 = !DILocation(line: 542, column: 3, scope: !544)
!575 = !DILocation(line: 542, column: 11, scope: !544)
!576 = !DILocation(line: 542, column: 15, scope: !544)
!577 = !DILocation(line: 542, column: 28, scope: !544)
!578 = !DILocation(line: 545, column: 17, scope: !544)
!579 = !DILocation(line: 545, column: 3, scope: !544)
!580 = !DILocation(line: 547, column: 7, scope: !581)
!581 = distinct !DILexicalBlock(scope: !544, file: !1, line: 547, column: 7)
!582 = !DILocation(line: 547, column: 14, scope: !581)
!583 = !DILocation(line: 547, column: 24, scope: !581)
!584 = !DILocation(line: 549, column: 21, scope: !585)
!585 = distinct !DILexicalBlock(scope: !581, file: !1, line: 547, column: 33)
!586 = !DILocation(line: 549, column: 5, scope: !585)
!587 = !DILocation(line: 553, column: 3, scope: !585)
!588 = !DILocation(line: 554, column: 5, scope: !589)
!589 = distinct !DILexicalBlock(scope: !581, file: !1, line: 553, column: 10)
!590 = !DILocation(line: 554, column: 12, scope: !589)
!591 = !DILocation(line: 554, column: 29, scope: !589)
!592 = !DILocation(line: 555, column: 5, scope: !589)
!593 = !DILocation(line: 555, column: 12, scope: !589)
!594 = !DILocation(line: 555, column: 22, scope: !589)
!595 = !DILocation(line: 558, column: 7, scope: !596)
!596 = distinct !DILexicalBlock(scope: !544, file: !1, line: 558, column: 7)
!597 = !DILocation(line: 558, column: 14, scope: !596)
!598 = !DILocation(line: 559, column: 5, scope: !596)
!599 = !DILocation(line: 559, column: 12, scope: !596)
!600 = !DILocation(line: 559, column: 28, scope: !596)
!601 = !DILocation(line: 562, column: 7, scope: !602)
