; ModuleID = 'cBench/consumer_jpeg_c/src/jcparam.c'
source_filename = "cBench/consumer_jpeg_c/src/jcparam.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_compress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, double, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], [16 x i8], [16 x i8], [16 x i8], i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.JQUANT_TBL = type { [64 x i16], i32 }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.jpeg_component_info = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }
%struct.jpeg_scan_info = type { i32, [4 x i32], i32, i32, i32, i32 }
%struct.JHUFF_TBL = type { [17 x i8], [256 x i8], i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "std_luminance_quant_tbl", scope: !2, file: !3, line: 71, type: !531, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "jpeg_set_linear_quality", scope: !3, file: !3, line: 59, type: !4, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !398, retainedNodes: !536)
!3 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jcparam.c", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "c8d40025e1c90585c54f84cab86e7818")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !33, !72}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_compress_ptr", file: !7, line: 249, baseType: !8)
!7 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpeglib.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "2a2b23235fe587b10147d741e3371e67")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !7, line: 255, size: 3968, elements: !10)
!10 = !{!11, !139, !140, !141, !142, !143, !160, !161, !162, !163, !173, !175, !176, !177, !178, !213, !217, !233, !234, !238, !239, !240, !241, !254, !255, !256, !257, !258, !259, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !281, !282, !283, !284, !288, !289, !290, !291, !292, !302, !322, !333, !342, !357, !366, !376, !385}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !9, file: !7, line: 256, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !7, line: 618, size: 1344, elements: !14)
!14 = !{!15, !107, !108, !109, !115, !116, !117, !128, !129, !130, !135, !136, !137, !138}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !13, file: !7, line: 620, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !7, line: 248, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !7, line: 240, size: 256, elements: !22)
!22 = !{!23, !24, !96, !105, !106}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !21, file: !7, line: 241, baseType: !12, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !21, file: !7, line: 241, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !7, line: 731, size: 768, elements: !27)
!27 = !{!28, !37, !38, !51, !65, !73, !80, !81, !85, !89, !93, !94}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !26, file: !7, line: 733, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !19, !33, !34}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !35, line: 18, baseType: !36)
!35 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!36 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !26, file: !7, line: 735, baseType: !29, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !26, file: !7, line: 737, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !19, !33, !49, !49}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !7, line: 67, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !7, line: 66, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !47, line: 59, baseType: !48)
!47 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!48 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !47, line: 171, baseType: !50)
!50 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !26, file: !7, line: 740, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !19, !33, !49, !49}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !7, line: 72, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !7, line: 71, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !7, line: 70, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1024, elements: !63)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !47, line: 99, baseType: !62)
!62 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!63 = !{!64}
!64 = !DISubrange(count: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !26, file: !7, line: 743, baseType: !66, size: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !19, !33, !72, !49, !49, !49}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !7, line: 727, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !7, line: 727, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !47, line: 227, baseType: !33)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !26, file: !7, line: 749, baseType: !74, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !19, !33, !72, !49, !49, !49}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !7, line: 728, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !7, line: 728, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !26, file: !7, line: 755, baseType: !16, size: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !26, file: !7, line: 756, baseType: !82, size: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!42, !19, !69, !49, !49, !72}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !26, file: !7, line: 761, baseType: !86, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!55, !19, !77, !49, !49, !72}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !26, file: !7, line: 766, baseType: !90, size: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !19, !33}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !26, file: !7, line: 767, baseType: !16, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !26, file: !7, line: 774, baseType: !95, size: 64, offset: 704)
!95 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !21, file: !7, line: 241, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !7, line: 676, size: 256, elements: !99)
!99 = !{!100, !101, !102, !103, !104}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !98, file: !7, line: 677, baseType: !16, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !98, file: !7, line: 679, baseType: !95, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !98, file: !7, line: 680, baseType: !95, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !98, file: !7, line: 681, baseType: !33, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !98, file: !7, line: 682, baseType: !33, size: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !21, file: !7, line: 241, baseType: !72, size: 32, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !21, file: !7, line: 241, baseType: !33, size: 32, offset: 224)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !13, file: !7, line: 622, baseType: !90, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !13, file: !7, line: 624, baseType: !16, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !13, file: !7, line: 626, baseType: !110, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !19, !113}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !13, file: !7, line: 629, baseType: !16, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !13, file: !7, line: 634, baseType: !33, size: 32, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !13, file: !7, line: 639, baseType: !118, size: 640, offset: 352)
!118 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !13, file: !7, line: 636, size: 640, elements: !119)
!119 = !{!120, !124}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !118, file: !7, line: 637, baseType: !121, size: 256)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 256, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 8)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !118, file: !7, line: 638, baseType: !125, size: 640)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 640, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 80)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !13, file: !7, line: 643, baseType: !33, size: 32, offset: 992)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !13, file: !7, line: 651, baseType: !95, size: 64, offset: 1024)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !13, file: !7, line: 663, baseType: !131, size: 64, offset: 1088)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !13, file: !7, line: 664, baseType: !33, size: 32, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !13, file: !7, line: 668, baseType: !131, size: 64, offset: 1216)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !13, file: !7, line: 669, baseType: !33, size: 32, offset: 1280)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !13, file: !7, line: 670, baseType: !33, size: 32, offset: 1312)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !9, file: !7, line: 256, baseType: !25, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !9, file: !7, line: 256, baseType: !97, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !9, file: !7, line: 256, baseType: !72, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !9, file: !7, line: 256, baseType: !33, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !9, file: !7, line: 259, baseType: !144, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !7, line: 688, size: 320, elements: !146)
!146 = !{!147, !150, !151, !155, !159}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !145, file: !7, line: 689, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !47, line: 110, baseType: !48)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !145, file: !7, line: 690, baseType: !34, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !145, file: !7, line: 692, baseType: !152, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !6}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !145, file: !7, line: 693, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!72, !6}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !145, file: !7, line: 694, baseType: !152, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !9, file: !7, line: 266, baseType: !49, size: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !9, file: !7, line: 267, baseType: !49, size: 32, offset: 352)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "input_components", scope: !9, file: !7, line: 268, baseType: !33, size: 32, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "in_color_space", scope: !9, file: !7, line: 269, baseType: !164, size: 32, offset: 416)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !7, line: 201, baseType: !165)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 194, baseType: !50, size: 32, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172}
!167 = !DIEnumerator(name: "JCS_UNKNOWN", value: 0)
!168 = !DIEnumerator(name: "JCS_GRAYSCALE", value: 1)
!169 = !DIEnumerator(name: "JCS_RGB", value: 2)
!170 = !DIEnumerator(name: "JCS_YCbCr", value: 3)
!171 = !DIEnumerator(name: "JCS_CMYK", value: 4)
!172 = !DIEnumerator(name: "JCS_YCCK", value: 5)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "input_gamma", scope: !9, file: !7, line: 271, baseType: !174, size: 64, offset: 448)
!174 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !9, file: !7, line: 281, baseType: !33, size: 32, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !9, file: !7, line: 283, baseType: !33, size: 32, offset: 544)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !9, file: !7, line: 284, baseType: !164, size: 32, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !9, file: !7, line: 286, baseType: !179, size: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !7, line: 179, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 116, size: 768, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !212}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !181, file: !7, line: 120, baseType: !33, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !181, file: !7, line: 121, baseType: !33, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !181, file: !7, line: 122, baseType: !33, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !181, file: !7, line: 123, baseType: !33, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !181, file: !7, line: 124, baseType: !33, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !181, file: !7, line: 129, baseType: !33, size: 32, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !181, file: !7, line: 130, baseType: !33, size: 32, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !181, file: !7, line: 139, baseType: !49, size: 32, offset: 224)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !181, file: !7, line: 140, baseType: !49, size: 32, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !181, file: !7, line: 147, baseType: !33, size: 32, offset: 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !181, file: !7, line: 154, baseType: !49, size: 32, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !181, file: !7, line: 155, baseType: !49, size: 32, offset: 352)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !181, file: !7, line: 160, baseType: !72, size: 32, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !181, file: !7, line: 164, baseType: !33, size: 32, offset: 416)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !181, file: !7, line: 165, baseType: !33, size: 32, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !181, file: !7, line: 166, baseType: !33, size: 32, offset: 480)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !181, file: !7, line: 167, baseType: !33, size: 32, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !181, file: !7, line: 168, baseType: !33, size: 32, offset: 544)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !181, file: !7, line: 169, baseType: !33, size: 32, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !181, file: !7, line: 175, baseType: !203, size: 64, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !7, line: 95, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 83, size: 1056, elements: !206)
!206 = !{!207, !211}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !205, file: !7, line: 88, baseType: !208, size: 1024)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 1024, elements: !63)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !47, line: 147, baseType: !210)
!210 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !205, file: !7, line: 94, baseType: !72, size: 32, offset: 1024)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !181, file: !7, line: 178, baseType: !32, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !9, file: !7, line: 289, baseType: !214, size: 256, offset: 704)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 256, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 4)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !9, file: !7, line: 292, baseType: !218, size: 256, offset: 960)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 256, elements: !215)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !7, line: 111, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 100, size: 2240, elements: !222)
!222 = !{!223, !228, !232}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !221, file: !7, line: 102, baseType: !224, size: 136)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 136, elements: !226)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !47, line: 135, baseType: !48)
!226 = !{!227}
!227 = !DISubrange(count: 17)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !221, file: !7, line: 104, baseType: !229, size: 2048, offset: 136)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 2048, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !221, file: !7, line: 110, baseType: !72, size: 32, offset: 2208)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !9, file: !7, line: 293, baseType: !218, size: 256, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !9, file: !7, line: 296, baseType: !235, size: 128, offset: 1472)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 128, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !9, file: !7, line: 297, baseType: !235, size: 128, offset: 1600)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !9, file: !7, line: 298, baseType: !235, size: 128, offset: 1728)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num_scans", scope: !9, file: !7, line: 300, baseType: !33, size: 32, offset: 1856)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "scan_info", scope: !9, file: !7, line: 301, baseType: !242, size: 64, offset: 1920)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_scan_info", file: !7, line: 189, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 184, size: 288, elements: !246)
!246 = !{!247, !248, !250, !251, !252, !253}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !245, file: !7, line: 185, baseType: !33, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !245, file: !7, line: 186, baseType: !249, size: 128, offset: 32)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, elements: !215)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !245, file: !7, line: 187, baseType: !33, size: 32, offset: 160)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !245, file: !7, line: 187, baseType: !33, size: 32, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !245, file: !7, line: 188, baseType: !33, size: 32, offset: 224)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !245, file: !7, line: 188, baseType: !33, size: 32, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_in", scope: !9, file: !7, line: 307, baseType: !72, size: 32, offset: 1984)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !9, file: !7, line: 308, baseType: !72, size: 32, offset: 2016)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_coding", scope: !9, file: !7, line: 309, baseType: !72, size: 32, offset: 2048)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !9, file: !7, line: 310, baseType: !72, size: 32, offset: 2080)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "smoothing_factor", scope: !9, file: !7, line: 311, baseType: !33, size: 32, offset: 2112)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !9, file: !7, line: 312, baseType: !260, size: 32, offset: 2144)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !7, line: 209, baseType: !261)
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 205, baseType: !50, size: 32, elements: !262)
!262 = !{!263, !264, !265}
!263 = !DIEnumerator(name: "JDCT_ISLOW", value: 0)
!264 = !DIEnumerator(name: "JDCT_IFAST", value: 1)
!265 = !DIEnumerator(name: "JDCT_FLOAT", value: 2)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !9, file: !7, line: 319, baseType: !50, size: 32, offset: 2176)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "restart_in_rows", scope: !9, file: !7, line: 320, baseType: !33, size: 32, offset: 2208)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "write_JFIF_header", scope: !9, file: !7, line: 324, baseType: !72, size: 32, offset: 2240)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !9, file: !7, line: 329, baseType: !225, size: 8, offset: 2272)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !9, file: !7, line: 330, baseType: !209, size: 16, offset: 2288)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !9, file: !7, line: 331, baseType: !209, size: 16, offset: 2304)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "write_Adobe_marker", scope: !9, file: !7, line: 332, baseType: !72, size: 32, offset: 2336)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next_scanline", scope: !9, file: !7, line: 339, baseType: !49, size: 32, offset: 2368)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !9, file: !7, line: 348, baseType: !72, size: 32, offset: 2400)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !9, file: !7, line: 349, baseType: !33, size: 32, offset: 2432)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !9, file: !7, line: 350, baseType: !33, size: 32, offset: 2464)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !9, file: !7, line: 352, baseType: !49, size: 32, offset: 2496)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !9, file: !7, line: 363, baseType: !33, size: 32, offset: 2528)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !9, file: !7, line: 364, baseType: !280, size: 256, offset: 2560)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 256, elements: !215)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !9, file: !7, line: 367, baseType: !49, size: 32, offset: 2816)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !9, file: !7, line: 368, baseType: !49, size: 32, offset: 2848)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !9, file: !7, line: 370, baseType: !33, size: 32, offset: 2880)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !9, file: !7, line: 371, baseType: !285, size: 320, offset: 2912)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 320, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 10)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !9, file: !7, line: 375, baseType: !33, size: 32, offset: 3232)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !9, file: !7, line: 375, baseType: !33, size: 32, offset: 3264)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !9, file: !7, line: 375, baseType: !33, size: 32, offset: 3296)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !9, file: !7, line: 375, baseType: !33, size: 32, offset: 3328)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !9, file: !7, line: 380, baseType: !293, size: 64, offset: 3392)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_comp_master", file: !295, line: 45, size: 256, elements: !296)
!295 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpegint.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "87e9869e13f29b8e74a9dee50528c6c5")
!296 = !{!297, !298, !299, !300, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_pass", scope: !294, file: !295, line: 46, baseType: !152, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pass_startup", scope: !294, file: !295, line: 47, baseType: !152, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !294, file: !295, line: 48, baseType: !152, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "call_pass_startup", scope: !294, file: !295, line: 51, baseType: !72, size: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "is_last_pass", scope: !294, file: !295, line: 52, baseType: !72, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !9, file: !7, line: 381, baseType: !303, size: 64, offset: 3456)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_main_controller", file: !295, line: 56, size: 128, elements: !305)
!305 = !{!306, !317}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !304, file: !295, line: 57, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !6, !310}
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !295, line: 22, baseType: !311)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 16, baseType: !50, size: 32, elements: !312)
!312 = !{!313, !314, !315, !316}
!313 = !DIEnumerator(name: "JBUF_PASS_THRU", value: 0)
!314 = !DIEnumerator(name: "JBUF_SAVE_SOURCE", value: 1)
!315 = !DIEnumerator(name: "JBUF_CRANK_DEST", value: 2)
!316 = !DIEnumerator(name: "JBUF_SAVE_AND_PASS", value: 3)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !304, file: !295, line: 58, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !6, !42, !321, !49}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prep", scope: !9, file: !7, line: 382, baseType: !323, size: 64, offset: 3520)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_prep_controller", file: !295, line: 64, size: 128, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !324, file: !295, line: 65, baseType: !307, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pre_process_data", scope: !324, file: !295, line: 66, baseType: !328, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !6, !42, !321, !49, !331, !321, !49}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !7, line: 68, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !9, file: !7, line: 383, baseType: !334, size: 64, offset: 3584)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_coef_controller", file: !295, line: 76, size: 128, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !335, file: !295, line: 77, baseType: !307, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "compress_data", scope: !335, file: !295, line: 78, baseType: !339, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!72, !6, !331}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !9, file: !7, line: 384, baseType: !343, size: 64, offset: 3648)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_writer", file: !295, line: 120, size: 384, elements: !345)
!345 = !{!346, !352, !353, !354, !355, !356}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "write_any_marker", scope: !344, file: !295, line: 123, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !6, !33, !350, !50}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_header", scope: !344, file: !295, line: 125, baseType: !152, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame_header", scope: !344, file: !295, line: 126, baseType: !152, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "write_scan_header", scope: !344, file: !295, line: 127, baseType: !152, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_trailer", scope: !344, file: !295, line: 128, baseType: !152, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "write_tables_only", scope: !344, file: !295, line: 129, baseType: !152, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !9, file: !7, line: 385, baseType: !358, size: 64, offset: 3712)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_converter", file: !295, line: 83, size: 128, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !359, file: !295, line: 84, baseType: !152, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !359, file: !295, line: 85, baseType: !363, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !6, !42, !331, !49, !33}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !9, file: !7, line: 386, baseType: !367, size: 64, offset: 3776)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_downsampler", file: !295, line: 91, size: 192, elements: !369)
!369 = !{!370, !371, !375}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !368, file: !295, line: 92, baseType: !152, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !368, file: !295, line: 93, baseType: !372, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !6, !331, !49, !331, !49}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !368, file: !295, line: 98, baseType: !72, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !9, file: !7, line: 387, baseType: !377, size: 64, offset: 3840)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_forward_dct", file: !295, line: 102, size: 128, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !378, file: !295, line: 103, baseType: !152, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "forward_DCT", scope: !378, file: !295, line: 105, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !6, !179, !42, !57, !49, !49, !49}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !9, file: !7, line: 388, baseType: !386, size: 64, offset: 3904)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_encoder", file: !295, line: 113, size: 192, elements: !388)
!388 = !{!389, !393, !397}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !387, file: !295, line: 114, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !6, !72}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "encode_mcu", scope: !387, file: !295, line: 115, baseType: !394, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!72, !6, !56}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !387, file: !295, line: 116, baseType: !152, size: 64, offset: 128)
!398 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !399, retainedTypes: !524, globals: !528, splitDebugInlining: false, nameTableKind: None)
!399 = !{!165, !261, !311, !400}
!400 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !401, line: 33, baseType: !50, size: 32, elements: !402)
!401 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jerror.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "a232f2460ff0049c960896e323d8710b")
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!403 = !DIEnumerator(name: "JMSG_NOMESSAGE", value: 0)
!404 = !DIEnumerator(name: "JERR_ARITH_NOTIMPL", value: 1)
!405 = !DIEnumerator(name: "JERR_BAD_ALIGN_TYPE", value: 2)
!406 = !DIEnumerator(name: "JERR_BAD_ALLOC_CHUNK", value: 3)
!407 = !DIEnumerator(name: "JERR_BAD_BUFFER_MODE", value: 4)
!408 = !DIEnumerator(name: "JERR_BAD_COMPONENT_ID", value: 5)
!409 = !DIEnumerator(name: "JERR_BAD_DCTSIZE", value: 6)
!410 = !DIEnumerator(name: "JERR_BAD_IN_COLORSPACE", value: 7)
!411 = !DIEnumerator(name: "JERR_BAD_J_COLORSPACE", value: 8)
!412 = !DIEnumerator(name: "JERR_BAD_LENGTH", value: 9)
!413 = !DIEnumerator(name: "JERR_BAD_LIB_VERSION", value: 10)
!414 = !DIEnumerator(name: "JERR_BAD_MCU_SIZE", value: 11)
!415 = !DIEnumerator(name: "JERR_BAD_POOL_ID", value: 12)
!416 = !DIEnumerator(name: "JERR_BAD_PRECISION", value: 13)
!417 = !DIEnumerator(name: "JERR_BAD_PROGRESSION", value: 14)
!418 = !DIEnumerator(name: "JERR_BAD_PROG_SCRIPT", value: 15)
!419 = !DIEnumerator(name: "JERR_BAD_SAMPLING", value: 16)
!420 = !DIEnumerator(name: "JERR_BAD_SCAN_SCRIPT", value: 17)
!421 = !DIEnumerator(name: "JERR_BAD_STATE", value: 18)
!422 = !DIEnumerator(name: "JERR_BAD_STRUCT_SIZE", value: 19)
!423 = !DIEnumerator(name: "JERR_BAD_VIRTUAL_ACCESS", value: 20)
!424 = !DIEnumerator(name: "JERR_BUFFER_SIZE", value: 21)
!425 = !DIEnumerator(name: "JERR_CANT_SUSPEND", value: 22)
!426 = !DIEnumerator(name: "JERR_CCIR601_NOTIMPL", value: 23)
!427 = !DIEnumerator(name: "JERR_COMPONENT_COUNT", value: 24)
!428 = !DIEnumerator(name: "JERR_CONVERSION_NOTIMPL", value: 25)
!429 = !DIEnumerator(name: "JERR_DAC_INDEX", value: 26)
!430 = !DIEnumerator(name: "JERR_DAC_VALUE", value: 27)
!431 = !DIEnumerator(name: "JERR_DHT_COUNTS", value: 28)
!432 = !DIEnumerator(name: "JERR_DHT_INDEX", value: 29)
!433 = !DIEnumerator(name: "JERR_DQT_INDEX", value: 30)
!434 = !DIEnumerator(name: "JERR_EMPTY_IMAGE", value: 31)
!435 = !DIEnumerator(name: "JERR_EMS_READ", value: 32)
!436 = !DIEnumerator(name: "JERR_EMS_WRITE", value: 33)
!437 = !DIEnumerator(name: "JERR_EOI_EXPECTED", value: 34)
!438 = !DIEnumerator(name: "JERR_FILE_READ", value: 35)
!439 = !DIEnumerator(name: "JERR_FILE_WRITE", value: 36)
!440 = !DIEnumerator(name: "JERR_FRACT_SAMPLE_NOTIMPL", value: 37)
!441 = !DIEnumerator(name: "JERR_HUFF_CLEN_OVERFLOW", value: 38)
!442 = !DIEnumerator(name: "JERR_HUFF_MISSING_CODE", value: 39)
!443 = !DIEnumerator(name: "JERR_IMAGE_TOO_BIG", value: 40)
