; ModuleID = 'cBench/consumer_jpeg_c/src/jctrans.c'
source_filename = "cBench/consumer_jpeg_c/src/jctrans.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_compress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, double, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], [16 x i8], [16 x i8], [16 x i8], i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.jpeg_destination_mgr = type { ptr, i64, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.jpeg_marker_writer = type { ptr, ptr, ptr, ptr, ptr, ptr }

!69 = !DIEnumerator(name: "JERR_INPUT_EMPTY", value: 41)
!70 = !DIEnumerator(name: "JERR_INPUT_EOF", value: 42)
!71 = !DIEnumerator(name: "JERR_MISMATCHED_QUANT_TABLE", value: 43)
!72 = !DIEnumerator(name: "JERR_MISSING_DATA", value: 44)
!73 = !DIEnumerator(name: "JERR_MODE_CHANGE", value: 45)
!74 = !DIEnumerator(name: "JERR_NOTIMPL", value: 46)
!75 = !DIEnumerator(name: "JERR_NOT_COMPILED", value: 47)
!76 = !DIEnumerator(name: "JERR_NO_BACKING_STORE", value: 48)
!77 = !DIEnumerator(name: "JERR_NO_HUFF_TABLE", value: 49)
!78 = !DIEnumerator(name: "JERR_NO_IMAGE", value: 50)
!79 = !DIEnumerator(name: "JERR_NO_QUANT_TABLE", value: 51)
!80 = !DIEnumerator(name: "JERR_NO_SOI", value: 52)
!81 = !DIEnumerator(name: "JERR_OUT_OF_MEMORY", value: 53)
!82 = !DIEnumerator(name: "JERR_QUANT_COMPONENTS", value: 54)
!83 = !DIEnumerator(name: "JERR_QUANT_FEW_COLORS", value: 55)
!84 = !DIEnumerator(name: "JERR_QUANT_MANY_COLORS", value: 56)
!85 = !DIEnumerator(name: "JERR_SOF_DUPLICATE", value: 57)
!86 = !DIEnumerator(name: "JERR_SOF_NO_SOS", value: 58)
!87 = !DIEnumerator(name: "JERR_SOF_UNSUPPORTED", value: 59)
!88 = !DIEnumerator(name: "JERR_SOI_DUPLICATE", value: 60)
!89 = !DIEnumerator(name: "JERR_SOS_NO_SOF", value: 61)
!90 = !DIEnumerator(name: "JERR_TFILE_CREATE", value: 62)
!91 = !DIEnumerator(name: "JERR_TFILE_READ", value: 63)
!92 = !DIEnumerator(name: "JERR_TFILE_SEEK", value: 64)
!93 = !DIEnumerator(name: "JERR_TFILE_WRITE", value: 65)
!94 = !DIEnumerator(name: "JERR_TOO_LITTLE_DATA", value: 66)
!95 = !DIEnumerator(name: "JERR_UNKNOWN_MARKER", value: 67)
!96 = !DIEnumerator(name: "JERR_VIRTUAL_BUG", value: 68)
!97 = !DIEnumerator(name: "JERR_WIDTH_OVERFLOW", value: 69)
!98 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!99 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!100 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!101 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!102 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!103 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!104 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!105 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!106 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!107 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!108 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!109 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!110 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!111 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!112 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!113 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!114 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!115 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!116 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!117 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!118 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!119 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!120 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!121 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!122 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!123 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!124 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!125 = !DIEnumerator(name: "JTRC_RST", value: 97)
!126 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!127 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!128 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!129 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!130 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!131 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!132 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!133 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!134 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!135 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!136 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!137 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!138 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!139 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!140 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!141 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!142 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!143 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!144 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!145 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!146 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!147 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!148 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 220, baseType: !5, size: 32, elements: !150)
!150 = !{!151, !152, !153}
!151 = !DIEnumerator(name: "JDITHER_NONE", value: 0)
!152 = !DIEnumerator(name: "JDITHER_ORDERED", value: 1)
!153 = !DIEnumerator(name: "JDITHER_FS", value: 2)
!154 = !{!155, !212, !281, !213, !283, !471, !235, !228}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !158)
!158 = !{!159, !204, !270, !279, !280}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !157, file: !4, line: 241, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !162)
!162 = !{!163, !167, !172, !173, !179, !180, !181, !192, !193, !195, !200, !201, !202, !203}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !161, file: !4, line: 620, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !155}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !161, file: !4, line: 622, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !155, !171}
!171 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !161, file: !4, line: 624, baseType: !164, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !161, file: !4, line: 626, baseType: !174, size: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !155, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !161, file: !4, line: 629, baseType: !164, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !161, file: !4, line: 634, baseType: !171, size: 32, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !161, file: !4, line: 639, baseType: !182, size: 640, offset: 352)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !4, line: 636, size: 640, elements: !183)
!183 = !{!184, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !182, file: !4, line: 637, baseType: !185, size: 256)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 256, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !182, file: !4, line: 638, baseType: !189, size: 640)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 640, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 80)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !161, file: !4, line: 643, baseType: !171, size: 32, offset: 992)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !161, file: !4, line: 651, baseType: !194, size: 64, offset: 1024)
!194 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !161, file: !4, line: 663, baseType: !196, size: 64, offset: 1088)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !161, file: !4, line: 664, baseType: !171, size: 32, offset: 1152)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !161, file: !4, line: 668, baseType: !196, size: 64, offset: 1216)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !161, file: !4, line: 669, baseType: !171, size: 32, offset: 1280)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !161, file: !4, line: 670, baseType: !171, size: 32, offset: 1312)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !157, file: !4, line: 241, baseType: !205, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !207)
!207 = !{!208, !216, !217, !229, !243, !251, !258, !259, !263, !267, !268, !269}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !206, file: !4, line: 733, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!212, !155, !171, !213}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !214, line: 18, baseType: !215)
!214 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!215 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !206, file: !4, line: 735, baseType: !209, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !206, file: !4, line: 737, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!221, !155, !171, !228, !228}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !226, line: 59, baseType: !227)
!226 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!227 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !226, line: 171, baseType: !5)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !206, file: !4, line: 740, baseType: !230, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !155, !171, !228, !228}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 1024, elements: !241)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !226, line: 99, baseType: !240)
!240 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!241 = !{!242}
!242 = !DISubrange(count: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !206, file: !4, line: 743, baseType: !244, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !155, !171, !250, !228, !228, !228}
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !226, line: 227, baseType: !171)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !206, file: !4, line: 749, baseType: !252, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!255, !155, !171, !250, !228, !228, !228}
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !206, file: !4, line: 755, baseType: !164, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !206, file: !4, line: 756, baseType: !260, size: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!221, !155, !247, !228, !228, !250}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !206, file: !4, line: 761, baseType: !264, size: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!233, !155, !255, !228, !228, !250}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !206, file: !4, line: 766, baseType: !168, size: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !206, file: !4, line: 767, baseType: !164, size: 64, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !206, file: !4, line: 774, baseType: !194, size: 64, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !157, file: !4, line: 241, baseType: !271, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !273)
!273 = !{!274, !275, !276, !277, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !272, file: !4, line: 677, baseType: !164, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !272, file: !4, line: 679, baseType: !194, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !272, file: !4, line: 680, baseType: !194, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !272, file: !4, line: 681, baseType: !171, size: 32, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !272, file: !4, line: 682, baseType: !171, size: 32, offset: 224)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !157, file: !4, line: 241, baseType: !250, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !157, file: !4, line: 241, baseType: !171, size: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_coef_ptr", file: !1, line: 206, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_coef_controller", file: !1, line: 204, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 191, size: 960, elements: !287)
!287 = !{!288, !533, !534, !535, !536, !537, !539}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !286, file: !1, line: 192, baseType: !289, size: 128)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_coef_controller", file: !19, line: 76, size: 128, elements: !290)
!290 = !{!291, !529}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !289, file: !19, line: 77, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !295, !528}
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_compress_ptr", file: !4, line: 249, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !4, line: 255, size: 3968, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !321, !322, !323, !324, !326, !328, !329, !330, !331, !366, !370, !386, !387, !391, !392, !393, !394, !407, !408, !409, !410, !411, !412, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !429, !430, !431, !432, !436, !437, !438, !439, !440, !449, !459, !470, !472, !487, !496, !506, !515}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !297, file: !4, line: 256, baseType: !160, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !297, file: !4, line: 256, baseType: !205, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !297, file: !4, line: 256, baseType: !271, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !297, file: !4, line: 256, baseType: !250, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !297, file: !4, line: 256, baseType: !171, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !297, file: !4, line: 259, baseType: !305, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !4, line: 688, size: 320, elements: !307)
!307 = !{!308, !311, !312, !316, !320}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !306, file: !4, line: 689, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !226, line: 110, baseType: !227)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !306, file: !4, line: 690, baseType: !213, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !306, file: !4, line: 692, baseType: !313, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !295}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !306, file: !4, line: 693, baseType: !317, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!250, !295}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !306, file: !4, line: 694, baseType: !313, size: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !297, file: !4, line: 266, baseType: !228, size: 32, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !297, file: !4, line: 267, baseType: !228, size: 32, offset: 352)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "input_components", scope: !297, file: !4, line: 268, baseType: !171, size: 32, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "in_color_space", scope: !297, file: !4, line: 269, baseType: !325, size: 32, offset: 416)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "input_gamma", scope: !297, file: !4, line: 271, baseType: !327, size: 64, offset: 448)
!327 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !297, file: !4, line: 281, baseType: !171, size: 32, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !297, file: !4, line: 283, baseType: !171, size: 32, offset: 544)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !297, file: !4, line: 284, baseType: !325, size: 32, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !297, file: !4, line: 286, baseType: !332, size: 64, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !365}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !334, file: !4, line: 120, baseType: !171, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !334, file: !4, line: 121, baseType: !171, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !334, file: !4, line: 122, baseType: !171, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !334, file: !4, line: 123, baseType: !171, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !334, file: !4, line: 124, baseType: !171, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !334, file: !4, line: 129, baseType: !171, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !334, file: !4, line: 130, baseType: !171, size: 32, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !334, file: !4, line: 139, baseType: !228, size: 32, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !334, file: !4, line: 140, baseType: !228, size: 32, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !334, file: !4, line: 147, baseType: !171, size: 32, offset: 288)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !334, file: !4, line: 154, baseType: !228, size: 32, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !334, file: !4, line: 155, baseType: !228, size: 32, offset: 352)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !334, file: !4, line: 160, baseType: !250, size: 32, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !334, file: !4, line: 164, baseType: !171, size: 32, offset: 416)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !334, file: !4, line: 165, baseType: !171, size: 32, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !334, file: !4, line: 166, baseType: !171, size: 32, offset: 480)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !334, file: !4, line: 167, baseType: !171, size: 32, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !334, file: !4, line: 168, baseType: !171, size: 32, offset: 544)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !334, file: !4, line: 169, baseType: !171, size: 32, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !334, file: !4, line: 175, baseType: !356, size: 64, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !359)
!359 = !{!360, !364}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !358, file: !4, line: 88, baseType: !361, size: 1024)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 1024, elements: !241)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !226, line: 147, baseType: !363)
!363 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !358, file: !4, line: 94, baseType: !250, size: 32, offset: 1024)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !334, file: !4, line: 178, baseType: !212, size: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !297, file: !4, line: 289, baseType: !367, size: 256, offset: 704)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 256, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 4)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !297, file: !4, line: 292, baseType: !371, size: 256, offset: 960)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 256, elements: !368)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !375)
!375 = !{!376, !381, !385}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !374, file: !4, line: 102, baseType: !377, size: 136)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 136, elements: !379)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !226, line: 135, baseType: !227)
!379 = !{!380}
!380 = !DISubrange(count: 17)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !374, file: !4, line: 104, baseType: !382, size: 2048, offset: 136)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 2048, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !374, file: !4, line: 110, baseType: !250, size: 32, offset: 2208)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !297, file: !4, line: 293, baseType: !371, size: 256, offset: 1216)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !297, file: !4, line: 296, baseType: !388, size: 128, offset: 1472)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 128, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 16)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !297, file: !4, line: 297, baseType: !388, size: 128, offset: 1600)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !297, file: !4, line: 298, baseType: !388, size: 128, offset: 1728)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "num_scans", scope: !297, file: !4, line: 300, baseType: !171, size: 32, offset: 1856)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "scan_info", scope: !297, file: !4, line: 301, baseType: !395, size: 64, offset: 1920)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_scan_info", file: !4, line: 189, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 184, size: 288, elements: !399)
!399 = !{!400, !401, !403, !404, !405, !406}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !398, file: !4, line: 185, baseType: !171, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !398, file: !4, line: 186, baseType: !402, size: 128, offset: 32)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 128, elements: !368)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !398, file: !4, line: 187, baseType: !171, size: 32, offset: 160)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !398, file: !4, line: 187, baseType: !171, size: 32, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !398, file: !4, line: 188, baseType: !171, size: 32, offset: 224)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !398, file: !4, line: 188, baseType: !171, size: 32, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_in", scope: !297, file: !4, line: 307, baseType: !250, size: 32, offset: 1984)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !297, file: !4, line: 308, baseType: !250, size: 32, offset: 2016)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_coding", scope: !297, file: !4, line: 309, baseType: !250, size: 32, offset: 2048)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !297, file: !4, line: 310, baseType: !250, size: 32, offset: 2080)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "smoothing_factor", scope: !297, file: !4, line: 311, baseType: !171, size: 32, offset: 2112)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !297, file: !4, line: 312, baseType: !413, size: 32, offset: 2144)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !297, file: !4, line: 319, baseType: !5, size: 32, offset: 2176)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "restart_in_rows", scope: !297, file: !4, line: 320, baseType: !171, size: 32, offset: 2208)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "write_JFIF_header", scope: !297, file: !4, line: 324, baseType: !250, size: 32, offset: 2240)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !297, file: !4, line: 329, baseType: !378, size: 8, offset: 2272)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !297, file: !4, line: 330, baseType: !362, size: 16, offset: 2288)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !297, file: !4, line: 331, baseType: !362, size: 16, offset: 2304)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "write_Adobe_marker", scope: !297, file: !4, line: 332, baseType: !250, size: 32, offset: 2336)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next_scanline", scope: !297, file: !4, line: 339, baseType: !228, size: 32, offset: 2368)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !297, file: !4, line: 348, baseType: !250, size: 32, offset: 2400)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !297, file: !4, line: 349, baseType: !171, size: 32, offset: 2432)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !297, file: !4, line: 350, baseType: !171, size: 32, offset: 2464)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !297, file: !4, line: 352, baseType: !228, size: 32, offset: 2496)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !297, file: !4, line: 363, baseType: !171, size: 32, offset: 2528)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !297, file: !4, line: 364, baseType: !428, size: 256, offset: 2560)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 256, elements: !368)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !297, file: !4, line: 367, baseType: !228, size: 32, offset: 2816)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !297, file: !4, line: 368, baseType: !228, size: 32, offset: 2848)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !297, file: !4, line: 370, baseType: !171, size: 32, offset: 2880)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !297, file: !4, line: 371, baseType: !433, size: 320, offset: 2912)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 320, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 10)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !297, file: !4, line: 375, baseType: !171, size: 32, offset: 3232)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !297, file: !4, line: 375, baseType: !171, size: 32, offset: 3264)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !297, file: !4, line: 375, baseType: !171, size: 32, offset: 3296)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !297, file: !4, line: 375, baseType: !171, size: 32, offset: 3328)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !297, file: !4, line: 380, baseType: !441, size: 64, offset: 3392)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_comp_master", file: !19, line: 45, size: 256, elements: !443)
!443 = !{!444, !445, !446, !447, !448}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_pass", scope: !442, file: !19, line: 46, baseType: !313, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pass_startup", scope: !442, file: !19, line: 47, baseType: !313, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !442, file: !19, line: 48, baseType: !313, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "call_pass_startup", scope: !442, file: !19, line: 51, baseType: !250, size: 32, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "is_last_pass", scope: !442, file: !19, line: 52, baseType: !250, size: 32, offset: 224)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !297, file: !4, line: 381, baseType: !450, size: 64, offset: 3456)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_main_controller", file: !19, line: 56, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !451, file: !19, line: 57, baseType: !292, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !451, file: !19, line: 58, baseType: !455, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !295, !221, !458, !228}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "prep", scope: !297, file: !4, line: 382, baseType: !460, size: 64, offset: 3520)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_prep_controller", file: !19, line: 64, size: 128, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !461, file: !19, line: 65, baseType: !292, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pre_process_data", scope: !461, file: !19, line: 66, baseType: !465, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !295, !221, !458, !228, !468, !458, !228}
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !4, line: 68, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !297, file: !4, line: 383, baseType: !471, size: 64, offset: 3584)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !297, file: !4, line: 384, baseType: !473, size: 64, offset: 3648)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_writer", file: !19, line: 120, size: 384, elements: !475)
!475 = !{!476, !482, !483, !484, !485, !486}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "write_any_marker", scope: !474, file: !19, line: 123, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !295, !171, !480, !5}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_header", scope: !474, file: !19, line: 125, baseType: !313, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame_header", scope: !474, file: !19, line: 126, baseType: !313, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "write_scan_header", scope: !474, file: !19, line: 127, baseType: !313, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "write_file_trailer", scope: !474, file: !19, line: 128, baseType: !313, size: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "write_tables_only", scope: !474, file: !19, line: 129, baseType: !313, size: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !297, file: !4, line: 385, baseType: !488, size: 64, offset: 3712)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_converter", file: !19, line: 83, size: 128, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !489, file: !19, line: 84, baseType: !313, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !489, file: !19, line: 85, baseType: !493, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !295, !221, !468, !228, !171}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !297, file: !4, line: 386, baseType: !497, size: 64, offset: 3776)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_downsampler", file: !19, line: 91, size: 192, elements: !499)
!499 = !{!500, !501, !505}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !498, file: !19, line: 92, baseType: !313, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !498, file: !19, line: 93, baseType: !502, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !295, !468, !228, !468, !228}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !498, file: !19, line: 98, baseType: !250, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !297, file: !4, line: 387, baseType: !507, size: 64, offset: 3840)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_forward_dct", file: !19, line: 102, size: 128, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !508, file: !19, line: 103, baseType: !313, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "forward_DCT", scope: !508, file: !19, line: 105, baseType: !512, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !295, !332, !221, !235, !228, !228, !228}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !297, file: !4, line: 388, baseType: !516, size: 64, offset: 3904)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_encoder", file: !19, line: 113, size: 192, elements: !518)
!518 = !{!519, !523, !527}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !517, file: !19, line: 114, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !295, !250}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "encode_mcu", scope: !517, file: !19, line: 115, baseType: !524, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!250, !295, !234}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !517, file: !19, line: 116, baseType: !313, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !19, line: 22, baseType: !18)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "compress_data", scope: !289, file: !19, line: 78, baseType: !530, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!250, !295, !468}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "iMCU_row_num", scope: !286, file: !1, line: 194, baseType: !228, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mcu_ctr", scope: !286, file: !1, line: 195, baseType: !228, size: 32, offset: 160)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_vert_offset", scope: !286, file: !1, line: 196, baseType: !171, size: 32, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_per_iMCU_row", scope: !286, file: !1, line: 197, baseType: !171, size: 32, offset: 224)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "whole_image", scope: !286, file: !1, line: 200, baseType: !538, size: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_buffer", scope: !286, file: !1, line: 203, baseType: !540, size: 640, offset: 320)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 640, elements: !434)
!541 = !{i32 7, !"Dwarf Version", i32 5}
!542 = !{i32 2, !"Debug Info Version", i32 3}
!543 = !{i32 1, !"wchar_size", i32 4}
!544 = !{i32 8, !"PIC Level", i32 2}
!545 = !{i32 7, !"PIE Level", i32 2}
!546 = !{i32 7, !"uwtable", i32 2}
!547 = !{i32 7, !"frame-pointer", i32 2}
!548 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!549 = distinct !DISubprogram(name: "jpeg_write_coefficients", scope: !1, file: !1, line: 38, type: !550, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !295, !538}
!552 = !{}
!553 = !DILocalVariable(name: "cinfo", arg: 1, scope: !549, file: !1, line: 38, type: !295)
!554 = !DILocation(line: 38, column: 41, scope: !549)
!555 = !DILocalVariable(name: "coef_arrays", arg: 2, scope: !549, file: !1, line: 38, type: !538)
!556 = !DILocation(line: 38, column: 67, scope: !549)
!557 = !DILocation(line: 40, column: 7, scope: !558)
!558 = distinct !DILexicalBlock(scope: !549, file: !1, line: 40, column: 7)
!559 = !DILocation(line: 40, column: 14, scope: !558)
!560 = !DILocation(line: 40, column: 27, scope: !558)
!561 = !DILocation(line: 41, column: 5, scope: !558)
!562 = !DILocation(line: 43, column: 24, scope: !549)
!563 = !DILocation(line: 43, column: 3, scope: !549)
!564 = !DILocation(line: 45, column: 5, scope: !549)
!565 = !DILocation(line: 45, column: 12, scope: !549)
!566 = !DILocation(line: 45, column: 17, scope: !549)
!567 = !DILocation(line: 45, column: 50, scope: !549)
!568 = !DILocation(line: 45, column: 3, scope: !549)
!569 = !DILocation(line: 46, column: 5, scope: !549)
!570 = !DILocation(line: 46, column: 12, scope: !549)
!571 = !DILocation(line: 46, column: 18, scope: !549)
!572 = !DILocation(line: 46, column: 37, scope: !549)
!573 = !DILocation(line: 46, column: 3, scope: !549)
!574 = !DILocation(line: 48, column: 32, scope: !549)
!575 = !DILocation(line: 48, column: 39, scope: !549)
!576 = !DILocation(line: 48, column: 3, scope: !549)
!577 = !DILocation(line: 50, column: 3, scope: !549)
!578 = !DILocation(line: 50, column: 10, scope: !549)
!579 = !DILocation(line: 50, column: 24, scope: !549)
!580 = !DILocation(line: 51, column: 3, scope: !549)
!581 = !DILocation(line: 51, column: 10, scope: !549)
!582 = !DILocation(line: 51, column: 23, scope: !549)
!583 = !DILocation(line: 52, column: 1, scope: !549)
!584 = distinct !DISubprogram(name: "transencode_master_selection", scope: !1, file: !1, line: 141, type: !550, scopeLine: 143, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !552)
!585 = !DILocalVariable(name: "cinfo", arg: 1, scope: !584, file: !1, line: 141, type: !295)
!586 = !DILocation(line: 141, column: 46, scope: !584)
!587 = !DILocalVariable(name: "coef_arrays", arg: 2, scope: !584, file: !1, line: 142, type: !538)
!588 = !DILocation(line: 142, column: 29, scope: !584)
!589 = !DILocation(line: 147, column: 3, scope: !584)
!590 = !DILocation(line: 147, column: 10, scope: !584)
!591 = !DILocation(line: 147, column: 27, scope: !584)
!592 = !DILocation(line: 149, column: 26, scope: !584)
!593 = !DILocation(line: 149, column: 3, scope: !584)
!594 = !DILocation(line: 152, column: 7, scope: !595)
!595 = distinct !DILexicalBlock(scope: !584, file: !1, line: 152, column: 7)
!596 = !DILocation(line: 152, column: 14, scope: !595)
!597 = !DILocation(line: 153, column: 5, scope: !598)
!598 = distinct !DILexicalBlock(scope: !595, file: !1, line: 152, column: 26)
!599 = !DILocation(line: 154, column: 3, scope: !598)
!600 = !DILocation(line: 155, column: 9, scope: !601)
!601 = distinct !DILexicalBlock(scope: !602, file: !1, line: 155, column: 9)
!602 = distinct !DILexicalBlock(scope: !595, file: !1, line: 154, column: 10)
!603 = !DILocation(line: 155, column: 16, scope: !601)
!604 = !DILocation(line: 157, column: 27, scope: !605)
!605 = distinct !DILexicalBlock(scope: !601, file: !1, line: 155, column: 34)
!606 = !DILocation(line: 157, column: 7, scope: !605)
!607 = !DILocation(line: 161, column: 5, scope: !605)
!608 = !DILocation(line: 162, column: 26, scope: !601)
!609 = !DILocation(line: 162, column: 7, scope: !601)
!610 = !DILocation(line: 166, column: 31, scope: !584)
!611 = !DILocation(line: 166, column: 38, scope: !584)
!612 = !DILocation(line: 166, column: 3, scope: !584)
!613 = !DILocation(line: 168, column: 23, scope: !584)
!614 = !DILocation(line: 168, column: 3, scope: !584)
!615 = !DILocation(line: 171, column: 5, scope: !584)
!616 = !DILocation(line: 171, column: 12, scope: !584)
!617 = !DILocation(line: 171, column: 17, scope: !584)
!618 = !DILocation(line: 171, column: 54, scope: !584)
!619 = !DILocation(line: 171, column: 3, scope: !584)
!620 = !DILocation(line: 177, column: 5, scope: !584)
!621 = !DILocation(line: 177, column: 12, scope: !584)
!622 = !DILocation(line: 177, column: 20, scope: !584)
!623 = !DILocation(line: 177, column: 40, scope: !584)
!624 = !DILocation(line: 177, column: 3, scope: !584)
!625 = !DILocation(line: 178, column: 1, scope: !584)
!626 = distinct !DISubprogram(name: "jpeg_copy_critical_parameters", scope: !1, file: !1, line: 63, type: !627, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !552)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !629, !295}
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !4, line: 250, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !4, line: 394, size: 4928, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !738, !750, !765, !774, !784, !799, !808, !821, !828, !837}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !631, file: !4, line: 395, baseType: !160, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !631, file: !4, line: 395, baseType: !205, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !631, file: !4, line: 395, baseType: !271, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !631, file: !4, line: 395, baseType: !250, size: 32, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !631, file: !4, line: 395, baseType: !171, size: 32, offset: 224)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !631, file: !4, line: 398, baseType: !639, size: 64, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !4, line: 700, size: 448, elements: !641)
!641 = !{!642, !643, !644, !648, !652, !656, !660}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !640, file: !4, line: 701, baseType: !480, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !640, file: !4, line: 702, baseType: !213, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !640, file: !4, line: 704, baseType: !645, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !629}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !640, file: !4, line: 705, baseType: !649, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!250, !629}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !640, file: !4, line: 706, baseType: !653, size: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !629, !194}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !640, file: !4, line: 707, baseType: !657, size: 64, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!250, !629, !171}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !640, file: !4, line: 708, baseType: !645, size: 64, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !631, file: !4, line: 403, baseType: !228, size: 32, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !631, file: !4, line: 404, baseType: !228, size: 32, offset: 352)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !631, file: !4, line: 405, baseType: !171, size: 32, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !631, file: !4, line: 406, baseType: !325, size: 32, offset: 416)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !631, file: !4, line: 413, baseType: !325, size: 32, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !631, file: !4, line: 415, baseType: !5, size: 32, offset: 480)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !631, file: !4, line: 415, baseType: !5, size: 32, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !631, file: !4, line: 417, baseType: !327, size: 64, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !631, file: !4, line: 419, baseType: !250, size: 32, offset: 640)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !631, file: !4, line: 420, baseType: !250, size: 32, offset: 672)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !631, file: !4, line: 422, baseType: !413, size: 32, offset: 704)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !631, file: !4, line: 423, baseType: !250, size: 32, offset: 736)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !631, file: !4, line: 424, baseType: !250, size: 32, offset: 768)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !631, file: !4, line: 426, baseType: !250, size: 32, offset: 800)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !631, file: !4, line: 428, baseType: !676, size: 32, offset: 832)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !4, line: 224, baseType: !149)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !631, file: !4, line: 429, baseType: !250, size: 32, offset: 864)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !631, file: !4, line: 430, baseType: !171, size: 32, offset: 896)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !631, file: !4, line: 432, baseType: !250, size: 32, offset: 928)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !631, file: !4, line: 433, baseType: !250, size: 32, offset: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !631, file: !4, line: 434, baseType: !250, size: 32, offset: 992)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !631, file: !4, line: 442, baseType: !228, size: 32, offset: 1024)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !631, file: !4, line: 443, baseType: !228, size: 32, offset: 1056)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !631, file: !4, line: 444, baseType: !171, size: 32, offset: 1088)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !631, file: !4, line: 445, baseType: !171, size: 32, offset: 1120)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !631, file: !4, line: 449, baseType: !171, size: 32, offset: 1152)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !631, file: !4, line: 461, baseType: !171, size: 32, offset: 1184)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !631, file: !4, line: 462, baseType: !221, size: 64, offset: 1216)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !631, file: !4, line: 472, baseType: !228, size: 32, offset: 1280)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !631, file: !4, line: 477, baseType: !171, size: 32, offset: 1312)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !631, file: !4, line: 478, baseType: !228, size: 32, offset: 1344)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !631, file: !4, line: 484, baseType: !171, size: 32, offset: 1376)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !631, file: !4, line: 485, baseType: !228, size: 32, offset: 1408)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !631, file: !4, line: 494, baseType: !695, size: 64, offset: 1472)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 2048, elements: !241)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !631, file: !4, line: 505, baseType: !367, size: 256, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !631, file: !4, line: 508, baseType: !371, size: 256, offset: 1792)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !631, file: !4, line: 509, baseType: !371, size: 256, offset: 2048)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !631, file: !4, line: 516, baseType: !171, size: 32, offset: 2304)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !631, file: !4, line: 518, baseType: !332, size: 64, offset: 2368)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !631, file: !4, line: 521, baseType: !250, size: 32, offset: 2432)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !631, file: !4, line: 522, baseType: !250, size: 32, offset: 2464)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !631, file: !4, line: 524, baseType: !388, size: 128, offset: 2496)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !631, file: !4, line: 525, baseType: !388, size: 128, offset: 2624)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !631, file: !4, line: 526, baseType: !388, size: 128, offset: 2752)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !631, file: !4, line: 528, baseType: !5, size: 32, offset: 2880)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !631, file: !4, line: 533, baseType: !250, size: 32, offset: 2912)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !631, file: !4, line: 535, baseType: !378, size: 8, offset: 2944)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !631, file: !4, line: 536, baseType: !362, size: 16, offset: 2960)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !631, file: !4, line: 537, baseType: !362, size: 16, offset: 2976)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !631, file: !4, line: 538, baseType: !250, size: 32, offset: 3008)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !631, file: !4, line: 539, baseType: !378, size: 8, offset: 3040)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !631, file: !4, line: 541, baseType: !250, size: 32, offset: 3072)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !631, file: !4, line: 550, baseType: !171, size: 32, offset: 3104)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !631, file: !4, line: 551, baseType: !171, size: 32, offset: 3136)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !631, file: !4, line: 553, baseType: !171, size: 32, offset: 3168)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !631, file: !4, line: 555, baseType: !228, size: 32, offset: 3200)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !631, file: !4, line: 564, baseType: !224, size: 64, offset: 3264)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !631, file: !4, line: 571, baseType: !171, size: 32, offset: 3328)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !631, file: !4, line: 572, baseType: !428, size: 256, offset: 3392)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !631, file: !4, line: 575, baseType: !228, size: 32, offset: 3648)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !631, file: !4, line: 576, baseType: !228, size: 32, offset: 3680)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !631, file: !4, line: 578, baseType: !171, size: 32, offset: 3712)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !631, file: !4, line: 579, baseType: !433, size: 320, offset: 3744)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !631, file: !4, line: 583, baseType: !171, size: 32, offset: 4064)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !631, file: !4, line: 583, baseType: !171, size: 32, offset: 4096)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !631, file: !4, line: 583, baseType: !171, size: 32, offset: 4128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !631, file: !4, line: 583, baseType: !171, size: 32, offset: 4160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !631, file: !4, line: 589, baseType: !171, size: 32, offset: 4192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !631, file: !4, line: 594, baseType: !732, size: 64, offset: 4224)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !19, line: 136, size: 192, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_output_pass", scope: !733, file: !19, line: 137, baseType: !645, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output_pass", scope: !733, file: !19, line: 138, baseType: !645, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "is_dummy_pass", scope: !733, file: !19, line: 141, baseType: !250, size: 32, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !631, file: !4, line: 595, baseType: !739, size: 64, offset: 4288)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !19, line: 157, size: 128, elements: !741)
!741 = !{!742, !746}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !740, file: !19, line: 158, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !629, !528}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !740, file: !19, line: 159, baseType: !747, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !629, !221, !458, !228}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !631, file: !4, line: 596, baseType: !751, size: 64, offset: 4352)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !19, line: 165, size: 320, elements: !753)
!753 = !{!754, !755, !759, !760, !764}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !752, file: !19, line: 166, baseType: !645, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "consume_data", scope: !752, file: !19, line: 167, baseType: !756, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!171, !629}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "start_output_pass", scope: !752, file: !19, line: 168, baseType: !645, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "decompress_data", scope: !752, file: !19, line: 169, baseType: !761, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!171, !629, !468}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "coef_arrays", scope: !752, file: !19, line: 172, baseType: !538, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !631, file: !4, line: 597, baseType: !766, size: 64, offset: 4416)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !19, line: 176, size: 128, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !767, file: !19, line: 177, baseType: !743, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_data", scope: !767, file: !19, line: 178, baseType: !771, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !629, !468, !458, !228, !221, !458, !228}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !631, file: !4, line: 598, baseType: !775, size: 64, offset: 4480)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !19, line: 145, size: 320, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "consume_input", scope: !776, file: !19, line: 146, baseType: !756, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "reset_input_controller", scope: !776, file: !19, line: 147, baseType: !645, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !776, file: !19, line: 148, baseType: !645, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input_pass", scope: !776, file: !19, line: 149, baseType: !645, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "has_multiple_scans", scope: !776, file: !19, line: 152, baseType: !250, size: 32, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "eoi_reached", scope: !776, file: !19, line: 153, baseType: !250, size: 32, offset: 288)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !631, file: !4, line: 599, baseType: !785, size: 64, offset: 4544)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !19, line: 188, size: 1408, elements: !787)
!787 = !{!788, !789, !790, !792, !793, !795, !796, !797, !798}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "reset_marker_reader", scope: !786, file: !19, line: 189, baseType: !645, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "read_markers", scope: !786, file: !19, line: 194, baseType: !756, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "read_restart_marker", scope: !786, file: !19, line: 196, baseType: !791, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_marker_parser_method", file: !4, line: 781, baseType: !649)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "process_COM", scope: !786, file: !19, line: 198, baseType: !791, size: 64, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "process_APPn", scope: !786, file: !19, line: 199, baseType: !794, size: 1024, offset: 256)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 1024, elements: !389)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOI", scope: !786, file: !19, line: 204, baseType: !250, size: 32, offset: 1280)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOF", scope: !786, file: !19, line: 205, baseType: !250, size: 32, offset: 1312)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "next_restart_num", scope: !786, file: !19, line: 206, baseType: !171, size: 32, offset: 1344)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "discarded_bytes", scope: !786, file: !19, line: 207, baseType: !5, size: 32, offset: 1376)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !631, file: !4, line: 600, baseType: !800, size: 64, offset: 4608)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !19, line: 211, size: 128, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !801, file: !19, line: 212, baseType: !645, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mcu", scope: !801, file: !19, line: 213, baseType: !805, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!250, !629, !234}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !631, file: !4, line: 601, baseType: !809, size: 64, offset: 4672)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !19, line: 223, size: 704, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !810, file: !19, line: 224, baseType: !645, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_DCT", scope: !810, file: !19, line: 226, baseType: !814, size: 640, offset: 64)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 640, elements: !434)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "inverse_DCT_method_ptr", file: !19, line: 218, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !629, !332, !819, !221, !228}
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEFPTR", file: !4, line: 75, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !631, file: !4, line: 602, baseType: !822, size: 64, offset: 4736)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !19, line: 230, size: 192, elements: !824)
!824 = !{!825, !826, !827}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !823, file: !19, line: 231, baseType: !645, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !823, file: !19, line: 232, baseType: !771, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !823, file: !19, line: 240, baseType: !250, size: 32, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !631, file: !4, line: 603, baseType: !829, size: 64, offset: 4800)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !19, line: 244, size: 128, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !830, file: !19, line: 245, baseType: !645, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !830, file: !19, line: 246, baseType: !834, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !629, !468, !228, !221, !171}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !631, file: !4, line: 604, baseType: !838, size: 64, offset: 4864)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !19, line: 252, size: 256, elements: !840)
!840 = !{!841, !845, !849, !850}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !839, file: !19, line: 253, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !629, !250}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "color_quantize", scope: !839, file: !19, line: 254, baseType: !846, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !629, !221, !221, !171}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !839, file: !19, line: 257, baseType: !645, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "new_color_map", scope: !839, file: !19, line: 258, baseType: !645, size: 64, offset: 192)
!851 = !DILocalVariable(name: "srcinfo", arg: 1, scope: !626, file: !1, line: 63, type: !629)
!852 = !DILocation(line: 63, column: 49, scope: !626)
!853 = !DILocalVariable(name: "dstinfo", arg: 2, scope: !626, file: !1, line: 64, type: !295)
!854 = !DILocation(line: 64, column: 26, scope: !626)
!855 = !DILocalVariable(name: "qtblptr", scope: !626, file: !1, line: 66, type: !856)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!857 = !DILocation(line: 66, column: 17, scope: !626)
!858 = !DILocalVariable(name: "incomp", scope: !626, file: !1, line: 67, type: !332)
!859 = !DILocation(line: 67, column: 24, scope: !626)
!860 = !DILocalVariable(name: "outcomp", scope: !626, file: !1, line: 67, type: !332)
!861 = !DILocation(line: 67, column: 33, scope: !626)
!862 = !DILocalVariable(name: "c_quant", scope: !626, file: !1, line: 68, type: !356)
!863 = !DILocation(line: 68, column: 15, scope: !626)
!864 = !DILocalVariable(name: "slot_quant", scope: !626, file: !1, line: 68, type: !356)
!865 = !DILocation(line: 68, column: 25, scope: !626)
!866 = !DILocalVariable(name: "tblno", scope: !626, file: !1, line: 69, type: !171)
!867 = !DILocation(line: 69, column: 7, scope: !626)
!868 = !DILocalVariable(name: "ci", scope: !626, file: !1, line: 69, type: !171)
!869 = !DILocation(line: 69, column: 14, scope: !626)
!870 = !DILocalVariable(name: "coefi", scope: !626, file: !1, line: 69, type: !171)
!871 = !DILocation(line: 69, column: 18, scope: !626)
!872 = !DILocation(line: 72, column: 7, scope: !873)
!873 = distinct !DILexicalBlock(scope: !626, file: !1, line: 72, column: 7)
!874 = !DILocation(line: 72, column: 16, scope: !873)
!875 = !DILocation(line: 72, column: 29, scope: !873)
!876 = !DILocation(line: 73, column: 5, scope: !873)
!877 = !DILocation(line: 75, column: 26, scope: !626)
!878 = !DILocation(line: 75, column: 35, scope: !626)
!879 = !DILocation(line: 75, column: 3, scope: !626)
!880 = !DILocation(line: 75, column: 12, scope: !626)
!881 = !DILocation(line: 75, column: 24, scope: !626)
!882 = !DILocation(line: 76, column: 27, scope: !626)
!883 = !DILocation(line: 76, column: 36, scope: !626)
!884 = !DILocation(line: 76, column: 3, scope: !626)
!885 = !DILocation(line: 76, column: 12, scope: !626)
!886 = !DILocation(line: 76, column: 25, scope: !626)
!887 = !DILocation(line: 77, column: 31, scope: !626)
!888 = !DILocation(line: 77, column: 40, scope: !626)
!889 = !DILocation(line: 77, column: 3, scope: !626)
!890 = !DILocation(line: 77, column: 12, scope: !626)
!891 = !DILocation(line: 77, column: 29, scope: !626)
!892 = !DILocation(line: 78, column: 29, scope: !626)
!893 = !DILocation(line: 78, column: 38, scope: !626)
!894 = !DILocation(line: 78, column: 3, scope: !626)
!895 = !DILocation(line: 78, column: 12, scope: !626)
!896 = !DILocation(line: 78, column: 27, scope: !626)
!897 = !DILocation(line: 80, column: 21, scope: !626)
!898 = !DILocation(line: 80, column: 3, scope: !626)
!899 = !DILocation(line: 84, column: 23, scope: !626)
!900 = !DILocation(line: 84, column: 32, scope: !626)
!901 = !DILocation(line: 84, column: 41, scope: !626)
!902 = !DILocation(line: 84, column: 3, scope: !626)
!903 = !DILocation(line: 85, column: 29, scope: !626)
!904 = !DILocation(line: 85, column: 38, scope: !626)
!905 = !DILocation(line: 85, column: 3, scope: !626)
!906 = !DILocation(line: 85, column: 12, scope: !626)
!907 = !DILocation(line: 85, column: 27, scope: !626)
!908 = !DILocation(line: 86, column: 31, scope: !626)
!909 = !DILocation(line: 86, column: 40, scope: !626)
!910 = !DILocation(line: 86, column: 3, scope: !626)
!911 = !DILocation(line: 86, column: 12, scope: !626)
!912 = !DILocation(line: 86, column: 29, scope: !626)
!913 = !DILocation(line: 88, column: 14, scope: !914)
!914 = distinct !DILexicalBlock(scope: !626, file: !1, line: 88, column: 3)
