; ModuleID = 'cBench/consumer_jpeg_c/src/jdapistd.c'
source_filename = "cBench/consumer_jpeg_c/src/jdapistd.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_decompress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], i32, ptr, i32, i32, [16 x i8], [16 x i8], [16 x i8], i32, i32, i8, i16, i16, i32, i8, i32, i32, i32, i32, i32, ptr, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_input_controller = type { ptr, ptr, ptr, ptr, i32, i32 }
%struct.jpeg_progress_mgr = type { ptr, i64, i64, i32, i32 }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.jpeg_decomp_master = type { ptr, ptr, i32 }
%struct.jpeg_d_main_controller = type { ptr, ptr }
%struct.jpeg_d_coef_controller = type { ptr, ptr, ptr, ptr, ptr }

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @jpeg_start_decompress(ptr noundef %0) #0 !dbg !289 {
  %2 = alloca i32, align 4
  %3 = alloca ptr, align 8
  %4 = alloca i32, align 4
  store ptr %0, ptr %3, align 8

!70 = !DIEnumerator(name: "JERR_FRACT_SAMPLE_NOTIMPL", value: 37)
!71 = !DIEnumerator(name: "JERR_HUFF_CLEN_OVERFLOW", value: 38)
!72 = !DIEnumerator(name: "JERR_HUFF_MISSING_CODE", value: 39)
!73 = !DIEnumerator(name: "JERR_IMAGE_TOO_BIG", value: 40)
!74 = !DIEnumerator(name: "JERR_INPUT_EMPTY", value: 41)
!75 = !DIEnumerator(name: "JERR_INPUT_EOF", value: 42)
!76 = !DIEnumerator(name: "JERR_MISMATCHED_QUANT_TABLE", value: 43)
!77 = !DIEnumerator(name: "JERR_MISSING_DATA", value: 44)
!78 = !DIEnumerator(name: "JERR_MODE_CHANGE", value: 45)
!79 = !DIEnumerator(name: "JERR_NOTIMPL", value: 46)
!80 = !DIEnumerator(name: "JERR_NOT_COMPILED", value: 47)
!81 = !DIEnumerator(name: "JERR_NO_BACKING_STORE", value: 48)
!82 = !DIEnumerator(name: "JERR_NO_HUFF_TABLE", value: 49)
!83 = !DIEnumerator(name: "JERR_NO_IMAGE", value: 50)
!84 = !DIEnumerator(name: "JERR_NO_QUANT_TABLE", value: 51)
!85 = !DIEnumerator(name: "JERR_NO_SOI", value: 52)
!86 = !DIEnumerator(name: "JERR_OUT_OF_MEMORY", value: 53)
!87 = !DIEnumerator(name: "JERR_QUANT_COMPONENTS", value: 54)
!88 = !DIEnumerator(name: "JERR_QUANT_FEW_COLORS", value: 55)
!89 = !DIEnumerator(name: "JERR_QUANT_MANY_COLORS", value: 56)
!90 = !DIEnumerator(name: "JERR_SOF_DUPLICATE", value: 57)
!91 = !DIEnumerator(name: "JERR_SOF_NO_SOS", value: 58)
!92 = !DIEnumerator(name: "JERR_SOF_UNSUPPORTED", value: 59)
!93 = !DIEnumerator(name: "JERR_SOI_DUPLICATE", value: 60)
!94 = !DIEnumerator(name: "JERR_SOS_NO_SOF", value: 61)
!95 = !DIEnumerator(name: "JERR_TFILE_CREATE", value: 62)
!96 = !DIEnumerator(name: "JERR_TFILE_READ", value: 63)
!97 = !DIEnumerator(name: "JERR_TFILE_SEEK", value: 64)
!98 = !DIEnumerator(name: "JERR_TFILE_WRITE", value: 65)
!99 = !DIEnumerator(name: "JERR_TOO_LITTLE_DATA", value: 66)
!100 = !DIEnumerator(name: "JERR_UNKNOWN_MARKER", value: 67)
!101 = !DIEnumerator(name: "JERR_VIRTUAL_BUG", value: 68)
!102 = !DIEnumerator(name: "JERR_WIDTH_OVERFLOW", value: 69)
!103 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!104 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!105 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!106 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!107 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!108 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!109 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!110 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!111 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!112 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!113 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!114 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!115 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!116 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!117 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!118 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!119 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!120 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!121 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!122 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!123 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!124 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!125 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!126 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!127 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!128 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!129 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!130 = !DIEnumerator(name: "JTRC_RST", value: 97)
!131 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!132 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!133 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!134 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!135 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!136 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!137 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!138 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!139 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!140 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!141 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!142 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!143 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!144 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!145 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!146 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!147 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!148 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!149 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!150 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!151 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!152 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!153 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!154 = !{!155, !156, !195, !221, !228}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !159)
!159 = !{!160, !205, !270, !279, !280}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !158, file: !4, line: 241, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !163)
!163 = !{!164, !168, !173, !174, !180, !181, !182, !193, !194, !196, !201, !202, !203, !204}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !162, file: !4, line: 620, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !156}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !162, file: !4, line: 622, baseType: !169, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !156, !172}
!172 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !162, file: !4, line: 624, baseType: !165, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !162, file: !4, line: 626, baseType: !175, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !156, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !162, file: !4, line: 629, baseType: !165, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !162, file: !4, line: 634, baseType: !172, size: 32, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !162, file: !4, line: 639, baseType: !183, size: 640, offset: 352)
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !162, file: !4, line: 636, size: 640, elements: !184)
!184 = !{!185, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !183, file: !4, line: 637, baseType: !186, size: 256)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 256, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 8)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !183, file: !4, line: 638, baseType: !190, size: 640)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 640, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 80)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !162, file: !4, line: 643, baseType: !172, size: 32, offset: 992)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !162, file: !4, line: 651, baseType: !195, size: 64, offset: 1024)
!195 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !162, file: !4, line: 663, baseType: !197, size: 64, offset: 1088)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !162, file: !4, line: 664, baseType: !172, size: 32, offset: 1152)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !162, file: !4, line: 668, baseType: !197, size: 64, offset: 1216)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !162, file: !4, line: 669, baseType: !172, size: 32, offset: 1280)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !162, file: !4, line: 670, baseType: !172, size: 32, offset: 1312)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !158, file: !4, line: 241, baseType: !206, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !208)
!208 = !{!209, !216, !217, !229, !243, !251, !258, !259, !263, !267, !268, !269}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !207, file: !4, line: 733, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!155, !156, !172, !213}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !214, line: 18, baseType: !215)
!214 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!215 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !207, file: !4, line: 735, baseType: !210, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !207, file: !4, line: 737, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!221, !156, !172, !228, !228}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !226, line: 59, baseType: !227)
!226 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!227 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !226, line: 171, baseType: !5)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !207, file: !4, line: 740, baseType: !230, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !156, !172, !228, !228}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 1024, elements: !241)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !226, line: 99, baseType: !240)
!240 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!241 = !{!242}
!242 = !DISubrange(count: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !207, file: !4, line: 743, baseType: !244, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !156, !172, !250, !228, !228, !228}
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !226, line: 227, baseType: !172)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !207, file: !4, line: 749, baseType: !252, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!255, !156, !172, !250, !228, !228, !228}
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !207, file: !4, line: 755, baseType: !165, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !207, file: !4, line: 756, baseType: !260, size: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!221, !156, !247, !228, !228, !250}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !207, file: !4, line: 761, baseType: !264, size: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!233, !156, !255, !228, !228, !250}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !207, file: !4, line: 766, baseType: !169, size: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !207, file: !4, line: 767, baseType: !165, size: 64, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !207, file: !4, line: 774, baseType: !195, size: 64, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !158, file: !4, line: 241, baseType: !271, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !273)
!273 = !{!274, !275, !276, !277, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !272, file: !4, line: 677, baseType: !165, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !272, file: !4, line: 679, baseType: !195, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !272, file: !4, line: 680, baseType: !195, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !272, file: !4, line: 681, baseType: !172, size: 32, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !272, file: !4, line: 682, baseType: !172, size: 32, offset: 224)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !158, file: !4, line: 241, baseType: !250, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !158, file: !4, line: 241, baseType: !172, size: 32, offset: 224)
!281 = !{i32 7, !"Dwarf Version", i32 5}
!282 = !{i32 2, !"Debug Info Version", i32 3}
!283 = !{i32 1, !"wchar_size", i32 4}
!284 = !{i32 8, !"PIC Level", i32 2}
!285 = !{i32 7, !"PIE Level", i32 2}
!286 = !{i32 7, !"uwtable", i32 2}
!287 = !{i32 7, !"frame-pointer", i32 2}
!288 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!289 = distinct !DISubprogram(name: "jpeg_start_decompress", scope: !1, file: !1, line: 38, type: !290, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !582)
!290 = !DISubroutineType(types: !291)
!291 = !{!250, !292}
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !4, line: 250, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !4, line: 394, size: 4928, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !325, !326, !327, !328, !330, !331, !332, !333, !335, !336, !337, !339, !340, !341, !342, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !364, !377, !393, !394, !395, !421, !422, !423, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !445, !446, !447, !448, !452, !453, !454, !455, !456, !457, !464, !478, !496, !505, !515, !530, !539, !552, !559, !568}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !294, file: !4, line: 395, baseType: !161, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !294, file: !4, line: 395, baseType: !206, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !294, file: !4, line: 395, baseType: !271, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !294, file: !4, line: 395, baseType: !250, size: 32, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !294, file: !4, line: 395, baseType: !172, size: 32, offset: 224)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !294, file: !4, line: 398, baseType: !302, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !4, line: 700, size: 448, elements: !304)
!304 = !{!305, !309, !310, !314, !316, !320, !324}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !303, file: !4, line: 701, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !226, line: 110, baseType: !227)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !303, file: !4, line: 702, baseType: !213, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !303, file: !4, line: 704, baseType: !311, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !292}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !303, file: !4, line: 705, baseType: !315, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !303, file: !4, line: 706, baseType: !317, size: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !292, !195}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !303, file: !4, line: 707, baseType: !321, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!250, !292, !172}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !303, file: !4, line: 708, baseType: !311, size: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !294, file: !4, line: 403, baseType: !228, size: 32, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !294, file: !4, line: 404, baseType: !228, size: 32, offset: 352)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !294, file: !4, line: 405, baseType: !172, size: 32, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !294, file: !4, line: 406, baseType: !329, size: 32, offset: 416)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !294, file: !4, line: 413, baseType: !329, size: 32, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !294, file: !4, line: 415, baseType: !5, size: 32, offset: 480)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !294, file: !4, line: 415, baseType: !5, size: 32, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !294, file: !4, line: 417, baseType: !334, size: 64, offset: 576)
!334 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !294, file: !4, line: 419, baseType: !250, size: 32, offset: 640)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !294, file: !4, line: 420, baseType: !250, size: 32, offset: 672)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !294, file: !4, line: 422, baseType: !338, size: 32, offset: 704)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !294, file: !4, line: 423, baseType: !250, size: 32, offset: 736)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !294, file: !4, line: 424, baseType: !250, size: 32, offset: 768)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !294, file: !4, line: 426, baseType: !250, size: 32, offset: 800)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !294, file: !4, line: 428, baseType: !343, size: 32, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !4, line: 224, baseType: !18)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !294, file: !4, line: 429, baseType: !250, size: 32, offset: 864)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !294, file: !4, line: 430, baseType: !172, size: 32, offset: 896)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !294, file: !4, line: 432, baseType: !250, size: 32, offset: 928)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !294, file: !4, line: 433, baseType: !250, size: 32, offset: 960)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !294, file: !4, line: 434, baseType: !250, size: 32, offset: 992)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !294, file: !4, line: 442, baseType: !228, size: 32, offset: 1024)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !294, file: !4, line: 443, baseType: !228, size: 32, offset: 1056)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !294, file: !4, line: 444, baseType: !172, size: 32, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !294, file: !4, line: 445, baseType: !172, size: 32, offset: 1120)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !294, file: !4, line: 449, baseType: !172, size: 32, offset: 1152)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !294, file: !4, line: 461, baseType: !172, size: 32, offset: 1184)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !294, file: !4, line: 462, baseType: !221, size: 64, offset: 1216)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !294, file: !4, line: 472, baseType: !228, size: 32, offset: 1280)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !294, file: !4, line: 477, baseType: !172, size: 32, offset: 1312)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !294, file: !4, line: 478, baseType: !228, size: 32, offset: 1344)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !294, file: !4, line: 484, baseType: !172, size: 32, offset: 1376)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !294, file: !4, line: 485, baseType: !228, size: 32, offset: 1408)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !294, file: !4, line: 494, baseType: !362, size: 64, offset: 1472)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 2048, elements: !241)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !294, file: !4, line: 505, baseType: !365, size: 256, offset: 1536)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 256, elements: !375)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !369)
!369 = !{!370, !374}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !368, file: !4, line: 88, baseType: !371, size: 1024)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 1024, elements: !241)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !226, line: 147, baseType: !373)
!373 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !368, file: !4, line: 94, baseType: !250, size: 32, offset: 1024)
!375 = !{!376}
!376 = !DISubrange(count: 4)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !294, file: !4, line: 508, baseType: !378, size: 256, offset: 1792)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 256, elements: !375)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !382)
!382 = !{!383, !388, !392}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !381, file: !4, line: 102, baseType: !384, size: 136)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 136, elements: !386)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !226, line: 135, baseType: !227)
!386 = !{!387}
!387 = !DISubrange(count: 17)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !381, file: !4, line: 104, baseType: !389, size: 2048, offset: 136)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 2048, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !381, file: !4, line: 110, baseType: !250, size: 32, offset: 2208)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !294, file: !4, line: 509, baseType: !378, size: 256, offset: 2048)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !294, file: !4, line: 516, baseType: !172, size: 32, offset: 2304)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !294, file: !4, line: 518, baseType: !396, size: 64, offset: 2368)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !398, file: !4, line: 120, baseType: !172, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !398, file: !4, line: 121, baseType: !172, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !398, file: !4, line: 122, baseType: !172, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !398, file: !4, line: 123, baseType: !172, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !398, file: !4, line: 124, baseType: !172, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !398, file: !4, line: 129, baseType: !172, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !398, file: !4, line: 130, baseType: !172, size: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !398, file: !4, line: 139, baseType: !228, size: 32, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !398, file: !4, line: 140, baseType: !228, size: 32, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !398, file: !4, line: 147, baseType: !172, size: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !398, file: !4, line: 154, baseType: !228, size: 32, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !398, file: !4, line: 155, baseType: !228, size: 32, offset: 352)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !398, file: !4, line: 160, baseType: !250, size: 32, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !398, file: !4, line: 164, baseType: !172, size: 32, offset: 416)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !398, file: !4, line: 165, baseType: !172, size: 32, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !398, file: !4, line: 166, baseType: !172, size: 32, offset: 480)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !398, file: !4, line: 167, baseType: !172, size: 32, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !398, file: !4, line: 168, baseType: !172, size: 32, offset: 544)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !398, file: !4, line: 169, baseType: !172, size: 32, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !398, file: !4, line: 175, baseType: !366, size: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !398, file: !4, line: 178, baseType: !155, size: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !294, file: !4, line: 521, baseType: !250, size: 32, offset: 2432)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !294, file: !4, line: 522, baseType: !250, size: 32, offset: 2464)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !294, file: !4, line: 524, baseType: !424, size: 128, offset: 2496)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 128, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 16)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !294, file: !4, line: 525, baseType: !424, size: 128, offset: 2624)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !294, file: !4, line: 526, baseType: !424, size: 128, offset: 2752)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !294, file: !4, line: 528, baseType: !5, size: 32, offset: 2880)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !294, file: !4, line: 533, baseType: !250, size: 32, offset: 2912)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !294, file: !4, line: 535, baseType: !385, size: 8, offset: 2944)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !294, file: !4, line: 536, baseType: !372, size: 16, offset: 2960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !294, file: !4, line: 537, baseType: !372, size: 16, offset: 2976)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !294, file: !4, line: 538, baseType: !250, size: 32, offset: 3008)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !294, file: !4, line: 539, baseType: !385, size: 8, offset: 3040)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !294, file: !4, line: 541, baseType: !250, size: 32, offset: 3072)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !294, file: !4, line: 550, baseType: !172, size: 32, offset: 3104)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !294, file: !4, line: 551, baseType: !172, size: 32, offset: 3136)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !294, file: !4, line: 553, baseType: !172, size: 32, offset: 3168)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !294, file: !4, line: 555, baseType: !228, size: 32, offset: 3200)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !294, file: !4, line: 564, baseType: !224, size: 64, offset: 3264)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !294, file: !4, line: 571, baseType: !172, size: 32, offset: 3328)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !294, file: !4, line: 572, baseType: !444, size: 256, offset: 3392)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 256, elements: !375)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !294, file: !4, line: 575, baseType: !228, size: 32, offset: 3648)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !294, file: !4, line: 576, baseType: !228, size: 32, offset: 3680)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !294, file: !4, line: 578, baseType: !172, size: 32, offset: 3712)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !294, file: !4, line: 579, baseType: !449, size: 320, offset: 3744)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 320, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 10)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !294, file: !4, line: 583, baseType: !172, size: 32, offset: 4064)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !294, file: !4, line: 583, baseType: !172, size: 32, offset: 4096)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !294, file: !4, line: 583, baseType: !172, size: 32, offset: 4128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !294, file: !4, line: 583, baseType: !172, size: 32, offset: 4160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !294, file: !4, line: 589, baseType: !172, size: 32, offset: 4192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !294, file: !4, line: 594, baseType: !458, size: 64, offset: 4224)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !24, line: 136, size: 192, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_output_pass", scope: !459, file: !24, line: 137, baseType: !311, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output_pass", scope: !459, file: !24, line: 138, baseType: !311, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "is_dummy_pass", scope: !459, file: !24, line: 141, baseType: !250, size: 32, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !294, file: !4, line: 595, baseType: !465, size: 64, offset: 4288)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !24, line: 157, size: 128, elements: !467)
!467 = !{!468, !473}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !466, file: !24, line: 158, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !292, !472}
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !24, line: 22, baseType: !23)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !466, file: !24, line: 159, baseType: !474, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !292, !221, !477, !228}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !294, file: !4, line: 596, baseType: !479, size: 64, offset: 4352)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !24, line: 165, size: 320, elements: !481)
!481 = !{!482, !483, !487, !488, !494}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !480, file: !24, line: 166, baseType: !311, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "consume_data", scope: !480, file: !24, line: 167, baseType: !484, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!172, !292}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "start_output_pass", scope: !480, file: !24, line: 168, baseType: !311, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "decompress_data", scope: !480, file: !24, line: 169, baseType: !489, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!172, !292, !492}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !4, line: 68, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "coef_arrays", scope: !480, file: !24, line: 172, baseType: !495, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !294, file: !4, line: 597, baseType: !497, size: 64, offset: 4416)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !24, line: 176, size: 128, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !498, file: !24, line: 177, baseType: !469, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_data", scope: !498, file: !24, line: 178, baseType: !502, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !292, !492, !477, !228, !221, !477, !228}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !294, file: !4, line: 598, baseType: !506, size: 64, offset: 4480)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !24, line: 145, size: 320, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "consume_input", scope: !507, file: !24, line: 146, baseType: !484, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "reset_input_controller", scope: !507, file: !24, line: 147, baseType: !311, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !507, file: !24, line: 148, baseType: !311, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input_pass", scope: !507, file: !24, line: 149, baseType: !311, size: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "has_multiple_scans", scope: !507, file: !24, line: 152, baseType: !250, size: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "eoi_reached", scope: !507, file: !24, line: 153, baseType: !250, size: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !294, file: !4, line: 599, baseType: !516, size: 64, offset: 4544)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !24, line: 188, size: 1408, elements: !518)
!518 = !{!519, !520, !521, !523, !524, !526, !527, !528, !529}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "reset_marker_reader", scope: !517, file: !24, line: 189, baseType: !311, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "read_markers", scope: !517, file: !24, line: 194, baseType: !484, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "read_restart_marker", scope: !517, file: !24, line: 196, baseType: !522, size: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_marker_parser_method", file: !4, line: 781, baseType: !315)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "process_COM", scope: !517, file: !24, line: 198, baseType: !522, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "process_APPn", scope: !517, file: !24, line: 199, baseType: !525, size: 1024, offset: 256)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 1024, elements: !425)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOI", scope: !517, file: !24, line: 204, baseType: !250, size: 32, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOF", scope: !517, file: !24, line: 205, baseType: !250, size: 32, offset: 1312)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "next_restart_num", scope: !517, file: !24, line: 206, baseType: !172, size: 32, offset: 1344)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "discarded_bytes", scope: !517, file: !24, line: 207, baseType: !5, size: 32, offset: 1376)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !294, file: !4, line: 600, baseType: !531, size: 64, offset: 4608)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !24, line: 211, size: 128, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !532, file: !24, line: 212, baseType: !311, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mcu", scope: !532, file: !24, line: 213, baseType: !536, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!250, !292, !234}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !294, file: !4, line: 601, baseType: !540, size: 64, offset: 4672)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !24, line: 223, size: 704, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !541, file: !24, line: 224, baseType: !311, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_DCT", scope: !541, file: !24, line: 226, baseType: !545, size: 640, offset: 64)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 640, elements: !450)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "inverse_DCT_method_ptr", file: !24, line: 218, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !292, !396, !550, !221, !228}
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEFPTR", file: !4, line: 75, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !294, file: !4, line: 602, baseType: !553, size: 64, offset: 4736)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !24, line: 230, size: 192, elements: !555)
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !554, file: !24, line: 231, baseType: !311, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !554, file: !24, line: 232, baseType: !502, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !554, file: !24, line: 240, baseType: !250, size: 32, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !294, file: !4, line: 603, baseType: !560, size: 64, offset: 4800)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !24, line: 244, size: 128, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !561, file: !24, line: 245, baseType: !311, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !561, file: !24, line: 246, baseType: !565, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !292, !492, !228, !221, !172}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !294, file: !4, line: 604, baseType: !569, size: 64, offset: 4864)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !24, line: 252, size: 256, elements: !571)
!571 = !{!572, !576, !580, !581}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !570, file: !24, line: 253, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !292, !250}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "color_quantize", scope: !570, file: !24, line: 254, baseType: !577, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !292, !221, !221, !172}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !570, file: !24, line: 257, baseType: !311, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "new_color_map", scope: !570, file: !24, line: 258, baseType: !311, size: 64, offset: 192)
!582 = !{}
!583 = !DILocalVariable(name: "cinfo", arg: 1, scope: !289, file: !1, line: 38, type: !292)
!584 = !DILocation(line: 38, column: 41, scope: !289)
!585 = !DILocation(line: 40, column: 7, scope: !586)
!586 = distinct !DILexicalBlock(scope: !289, file: !1, line: 40, column: 7)
!587 = !DILocation(line: 40, column: 14, scope: !586)
!588 = !DILocation(line: 40, column: 27, scope: !586)
!589 = !DILocation(line: 42, column: 29, scope: !590)
!590 = distinct !DILexicalBlock(scope: !586, file: !1, line: 40, column: 44)
!591 = !DILocation(line: 42, column: 5, scope: !590)
!592 = !DILocation(line: 43, column: 9, scope: !593)
!593 = distinct !DILexicalBlock(scope: !590, file: !1, line: 43, column: 9)
!594 = !DILocation(line: 43, column: 16, scope: !593)
!595 = !DILocation(line: 45, column: 7, scope: !596)
!596 = distinct !DILexicalBlock(scope: !593, file: !1, line: 43, column: 32)
!597 = !DILocation(line: 45, column: 14, scope: !596)
!598 = !DILocation(line: 45, column: 27, scope: !596)
!599 = !DILocation(line: 46, column: 7, scope: !596)
!600 = !DILocation(line: 48, column: 5, scope: !590)
!601 = !DILocation(line: 48, column: 12, scope: !590)
!602 = !DILocation(line: 48, column: 25, scope: !590)
!603 = !DILocation(line: 49, column: 3, scope: !590)
!604 = !DILocation(line: 50, column: 7, scope: !605)
!605 = distinct !DILexicalBlock(scope: !289, file: !1, line: 50, column: 7)
!606 = !DILocation(line: 50, column: 14, scope: !605)
!607 = !DILocation(line: 50, column: 27, scope: !605)
!608 = !DILocation(line: 52, column: 9, scope: !609)
!609 = distinct !DILexicalBlock(scope: !610, file: !1, line: 52, column: 9)
!610 = distinct !DILexicalBlock(scope: !605, file: !1, line: 50, column: 46)
!611 = !DILocation(line: 52, column: 16, scope: !609)
!612 = !DILocation(line: 52, column: 26, scope: !609)
!613 = !DILocation(line: 54, column: 7, scope: !614)
!614 = distinct !DILexicalBlock(scope: !609, file: !1, line: 52, column: 46)
!615 = !DILocalVariable(name: "retcode", scope: !616, file: !1, line: 55, type: !172)
!616 = distinct !DILexicalBlock(scope: !617, file: !1, line: 54, column: 16)
!617 = distinct !DILexicalBlock(scope: !618, file: !1, line: 54, column: 7)
!618 = distinct !DILexicalBlock(scope: !614, file: !1, line: 54, column: 7)
!619 = !DILocation(line: 55, column: 6, scope: !616)
!620 = !DILocation(line: 57, column: 6, scope: !621)
!621 = distinct !DILexicalBlock(scope: !616, file: !1, line: 57, column: 6)
!622 = !DILocation(line: 57, column: 13, scope: !621)
!623 = !DILocation(line: 57, column: 22, scope: !621)
!624 = !DILocation(line: 58, column: 6, scope: !621)
!625 = !DILocation(line: 58, column: 13, scope: !621)
!626 = !DILocation(line: 58, column: 23, scope: !621)
!627 = !DILocation(line: 58, column: 57, scope: !621)
!628 = !DILocation(line: 58, column: 4, scope: !621)
!629 = !DILocation(line: 60, column: 14, scope: !616)
!630 = !DILocation(line: 60, column: 21, scope: !616)
!631 = !DILocation(line: 60, column: 31, scope: !616)
!632 = !DILocation(line: 60, column: 47, scope: !616)
!633 = !DILocation(line: 60, column: 12, scope: !616)
!634 = !DILocation(line: 60, column: 10, scope: !616)
!635 = !DILocation(line: 61, column: 6, scope: !636)
!636 = distinct !DILexicalBlock(scope: !616, file: !1, line: 61, column: 6)
!637 = !DILocation(line: 61, column: 14, scope: !636)
!638 = !DILocation(line: 62, column: 4, scope: !636)
!639 = !DILocation(line: 63, column: 6, scope: !640)
!640 = distinct !DILexicalBlock(scope: !616, file: !1, line: 63, column: 6)
!641 = !DILocation(line: 63, column: 14, scope: !640)
!642 = !DILocation(line: 64, column: 4, scope: !640)
!643 = !DILocation(line: 66, column: 6, scope: !644)
!644 = distinct !DILexicalBlock(scope: !616, file: !1, line: 66, column: 6)
!645 = !DILocation(line: 66, column: 13, scope: !644)
!646 = !DILocation(line: 66, column: 22, scope: !644)
