; ModuleID = 'cBench/consumer_jpeg_c/src/jdapimin.c'
source_filename = "cBench/consumer_jpeg_c/src/jdapimin.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_decompress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], i32, ptr, i32, i32, [16 x i8], [16 x i8], [16 x i8], i32, i32, i8, i16, i16, i32, i8, i32, i32, i32, i32, i32, ptr, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.jpeg_marker_reader = type { ptr, ptr, ptr, ptr, [16 x ptr], i32, i32, i32, i32 }
%struct.jpeg_input_controller = type { ptr, ptr, ptr, ptr, i32, i32 }
%struct.jpeg_source_mgr = type { ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_component_info = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }
%struct.jpeg_decomp_master = type { ptr, ptr, i32 }

; Function Attrs: noinline nounwind uwtable
define dso_local void @jpeg_CreateDecompress(ptr noundef %0, i32 noundef %1, i64 noundef %2) #0 !dbg !289 {

!68 = !DIEnumerator(name: "JERR_FILE_READ", value: 35)
!69 = !DIEnumerator(name: "JERR_FILE_WRITE", value: 36)
!70 = !DIEnumerator(name: "JERR_FRACT_SAMPLE_NOTIMPL", value: 37)
!71 = !DIEnumerator(name: "JERR_HUFF_CLEN_OVERFLOW", value: 38)
!72 = !DIEnumerator(name: "JERR_HUFF_MISSING_CODE", value: 39)
!73 = !DIEnumerator(name: "JERR_IMAGE_TOO_BIG", value: 40)
!74 = !DIEnumerator(name: "JERR_INPUT_EMPTY", value: 41)
!75 = !DIEnumerator(name: "JERR_INPUT_EOF", value: 42)
!76 = !DIEnumerator(name: "JERR_MISMATCHED_QUANT_TABLE", value: 43)
!77 = !DIEnumerator(name: "JERR_MISSING_DATA", value: 44)
!78 = !DIEnumerator(name: "JERR_MODE_CHANGE", value: 45)
!79 = !DIEnumerator(name: "JERR_NOTIMPL", value: 46)
!80 = !DIEnumerator(name: "JERR_NOT_COMPILED", value: 47)
!81 = !DIEnumerator(name: "JERR_NO_BACKING_STORE", value: 48)
!82 = !DIEnumerator(name: "JERR_NO_HUFF_TABLE", value: 49)
!83 = !DIEnumerator(name: "JERR_NO_IMAGE", value: 50)
!84 = !DIEnumerator(name: "JERR_NO_QUANT_TABLE", value: 51)
!85 = !DIEnumerator(name: "JERR_NO_SOI", value: 52)
!86 = !DIEnumerator(name: "JERR_OUT_OF_MEMORY", value: 53)
!87 = !DIEnumerator(name: "JERR_QUANT_COMPONENTS", value: 54)
!88 = !DIEnumerator(name: "JERR_QUANT_FEW_COLORS", value: 55)
!89 = !DIEnumerator(name: "JERR_QUANT_MANY_COLORS", value: 56)
!90 = !DIEnumerator(name: "JERR_SOF_DUPLICATE", value: 57)
!91 = !DIEnumerator(name: "JERR_SOF_NO_SOS", value: 58)
!92 = !DIEnumerator(name: "JERR_SOF_UNSUPPORTED", value: 59)
!93 = !DIEnumerator(name: "JERR_SOI_DUPLICATE", value: 60)
!94 = !DIEnumerator(name: "JERR_SOS_NO_SOF", value: 61)
!95 = !DIEnumerator(name: "JERR_TFILE_CREATE", value: 62)
!96 = !DIEnumerator(name: "JERR_TFILE_READ", value: 63)
!97 = !DIEnumerator(name: "JERR_TFILE_SEEK", value: 64)
!98 = !DIEnumerator(name: "JERR_TFILE_WRITE", value: 65)
!99 = !DIEnumerator(name: "JERR_TOO_LITTLE_DATA", value: 66)
!100 = !DIEnumerator(name: "JERR_UNKNOWN_MARKER", value: 67)
!101 = !DIEnumerator(name: "JERR_VIRTUAL_BUG", value: 68)
!102 = !DIEnumerator(name: "JERR_WIDTH_OVERFLOW", value: 69)
!103 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!104 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!105 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!106 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!107 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!108 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!109 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!110 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!111 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!112 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!113 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!114 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!115 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!116 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!117 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!118 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!119 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!120 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!121 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!122 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!123 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!124 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!125 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!126 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!127 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!128 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!129 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!130 = !DIEnumerator(name: "JTRC_RST", value: 97)
!131 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!132 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!133 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!134 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!135 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!136 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!137 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!138 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!139 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!140 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!141 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!142 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!143 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!144 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!145 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!146 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!147 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!148 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!149 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!150 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!151 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!152 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!153 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!154 = !{!155, !213, !171, !212}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !158)
!158 = !{!159, !204, !270, !279, !280}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !157, file: !4, line: 241, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !162)
!162 = !{!163, !167, !172, !173, !179, !180, !181, !192, !193, !195, !200, !201, !202, !203}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !161, file: !4, line: 620, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !155}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !161, file: !4, line: 622, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !155, !171}
!171 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !161, file: !4, line: 624, baseType: !164, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !161, file: !4, line: 626, baseType: !174, size: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !155, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !161, file: !4, line: 629, baseType: !164, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !161, file: !4, line: 634, baseType: !171, size: 32, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !161, file: !4, line: 639, baseType: !182, size: 640, offset: 352)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !4, line: 636, size: 640, elements: !183)
!183 = !{!184, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !182, file: !4, line: 637, baseType: !185, size: 256)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 256, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !182, file: !4, line: 638, baseType: !189, size: 640)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 640, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 80)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !161, file: !4, line: 643, baseType: !171, size: 32, offset: 992)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !161, file: !4, line: 651, baseType: !194, size: 64, offset: 1024)
!194 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !161, file: !4, line: 663, baseType: !196, size: 64, offset: 1088)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !161, file: !4, line: 664, baseType: !171, size: 32, offset: 1152)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !161, file: !4, line: 668, baseType: !196, size: 64, offset: 1216)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !161, file: !4, line: 669, baseType: !171, size: 32, offset: 1280)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !161, file: !4, line: 670, baseType: !171, size: 32, offset: 1312)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !157, file: !4, line: 241, baseType: !205, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !207)
!207 = !{!208, !216, !217, !229, !243, !251, !258, !259, !263, !267, !268, !269}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !206, file: !4, line: 733, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!212, !155, !171, !213}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !214, line: 18, baseType: !215)
!214 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!215 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !206, file: !4, line: 735, baseType: !209, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !206, file: !4, line: 737, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!221, !155, !171, !228, !228}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !226, line: 59, baseType: !227)
!226 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!227 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !226, line: 171, baseType: !5)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !206, file: !4, line: 740, baseType: !230, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !155, !171, !228, !228}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 1024, elements: !241)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !226, line: 99, baseType: !240)
!240 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!241 = !{!242}
!242 = !DISubrange(count: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !206, file: !4, line: 743, baseType: !244, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !155, !171, !250, !228, !228, !228}
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !226, line: 227, baseType: !171)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !206, file: !4, line: 749, baseType: !252, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!255, !155, !171, !250, !228, !228, !228}
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !206, file: !4, line: 755, baseType: !164, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !206, file: !4, line: 756, baseType: !260, size: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!221, !155, !247, !228, !228, !250}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !206, file: !4, line: 761, baseType: !264, size: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!233, !155, !255, !228, !228, !250}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !206, file: !4, line: 766, baseType: !168, size: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !206, file: !4, line: 767, baseType: !164, size: 64, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !206, file: !4, line: 774, baseType: !194, size: 64, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !157, file: !4, line: 241, baseType: !271, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !273)
!273 = !{!274, !275, !276, !277, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !272, file: !4, line: 677, baseType: !164, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !272, file: !4, line: 679, baseType: !194, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !272, file: !4, line: 680, baseType: !194, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !272, file: !4, line: 681, baseType: !171, size: 32, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !272, file: !4, line: 682, baseType: !171, size: 32, offset: 224)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !157, file: !4, line: 241, baseType: !250, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !157, file: !4, line: 241, baseType: !171, size: 32, offset: 224)
!281 = !{i32 7, !"Dwarf Version", i32 5}
!282 = !{i32 2, !"Debug Info Version", i32 3}
!283 = !{i32 1, !"wchar_size", i32 4}
!284 = !{i32 8, !"PIC Level", i32 2}
!285 = !{i32 7, !"PIE Level", i32 2}
!286 = !{i32 7, !"uwtable", i32 2}
!287 = !{i32 7, !"frame-pointer", i32 2}
!288 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!289 = distinct !DISubprogram(name: "jpeg_CreateDecompress", scope: !1, file: !1, line: 30, type: !290, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !584)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !292, !171, !213}
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !4, line: 250, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !4, line: 394, size: 4928, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !327, !328, !329, !330, !332, !333, !334, !335, !337, !338, !339, !341, !342, !343, !344, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !366, !379, !395, !396, !397, !423, !424, !425, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !447, !448, !449, !450, !454, !455, !456, !457, !458, !459, !466, !480, !498, !507, !517, !532, !541, !554, !561, !570}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !294, file: !4, line: 395, baseType: !160, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !294, file: !4, line: 395, baseType: !205, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !294, file: !4, line: 395, baseType: !271, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !294, file: !4, line: 395, baseType: !250, size: 32, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !294, file: !4, line: 395, baseType: !171, size: 32, offset: 224)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !294, file: !4, line: 398, baseType: !302, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !4, line: 700, size: 448, elements: !304)
!304 = !{!305, !309, !310, !314, !318, !322, !326}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !303, file: !4, line: 701, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !226, line: 110, baseType: !227)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !303, file: !4, line: 702, baseType: !213, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !303, file: !4, line: 704, baseType: !311, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !292}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !303, file: !4, line: 705, baseType: !315, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!250, !292}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !303, file: !4, line: 706, baseType: !319, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !292, !194}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !303, file: !4, line: 707, baseType: !323, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!250, !292, !171}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !303, file: !4, line: 708, baseType: !311, size: 64, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !294, file: !4, line: 403, baseType: !228, size: 32, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !294, file: !4, line: 404, baseType: !228, size: 32, offset: 352)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !294, file: !4, line: 405, baseType: !171, size: 32, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !294, file: !4, line: 406, baseType: !331, size: 32, offset: 416)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !294, file: !4, line: 413, baseType: !331, size: 32, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !294, file: !4, line: 415, baseType: !5, size: 32, offset: 480)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !294, file: !4, line: 415, baseType: !5, size: 32, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !294, file: !4, line: 417, baseType: !336, size: 64, offset: 576)
!336 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !294, file: !4, line: 419, baseType: !250, size: 32, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !294, file: !4, line: 420, baseType: !250, size: 32, offset: 672)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !294, file: !4, line: 422, baseType: !340, size: 32, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !294, file: !4, line: 423, baseType: !250, size: 32, offset: 736)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !294, file: !4, line: 424, baseType: !250, size: 32, offset: 768)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !294, file: !4, line: 426, baseType: !250, size: 32, offset: 800)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !294, file: !4, line: 428, baseType: !345, size: 32, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !4, line: 224, baseType: !18)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !294, file: !4, line: 429, baseType: !250, size: 32, offset: 864)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !294, file: !4, line: 430, baseType: !171, size: 32, offset: 896)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !294, file: !4, line: 432, baseType: !250, size: 32, offset: 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !294, file: !4, line: 433, baseType: !250, size: 32, offset: 960)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !294, file: !4, line: 434, baseType: !250, size: 32, offset: 992)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !294, file: !4, line: 442, baseType: !228, size: 32, offset: 1024)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !294, file: !4, line: 443, baseType: !228, size: 32, offset: 1056)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !294, file: !4, line: 444, baseType: !171, size: 32, offset: 1088)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !294, file: !4, line: 445, baseType: !171, size: 32, offset: 1120)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !294, file: !4, line: 449, baseType: !171, size: 32, offset: 1152)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !294, file: !4, line: 461, baseType: !171, size: 32, offset: 1184)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !294, file: !4, line: 462, baseType: !221, size: 64, offset: 1216)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !294, file: !4, line: 472, baseType: !228, size: 32, offset: 1280)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !294, file: !4, line: 477, baseType: !171, size: 32, offset: 1312)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !294, file: !4, line: 478, baseType: !228, size: 32, offset: 1344)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !294, file: !4, line: 484, baseType: !171, size: 32, offset: 1376)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !294, file: !4, line: 485, baseType: !228, size: 32, offset: 1408)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !294, file: !4, line: 494, baseType: !364, size: 64, offset: 1472)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 2048, elements: !241)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !294, file: !4, line: 505, baseType: !367, size: 256, offset: 1536)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 256, elements: !377)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !371)
!371 = !{!372, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !370, file: !4, line: 88, baseType: !373, size: 1024)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 1024, elements: !241)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !226, line: 147, baseType: !375)
!375 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !370, file: !4, line: 94, baseType: !250, size: 32, offset: 1024)
!377 = !{!378}
!378 = !DISubrange(count: 4)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !294, file: !4, line: 508, baseType: !380, size: 256, offset: 1792)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 256, elements: !377)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !384)
!384 = !{!385, !390, !394}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !383, file: !4, line: 102, baseType: !386, size: 136)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 136, elements: !388)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !226, line: 135, baseType: !227)
!388 = !{!389}
!389 = !DISubrange(count: 17)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !383, file: !4, line: 104, baseType: !391, size: 2048, offset: 136)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 2048, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !383, file: !4, line: 110, baseType: !250, size: 32, offset: 2208)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !294, file: !4, line: 509, baseType: !380, size: 256, offset: 2048)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !294, file: !4, line: 516, baseType: !171, size: 32, offset: 2304)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !294, file: !4, line: 518, baseType: !398, size: 64, offset: 2368)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !400, file: !4, line: 120, baseType: !171, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !400, file: !4, line: 121, baseType: !171, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !400, file: !4, line: 122, baseType: !171, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !400, file: !4, line: 123, baseType: !171, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !400, file: !4, line: 124, baseType: !171, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !400, file: !4, line: 129, baseType: !171, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !400, file: !4, line: 130, baseType: !171, size: 32, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !400, file: !4, line: 139, baseType: !228, size: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !400, file: !4, line: 140, baseType: !228, size: 32, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !400, file: !4, line: 147, baseType: !171, size: 32, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !400, file: !4, line: 154, baseType: !228, size: 32, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !400, file: !4, line: 155, baseType: !228, size: 32, offset: 352)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !400, file: !4, line: 160, baseType: !250, size: 32, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !400, file: !4, line: 164, baseType: !171, size: 32, offset: 416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !400, file: !4, line: 165, baseType: !171, size: 32, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !400, file: !4, line: 166, baseType: !171, size: 32, offset: 480)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !400, file: !4, line: 167, baseType: !171, size: 32, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !400, file: !4, line: 168, baseType: !171, size: 32, offset: 544)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !400, file: !4, line: 169, baseType: !171, size: 32, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !400, file: !4, line: 175, baseType: !368, size: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !400, file: !4, line: 178, baseType: !212, size: 64, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !294, file: !4, line: 521, baseType: !250, size: 32, offset: 2432)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !294, file: !4, line: 522, baseType: !250, size: 32, offset: 2464)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !294, file: !4, line: 524, baseType: !426, size: 128, offset: 2496)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 128, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 16)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !294, file: !4, line: 525, baseType: !426, size: 128, offset: 2624)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !294, file: !4, line: 526, baseType: !426, size: 128, offset: 2752)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !294, file: !4, line: 528, baseType: !5, size: 32, offset: 2880)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !294, file: !4, line: 533, baseType: !250, size: 32, offset: 2912)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !294, file: !4, line: 535, baseType: !387, size: 8, offset: 2944)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !294, file: !4, line: 536, baseType: !374, size: 16, offset: 2960)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !294, file: !4, line: 537, baseType: !374, size: 16, offset: 2976)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !294, file: !4, line: 538, baseType: !250, size: 32, offset: 3008)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !294, file: !4, line: 539, baseType: !387, size: 8, offset: 3040)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !294, file: !4, line: 541, baseType: !250, size: 32, offset: 3072)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !294, file: !4, line: 550, baseType: !171, size: 32, offset: 3104)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !294, file: !4, line: 551, baseType: !171, size: 32, offset: 3136)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !294, file: !4, line: 553, baseType: !171, size: 32, offset: 3168)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !294, file: !4, line: 555, baseType: !228, size: 32, offset: 3200)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !294, file: !4, line: 564, baseType: !224, size: 64, offset: 3264)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !294, file: !4, line: 571, baseType: !171, size: 32, offset: 3328)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !294, file: !4, line: 572, baseType: !446, size: 256, offset: 3392)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 256, elements: !377)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !294, file: !4, line: 575, baseType: !228, size: 32, offset: 3648)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !294, file: !4, line: 576, baseType: !228, size: 32, offset: 3680)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !294, file: !4, line: 578, baseType: !171, size: 32, offset: 3712)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !294, file: !4, line: 579, baseType: !451, size: 320, offset: 3744)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 320, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 10)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !294, file: !4, line: 583, baseType: !171, size: 32, offset: 4064)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !294, file: !4, line: 583, baseType: !171, size: 32, offset: 4096)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !294, file: !4, line: 583, baseType: !171, size: 32, offset: 4128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !294, file: !4, line: 583, baseType: !171, size: 32, offset: 4160)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !294, file: !4, line: 589, baseType: !171, size: 32, offset: 4192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !294, file: !4, line: 594, baseType: !460, size: 64, offset: 4224)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !24, line: 136, size: 192, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_output_pass", scope: !461, file: !24, line: 137, baseType: !311, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output_pass", scope: !461, file: !24, line: 138, baseType: !311, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "is_dummy_pass", scope: !461, file: !24, line: 141, baseType: !250, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !294, file: !4, line: 595, baseType: !467, size: 64, offset: 4288)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !24, line: 157, size: 128, elements: !469)
!469 = !{!470, !475}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !468, file: !24, line: 158, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !292, !474}
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !24, line: 22, baseType: !23)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !468, file: !24, line: 159, baseType: !476, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !292, !221, !479, !228}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !294, file: !4, line: 596, baseType: !481, size: 64, offset: 4352)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !24, line: 165, size: 320, elements: !483)
!483 = !{!484, !485, !489, !490, !496}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !482, file: !24, line: 166, baseType: !311, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "consume_data", scope: !482, file: !24, line: 167, baseType: !486, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!171, !292}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "start_output_pass", scope: !482, file: !24, line: 168, baseType: !311, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "decompress_data", scope: !482, file: !24, line: 169, baseType: !491, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!171, !292, !494}
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !4, line: 68, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "coef_arrays", scope: !482, file: !24, line: 172, baseType: !497, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !294, file: !4, line: 597, baseType: !499, size: 64, offset: 4416)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !24, line: 176, size: 128, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !500, file: !24, line: 177, baseType: !471, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_data", scope: !500, file: !24, line: 178, baseType: !504, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !292, !494, !479, !228, !221, !479, !228}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !294, file: !4, line: 598, baseType: !508, size: 64, offset: 4480)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !24, line: 145, size: 320, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "consume_input", scope: !509, file: !24, line: 146, baseType: !486, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reset_input_controller", scope: !509, file: !24, line: 147, baseType: !311, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !509, file: !24, line: 148, baseType: !311, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input_pass", scope: !509, file: !24, line: 149, baseType: !311, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "has_multiple_scans", scope: !509, file: !24, line: 152, baseType: !250, size: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "eoi_reached", scope: !509, file: !24, line: 153, baseType: !250, size: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !294, file: !4, line: 599, baseType: !518, size: 64, offset: 4544)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !24, line: 188, size: 1408, elements: !520)
!520 = !{!521, !522, !523, !525, !526, !528, !529, !530, !531}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reset_marker_reader", scope: !519, file: !24, line: 189, baseType: !311, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "read_markers", scope: !519, file: !24, line: 194, baseType: !486, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "read_restart_marker", scope: !519, file: !24, line: 196, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_marker_parser_method", file: !4, line: 781, baseType: !315)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "process_COM", scope: !519, file: !24, line: 198, baseType: !524, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "process_APPn", scope: !519, file: !24, line: 199, baseType: !527, size: 1024, offset: 256)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 1024, elements: !427)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOI", scope: !519, file: !24, line: 204, baseType: !250, size: 32, offset: 1280)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOF", scope: !519, file: !24, line: 205, baseType: !250, size: 32, offset: 1312)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next_restart_num", scope: !519, file: !24, line: 206, baseType: !171, size: 32, offset: 1344)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "discarded_bytes", scope: !519, file: !24, line: 207, baseType: !5, size: 32, offset: 1376)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !294, file: !4, line: 600, baseType: !533, size: 64, offset: 4608)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !24, line: 211, size: 128, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !534, file: !24, line: 212, baseType: !311, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mcu", scope: !534, file: !24, line: 213, baseType: !538, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!250, !292, !234}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !294, file: !4, line: 601, baseType: !542, size: 64, offset: 4672)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !24, line: 223, size: 704, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !543, file: !24, line: 224, baseType: !311, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_DCT", scope: !543, file: !24, line: 226, baseType: !547, size: 640, offset: 64)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 640, elements: !452)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "inverse_DCT_method_ptr", file: !24, line: 218, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !292, !398, !552, !221, !228}
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEFPTR", file: !4, line: 75, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !294, file: !4, line: 602, baseType: !555, size: 64, offset: 4736)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !24, line: 230, size: 192, elements: !557)
!557 = !{!558, !559, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !556, file: !24, line: 231, baseType: !311, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !556, file: !24, line: 232, baseType: !504, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !556, file: !24, line: 240, baseType: !250, size: 32, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !294, file: !4, line: 603, baseType: !562, size: 64, offset: 4800)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !24, line: 244, size: 128, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !563, file: !24, line: 245, baseType: !311, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !563, file: !24, line: 246, baseType: !567, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !292, !494, !228, !221, !171}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !294, file: !4, line: 604, baseType: !571, size: 64, offset: 4864)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !24, line: 252, size: 256, elements: !573)
!573 = !{!574, !578, !582, !583}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !572, file: !24, line: 253, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !292, !250}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "color_quantize", scope: !572, file: !24, line: 254, baseType: !579, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !292, !221, !221, !171}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !572, file: !24, line: 257, baseType: !311, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "new_color_map", scope: !572, file: !24, line: 258, baseType: !311, size: 64, offset: 192)
!584 = !{}
!585 = !DILocalVariable(name: "cinfo", arg: 1, scope: !289, file: !1, line: 30, type: !292)
!586 = !DILocation(line: 30, column: 41, scope: !289)
!587 = !DILocalVariable(name: "version", arg: 2, scope: !289, file: !1, line: 30, type: !171)
!588 = !DILocation(line: 30, column: 52, scope: !289)
!589 = !DILocalVariable(name: "structsize", arg: 3, scope: !289, file: !1, line: 30, type: !213)
!590 = !DILocation(line: 30, column: 68, scope: !289)
!591 = !DILocalVariable(name: "i", scope: !289, file: !1, line: 32, type: !171)
!592 = !DILocation(line: 32, column: 7, scope: !289)
!593 = !DILocation(line: 35, column: 3, scope: !289)
!594 = !DILocation(line: 35, column: 10, scope: !289)
!595 = !DILocation(line: 35, column: 14, scope: !289)
!596 = !DILocation(line: 36, column: 7, scope: !597)
!597 = distinct !DILexicalBlock(scope: !289, file: !1, line: 36, column: 7)
!598 = !DILocation(line: 36, column: 15, scope: !597)
!599 = !DILocation(line: 37, column: 5, scope: !597)
!600 = !DILocation(line: 38, column: 7, scope: !601)
!601 = distinct !DILexicalBlock(scope: !289, file: !1, line: 38, column: 7)
!602 = !DILocation(line: 38, column: 18, scope: !601)
!603 = !DILocation(line: 39, column: 5, scope: !601)
!604 = !DILocalVariable(name: "err", scope: !605, file: !1, line: 46, type: !160)
!605 = distinct !DILexicalBlock(scope: !289, file: !1, line: 45, column: 3)
!606 = !DILocation(line: 46, column: 29, scope: !605)
!607 = !DILocation(line: 46, column: 35, scope: !605)
!608 = !DILocation(line: 46, column: 42, scope: !605)
!609 = !DILocation(line: 47, column: 5, scope: !605)
!610 = !DILocation(line: 48, column: 18, scope: !605)
!611 = !DILocation(line: 48, column: 5, scope: !605)
!612 = !DILocation(line: 48, column: 12, scope: !605)
!613 = !DILocation(line: 48, column: 16, scope: !605)
!614 = !DILocation(line: 50, column: 3, scope: !289)
!615 = !DILocation(line: 50, column: 10, scope: !289)
!616 = !DILocation(line: 50, column: 26, scope: !289)
!617 = !DILocation(line: 53, column: 35, scope: !289)
!618 = !DILocation(line: 53, column: 3, scope: !289)
!619 = !DILocation(line: 56, column: 3, scope: !289)
!620 = !DILocation(line: 56, column: 10, scope: !289)
!621 = !DILocation(line: 56, column: 19, scope: !289)
!622 = !DILocation(line: 57, column: 3, scope: !289)
!623 = !DILocation(line: 57, column: 10, scope: !289)
!624 = !DILocation(line: 57, column: 14, scope: !289)
!625 = !DILocation(line: 59, column: 10, scope: !626)
!626 = distinct !DILexicalBlock(scope: !289, file: !1, line: 59, column: 3)
!627 = !DILocation(line: 59, column: 8, scope: !626)
!628 = !DILocation(line: 59, column: 15, scope: !629)
!629 = distinct !DILexicalBlock(scope: !626, file: !1, line: 59, column: 3)
!630 = !DILocation(line: 59, column: 17, scope: !629)
!631 = !DILocation(line: 59, column: 3, scope: !626)
!632 = !DILocation(line: 60, column: 5, scope: !629)
!633 = !DILocation(line: 60, column: 12, scope: !629)
!634 = !DILocation(line: 60, column: 27, scope: !629)
!635 = !DILocation(line: 60, column: 30, scope: !629)
!636 = !DILocation(line: 59, column: 36, scope: !629)
!637 = !DILocation(line: 59, column: 3, scope: !629)
!638 = distinct !{!638, !631, !639, !640}
!639 = !DILocation(line: 60, column: 32, scope: !626)
!640 = !{!"llvm.loop.mustprogress"}
!641 = !DILocation(line: 62, column: 10, scope: !642)
!642 = distinct !DILexicalBlock(scope: !289, file: !1, line: 62, column: 3)
!643 = !DILocation(line: 62, column: 8, scope: !642)
!644 = !DILocation(line: 62, column: 15, scope: !645)
!645 = distinct !DILexicalBlock(scope: !642, file: !1, line: 62, column: 3)
!646 = !DILocation(line: 62, column: 17, scope: !645)
!647 = !DILocation(line: 62, column: 3, scope: !642)
!648 = !DILocation(line: 63, column: 5, scope: !649)
!649 = distinct !DILexicalBlock(scope: !645, file: !1, line: 62, column: 39)
!650 = !DILocation(line: 63, column: 12, scope: !649)
