; ModuleID = 'cBench/consumer_jpeg_c/src/jdcoefct.c'
source_filename = "cBench/consumer_jpeg_c/src/jdcoefct.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_decompress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], i32, ptr, i32, i32, [16 x i8], [16 x i8], [16 x i8], i32, i32, i8, i16, i16, i32, i8, i32, i32, i32, i32, i32, ptr, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.my_coef_controller = type { %struct.jpeg_d_coef_controller, i32, i32, i32, [10 x ptr], [10 x ptr], ptr }
%struct.jpeg_d_coef_controller = type { ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_component_info = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }
%struct.jpeg_entropy_decoder = type { ptr, ptr }
%struct.jpeg_input_controller = type { ptr, ptr, ptr, ptr, i32, i32 }
%struct.jpeg_inverse_dct = type { ptr, [10 x ptr] }
%struct.JQUANT_TBL = type { [64 x i16], i32 }

; Function Attrs: noinline nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1, producer: "clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !30, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jdcoefct.c", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "868dedb31a92aa651a41abeb6efc390d")
!2 = !{!3, !13, !18, !23}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 194, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpeglib.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "2a2b23235fe587b10147d741e3371e67")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "JCS_UNKNOWN", value: 0)
!8 = !DIEnumerator(name: "JCS_GRAYSCALE", value: 1)
!9 = !DIEnumerator(name: "JCS_RGB", value: 2)
!10 = !DIEnumerator(name: "JCS_YCbCr", value: 3)
!11 = !DIEnumerator(name: "JCS_CMYK", value: 4)
!12 = !DIEnumerator(name: "JCS_YCCK", value: 5)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 205, baseType: !5, size: 32, elements: !14)
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "JDCT_ISLOW", value: 0)
!16 = !DIEnumerator(name: "JDCT_IFAST", value: 1)
!17 = !DIEnumerator(name: "JDCT_FLOAT", value: 2)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 220, baseType: !5, size: 32, elements: !19)
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "JDITHER_NONE", value: 0)
!21 = !DIEnumerator(name: "JDITHER_ORDERED", value: 1)
!22 = !DIEnumerator(name: "JDITHER_FS", value: 2)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 16, baseType: !5, size: 32, elements: !25)
!24 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpegint.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "87e9869e13f29b8e74a9dee50528c6c5")
!25 = !{!26, !27, !28, !29}
!26 = !DIEnumerator(name: "JBUF_PASS_THRU", value: 0)
!27 = !DIEnumerator(name: "JBUF_SAVE_SOURCE", value: 1)
!28 = !DIEnumerator(name: "JBUF_CRANK_DEST", value: 2)
!29 = !DIEnumerator(name: "JBUF_SAVE_AND_PASS", value: 3)
!30 = !{!31, !55, !70, !355, !85, !130, !92, !68, !463, !69, !96, !415}
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_coef_ptr", file: !1, line: 62, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_coef_controller", file: !1, line: 60, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 28, size: 1792, elements: !35)
!35 = !{!36, !455, !456, !457, !458, !460, !462}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !34, file: !1, line: 29, baseType: !37, size: 320)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !24, line: 165, size: 320, elements: !38)
!38 = !{!39, !447, !448, !449, !453}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !37, file: !24, line: 166, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !43}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !4, line: 250, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !4, line: 394, size: 4928, elements: !46)
!46 = !{!47, !174, !175, !176, !177, !178, !201, !202, !203, !204, !206, !207, !208, !209, !211, !212, !213, !215, !216, !217, !218, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !240, !253, !269, !270, !271, !297, !298, !299, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !321, !322, !323, !324, !328, !329, !330, !331, !332, !333, !340, !354, !356, !367, !380, !395, !404, !417, !424, !433}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !45, file: !4, line: 395, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !50)
!50 = !{!51, !142, !143, !144, !150, !151, !152, !163, !164, !165, !170, !171, !172, !173}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !49, file: !4, line: 620, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !58)
!58 = !{!59, !60, !131, !140, !141}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !57, file: !4, line: 241, baseType: !48, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !57, file: !4, line: 241, baseType: !61, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !63)
!63 = !{!64, !73, !74, !86, !100, !108, !115, !116, !120, !124, !128, !129}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !62, file: !4, line: 733, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !55, !69, !70}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 18, baseType: !72)
!71 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!72 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !62, file: !4, line: 735, baseType: !65, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !62, file: !4, line: 737, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !55, !69, !85, !85}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !83, line: 59, baseType: !84)
!83 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!84 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !83, line: 171, baseType: !5)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !62, file: !4, line: 740, baseType: !87, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !55, !69, !85, !85}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 1024, elements: !98)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !83, line: 99, baseType: !97)
!97 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!98 = !{!99}
!99 = !DISubrange(count: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !62, file: !4, line: 743, baseType: !101, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!104, !55, !69, !107, !85, !85, !85}
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !83, line: 227, baseType: !69)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !62, file: !4, line: 749, baseType: !109, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !55, !69, !107, !85, !85, !85}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !62, file: !4, line: 755, baseType: !52, size: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !62, file: !4, line: 756, baseType: !117, size: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!78, !55, !104, !85, !85, !107}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !62, file: !4, line: 761, baseType: !121, size: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!90, !55, !112, !85, !85, !107}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !62, file: !4, line: 766, baseType: !125, size: 64, offset: 576)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !55, !69}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !62, file: !4, line: 767, baseType: !52, size: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !62, file: !4, line: 774, baseType: !130, size: 64, offset: 704)
!130 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !57, file: !4, line: 241, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !134)
!134 = !{!135, !136, !137, !138, !139}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !133, file: !4, line: 677, baseType: !52, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !133, file: !4, line: 679, baseType: !130, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !133, file: !4, line: 680, baseType: !130, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !133, file: !4, line: 681, baseType: !69, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !133, file: !4, line: 682, baseType: !69, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !57, file: !4, line: 241, baseType: !107, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !57, file: !4, line: 241, baseType: !69, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !49, file: !4, line: 622, baseType: !125, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !49, file: !4, line: 624, baseType: !52, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !49, file: !4, line: 626, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !55, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !49, file: !4, line: 629, baseType: !52, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !49, file: !4, line: 634, baseType: !69, size: 32, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !49, file: !4, line: 639, baseType: !153, size: 640, offset: 352)
!153 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !49, file: !4, line: 636, size: 640, elements: !154)
!154 = !{!155, !159}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !153, file: !4, line: 637, baseType: !156, size: 256)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 8)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !153, file: !4, line: 638, baseType: !160, size: 640)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 640, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 80)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !49, file: !4, line: 643, baseType: !69, size: 32, offset: 992)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !49, file: !4, line: 651, baseType: !130, size: 64, offset: 1024)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !49, file: !4, line: 663, baseType: !166, size: 64, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !49, file: !4, line: 664, baseType: !69, size: 32, offset: 1152)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !49, file: !4, line: 668, baseType: !166, size: 64, offset: 1216)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !49, file: !4, line: 669, baseType: !69, size: 32, offset: 1280)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !49, file: !4, line: 670, baseType: !69, size: 32, offset: 1312)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !45, file: !4, line: 395, baseType: !61, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !45, file: !4, line: 395, baseType: !132, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !45, file: !4, line: 395, baseType: !107, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !45, file: !4, line: 395, baseType: !69, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !45, file: !4, line: 398, baseType: !179, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !4, line: 700, size: 448, elements: !181)
!181 = !{!182, !186, !187, !188, !192, !196, !200}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !180, file: !4, line: 701, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !83, line: 110, baseType: !84)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !180, file: !4, line: 702, baseType: !70, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !180, file: !4, line: 704, baseType: !40, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !180, file: !4, line: 705, baseType: !189, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!107, !43}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !180, file: !4, line: 706, baseType: !193, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !43, !130}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !180, file: !4, line: 707, baseType: !197, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!107, !43, !69}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !180, file: !4, line: 708, baseType: !40, size: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !45, file: !4, line: 403, baseType: !85, size: 32, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !45, file: !4, line: 404, baseType: !85, size: 32, offset: 352)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !45, file: !4, line: 405, baseType: !69, size: 32, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !45, file: !4, line: 406, baseType: !205, size: 32, offset: 416)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !45, file: !4, line: 413, baseType: !205, size: 32, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !45, file: !4, line: 415, baseType: !5, size: 32, offset: 480)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !45, file: !4, line: 415, baseType: !5, size: 32, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !45, file: !4, line: 417, baseType: !210, size: 64, offset: 576)
!210 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !45, file: !4, line: 419, baseType: !107, size: 32, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !45, file: !4, line: 420, baseType: !107, size: 32, offset: 672)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !45, file: !4, line: 422, baseType: !214, size: 32, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !45, file: !4, line: 423, baseType: !107, size: 32, offset: 736)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !45, file: !4, line: 424, baseType: !107, size: 32, offset: 768)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !45, file: !4, line: 426, baseType: !107, size: 32, offset: 800)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !45, file: !4, line: 428, baseType: !219, size: 32, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !4, line: 224, baseType: !18)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !45, file: !4, line: 429, baseType: !107, size: 32, offset: 864)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !45, file: !4, line: 430, baseType: !69, size: 32, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !45, file: !4, line: 432, baseType: !107, size: 32, offset: 928)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !45, file: !4, line: 433, baseType: !107, size: 32, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !45, file: !4, line: 434, baseType: !107, size: 32, offset: 992)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !45, file: !4, line: 442, baseType: !85, size: 32, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !45, file: !4, line: 443, baseType: !85, size: 32, offset: 1056)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !45, file: !4, line: 444, baseType: !69, size: 32, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !45, file: !4, line: 445, baseType: !69, size: 32, offset: 1120)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !45, file: !4, line: 449, baseType: !69, size: 32, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !45, file: !4, line: 461, baseType: !69, size: 32, offset: 1184)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !45, file: !4, line: 462, baseType: !78, size: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !45, file: !4, line: 472, baseType: !85, size: 32, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !45, file: !4, line: 477, baseType: !69, size: 32, offset: 1312)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !45, file: !4, line: 478, baseType: !85, size: 32, offset: 1344)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !45, file: !4, line: 484, baseType: !69, size: 32, offset: 1376)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !45, file: !4, line: 485, baseType: !85, size: 32, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !45, file: !4, line: 494, baseType: !238, size: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 2048, elements: !98)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !45, file: !4, line: 505, baseType: !241, size: 256, offset: 1536)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 256, elements: !251)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !245)
!245 = !{!246, !250}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !244, file: !4, line: 88, baseType: !247, size: 1024)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 1024, elements: !98)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !83, line: 147, baseType: !249)
!249 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !244, file: !4, line: 94, baseType: !107, size: 32, offset: 1024)
!251 = !{!252}
!252 = !DISubrange(count: 4)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !45, file: !4, line: 508, baseType: !254, size: 256, offset: 1792)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 256, elements: !251)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !258)
!258 = !{!259, !264, !268}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !257, file: !4, line: 102, baseType: !260, size: 136)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 136, elements: !262)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !83, line: 135, baseType: !84)
!262 = !{!263}
!263 = !DISubrange(count: 17)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !257, file: !4, line: 104, baseType: !265, size: 2048, offset: 136)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 2048, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !257, file: !4, line: 110, baseType: !107, size: 32, offset: 2208)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !45, file: !4, line: 509, baseType: !254, size: 256, offset: 2048)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !45, file: !4, line: 516, baseType: !69, size: 32, offset: 2304)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !45, file: !4, line: 518, baseType: !272, size: 64, offset: 2368)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !274, file: !4, line: 120, baseType: !69, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !274, file: !4, line: 121, baseType: !69, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !274, file: !4, line: 122, baseType: !69, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !274, file: !4, line: 123, baseType: !69, size: 32, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !274, file: !4, line: 124, baseType: !69, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !274, file: !4, line: 129, baseType: !69, size: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !274, file: !4, line: 130, baseType: !69, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !274, file: !4, line: 139, baseType: !85, size: 32, offset: 224)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !274, file: !4, line: 140, baseType: !85, size: 32, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !274, file: !4, line: 147, baseType: !69, size: 32, offset: 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !274, file: !4, line: 154, baseType: !85, size: 32, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !274, file: !4, line: 155, baseType: !85, size: 32, offset: 352)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !274, file: !4, line: 160, baseType: !107, size: 32, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !274, file: !4, line: 164, baseType: !69, size: 32, offset: 416)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !274, file: !4, line: 165, baseType: !69, size: 32, offset: 448)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !274, file: !4, line: 166, baseType: !69, size: 32, offset: 480)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !274, file: !4, line: 167, baseType: !69, size: 32, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !274, file: !4, line: 168, baseType: !69, size: 32, offset: 544)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !274, file: !4, line: 169, baseType: !69, size: 32, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !274, file: !4, line: 175, baseType: !242, size: 64, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !274, file: !4, line: 178, baseType: !68, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !45, file: !4, line: 521, baseType: !107, size: 32, offset: 2432)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !45, file: !4, line: 522, baseType: !107, size: 32, offset: 2464)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !45, file: !4, line: 524, baseType: !300, size: 128, offset: 2496)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 128, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 16)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !45, file: !4, line: 525, baseType: !300, size: 128, offset: 2624)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !45, file: !4, line: 526, baseType: !300, size: 128, offset: 2752)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !45, file: !4, line: 528, baseType: !5, size: 32, offset: 2880)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !45, file: !4, line: 533, baseType: !107, size: 32, offset: 2912)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !45, file: !4, line: 535, baseType: !261, size: 8, offset: 2944)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !45, file: !4, line: 536, baseType: !248, size: 16, offset: 2960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !45, file: !4, line: 537, baseType: !248, size: 16, offset: 2976)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !45, file: !4, line: 538, baseType: !107, size: 32, offset: 3008)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !45, file: !4, line: 539, baseType: !261, size: 8, offset: 3040)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !45, file: !4, line: 541, baseType: !107, size: 32, offset: 3072)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !45, file: !4, line: 550, baseType: !69, size: 32, offset: 3104)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !45, file: !4, line: 551, baseType: !69, size: 32, offset: 3136)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !45, file: !4, line: 553, baseType: !69, size: 32, offset: 3168)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !45, file: !4, line: 555, baseType: !85, size: 32, offset: 3200)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !45, file: !4, line: 564, baseType: !81, size: 64, offset: 3264)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !45, file: !4, line: 571, baseType: !69, size: 32, offset: 3328)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !45, file: !4, line: 572, baseType: !320, size: 256, offset: 3392)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 256, elements: !251)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !45, file: !4, line: 575, baseType: !85, size: 32, offset: 3648)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !45, file: !4, line: 576, baseType: !85, size: 32, offset: 3680)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !45, file: !4, line: 578, baseType: !69, size: 32, offset: 3712)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !45, file: !4, line: 579, baseType: !325, size: 320, offset: 3744)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 320, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 10)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !45, file: !4, line: 583, baseType: !69, size: 32, offset: 4064)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !45, file: !4, line: 583, baseType: !69, size: 32, offset: 4096)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !45, file: !4, line: 583, baseType: !69, size: 32, offset: 4128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !45, file: !4, line: 583, baseType: !69, size: 32, offset: 4160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !45, file: !4, line: 589, baseType: !69, size: 32, offset: 4192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !45, file: !4, line: 594, baseType: !334, size: 64, offset: 4224)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !24, line: 136, size: 192, elements: !336)
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_output_pass", scope: !335, file: !24, line: 137, baseType: !40, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output_pass", scope: !335, file: !24, line: 138, baseType: !40, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "is_dummy_pass", scope: !335, file: !24, line: 141, baseType: !107, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !45, file: !4, line: 595, baseType: !341, size: 64, offset: 4288)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !24, line: 157, size: 128, elements: !343)
!343 = !{!344, !349}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !342, file: !24, line: 158, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !43, !348}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !24, line: 22, baseType: !23)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !342, file: !24, line: 159, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !43, !78, !353, !85}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !45, file: !4, line: 596, baseType: !355, size: 64, offset: 4352)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !45, file: !4, line: 597, baseType: !357, size: 64, offset: 4416)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !24, line: 176, size: 128, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !358, file: !24, line: 177, baseType: !345, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_data", scope: !358, file: !24, line: 178, baseType: !362, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !43, !365, !353, !85, !78, !353, !85}
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !4, line: 68, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !45, file: !4, line: 598, baseType: !368, size: 64, offset: 4480)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !24, line: 145, size: 320, elements: !370)
!370 = !{!371, !375, !376, !377, !378, !379}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "consume_input", scope: !369, file: !24, line: 146, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!69, !43}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "reset_input_controller", scope: !369, file: !24, line: 147, baseType: !40, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !369, file: !24, line: 148, baseType: !40, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input_pass", scope: !369, file: !24, line: 149, baseType: !40, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "has_multiple_scans", scope: !369, file: !24, line: 152, baseType: !107, size: 32, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "eoi_reached", scope: !369, file: !24, line: 153, baseType: !107, size: 32, offset: 288)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !45, file: !4, line: 599, baseType: !381, size: 64, offset: 4544)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !24, line: 188, size: 1408, elements: !383)
!383 = !{!384, !385, !386, !388, !389, !391, !392, !393, !394}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "reset_marker_reader", scope: !382, file: !24, line: 189, baseType: !40, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "read_markers", scope: !382, file: !24, line: 194, baseType: !372, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "read_restart_marker", scope: !382, file: !24, line: 196, baseType: !387, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_marker_parser_method", file: !4, line: 781, baseType: !189)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "process_COM", scope: !382, file: !24, line: 198, baseType: !387, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "process_APPn", scope: !382, file: !24, line: 199, baseType: !390, size: 1024, offset: 256)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 1024, elements: !301)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOI", scope: !382, file: !24, line: 204, baseType: !107, size: 32, offset: 1280)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOF", scope: !382, file: !24, line: 205, baseType: !107, size: 32, offset: 1312)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "next_restart_num", scope: !382, file: !24, line: 206, baseType: !69, size: 32, offset: 1344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "discarded_bytes", scope: !382, file: !24, line: 207, baseType: !5, size: 32, offset: 1376)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !45, file: !4, line: 600, baseType: !396, size: 64, offset: 4608)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !24, line: 211, size: 128, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !397, file: !24, line: 212, baseType: !40, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mcu", scope: !397, file: !24, line: 213, baseType: !401, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!107, !43, !91}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !45, file: !4, line: 601, baseType: !405, size: 64, offset: 4672)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !24, line: 223, size: 704, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !406, file: !24, line: 224, baseType: !40, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_DCT", scope: !406, file: !24, line: 226, baseType: !410, size: 640, offset: 64)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 640, elements: !326)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "inverse_DCT_method_ptr", file: !24, line: 218, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !43, !272, !415, !78, !85}
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEFPTR", file: !4, line: 75, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !45, file: !4, line: 602, baseType: !418, size: 64, offset: 4736)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !24, line: 230, size: 192, elements: !420)
!420 = !{!421, !422, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !419, file: !24, line: 231, baseType: !40, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !419, file: !24, line: 232, baseType: !362, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !419, file: !24, line: 240, baseType: !107, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !45, file: !4, line: 603, baseType: !425, size: 64, offset: 4800)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !24, line: 244, size: 128, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !426, file: !24, line: 245, baseType: !40, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !426, file: !24, line: 246, baseType: !430, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !43, !365, !85, !78, !69}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !45, file: !4, line: 604, baseType: !434, size: 64, offset: 4864)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !24, line: 252, size: 256, elements: !436)
!436 = !{!437, !441, !445, !446}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !435, file: !24, line: 253, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !43, !107}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "color_quantize", scope: !435, file: !24, line: 254, baseType: !442, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !43, !78, !78, !69}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !435, file: !24, line: 257, baseType: !40, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "new_color_map", scope: !435, file: !24, line: 258, baseType: !40, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "consume_data", scope: !37, file: !24, line: 167, baseType: !372, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "start_output_pass", scope: !37, file: !24, line: 168, baseType: !40, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "decompress_data", scope: !37, file: !24, line: 169, baseType: !450, size: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!69, !43, !365}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "coef_arrays", scope: !37, file: !24, line: 172, baseType: !454, size: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_ctr", scope: !34, file: !1, line: 33, baseType: !85, size: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_vert_offset", scope: !34, file: !1, line: 34, baseType: !69, size: 32, offset: 352)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_per_iMCU_row", scope: !34, file: !1, line: 35, baseType: !69, size: 32, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_buffer", scope: !34, file: !1, line: 48, baseType: !459, size: 640, offset: 448)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 640, elements: !326)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "whole_image", scope: !34, file: !1, line: 52, baseType: !461, size: 640, offset: 1088)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 640, elements: !326)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits_latch", scope: !34, file: !1, line: 57, baseType: !463, size: 64, offset: 1728)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!464 = !{i32 7, !"Dwarf Version", i32 5}
!465 = !{i32 2, !"Debug Info Version", i32 3}
!466 = !{i32 1, !"wchar_size", i32 4}
!467 = !{i32 8, !"PIC Level", i32 2}
!468 = !{i32 7, !"PIE Level", i32 2}
!469 = !{i32 7, !"uwtable", i32 2}
!470 = !{i32 7, !"frame-pointer", i32 2}
!471 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!472 = distinct !DISubprogram(name: "jinit_d_coef_controller", scope: !1, file: !1, line: 675, type: !439, scopeLine: 676, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !473)
!473 = !{}
!474 = !DILocalVariable(name: "cinfo", arg: 1, scope: !472, file: !1, line: 675, type: !43)
!475 = !DILocation(line: 675, column: 43, scope: !472)
!476 = !DILocalVariable(name: "need_full_buffer", arg: 2, scope: !472, file: !1, line: 675, type: !107)
!477 = !DILocation(line: 675, column: 58, scope: !472)
!478 = !DILocalVariable(name: "coef", scope: !472, file: !1, line: 677, type: !31)
!479 = !DILocation(line: 677, column: 15, scope: !472)
!480 = !DILocation(line: 680, column: 7, scope: !472)
!481 = !DILocation(line: 680, column: 14, scope: !472)
!482 = !DILocation(line: 680, column: 19, scope: !472)
!483 = !DILocation(line: 680, column: 48, scope: !472)
!484 = !DILocation(line: 680, column: 5, scope: !472)
!485 = !DILocation(line: 679, column: 8, scope: !472)
!486 = !DILocation(line: 682, column: 51, scope: !472)
!487 = !DILocation(line: 682, column: 3, scope: !472)
!488 = !DILocation(line: 682, column: 10, scope: !472)
!489 = !DILocation(line: 682, column: 15, scope: !472)
!490 = !DILocation(line: 683, column: 3, scope: !472)
!491 = !DILocation(line: 683, column: 9, scope: !472)
!492 = !DILocation(line: 683, column: 13, scope: !472)
!493 = !DILocation(line: 683, column: 30, scope: !472)
!494 = !DILocation(line: 684, column: 3, scope: !472)
!495 = !DILocation(line: 684, column: 9, scope: !472)
!496 = !DILocation(line: 684, column: 13, scope: !472)
!497 = !DILocation(line: 684, column: 31, scope: !472)
!498 = !DILocation(line: 686, column: 3, scope: !472)
!499 = !DILocation(line: 686, column: 9, scope: !472)
!500 = !DILocation(line: 686, column: 25, scope: !472)
!501 = !DILocation(line: 690, column: 7, scope: !502)
!502 = distinct !DILexicalBlock(scope: !472, file: !1, line: 690, column: 7)
!503 = !DILocalVariable(name: "ci", scope: !504, file: !1, line: 695, type: !69)
!504 = distinct !DILexicalBlock(scope: !502, file: !1, line: 690, column: 25)
!505 = !DILocation(line: 695, column: 9, scope: !504)
!506 = !DILocalVariable(name: "access_rows", scope: !504, file: !1, line: 695, type: !69)
!507 = !DILocation(line: 695, column: 13, scope: !504)
!508 = !DILocalVariable(name: "compptr", scope: !504, file: !1, line: 696, type: !272)
!509 = !DILocation(line: 696, column: 26, scope: !504)
!510 = !DILocation(line: 698, column: 13, scope: !511)
!511 = distinct !DILexicalBlock(scope: !504, file: !1, line: 698, column: 5)
!512 = !DILocation(line: 698, column: 28, scope: !511)
!513 = !DILocation(line: 698, column: 35, scope: !511)
!514 = !DILocation(line: 698, column: 26, scope: !511)
!515 = !DILocation(line: 698, column: 10, scope: !511)
!516 = !DILocation(line: 698, column: 46, scope: !517)
!517 = distinct !DILexicalBlock(scope: !511, file: !1, line: 698, column: 5)
!518 = !DILocation(line: 698, column: 51, scope: !517)
!519 = !DILocation(line: 698, column: 58, scope: !517)
!520 = !DILocation(line: 698, column: 49, scope: !517)
!521 = !DILocation(line: 698, column: 5, scope: !511)
!522 = !DILocation(line: 700, column: 21, scope: !523)
!523 = distinct !DILexicalBlock(scope: !517, file: !1, line: 699, column: 20)
!524 = !DILocation(line: 700, column: 30, scope: !523)
!525 = !DILocation(line: 700, column: 19, scope: !523)
