; ModuleID = 'cBench/consumer_jpeg_c/src/jdhuff.c'
source_filename = "cBench/consumer_jpeg_c/src/jdhuff.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_decompress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], i32, ptr, i32, i32, [16 x i8], [16 x i8], [16 x i8], i32, i32, i8, i16, i16, i32, i8, i32, i32, i32, i32, i32, ptr, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.d_derived_tbl = type { [17 x i64], [18 x i64], [17 x i32], ptr, [256 x i32], [256 x i8] }
%struct.JHUFF_TBL = type { [17 x i8], [256 x i8], i32 }
%struct.bitread_working_state = type { ptr, i64, i32, i64, i32, ptr, ptr }
%struct.jpeg_source_mgr = type { ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.huff_entropy_decoder = type { %struct.jpeg_entropy_decoder, %struct.bitread_perm_state, %struct.savable_state, i32, [4 x ptr], [4 x ptr] }

!74 = !DIEnumerator(name: "JERR_HUFF_MISSING_CODE", value: 39)
!75 = !DIEnumerator(name: "JERR_IMAGE_TOO_BIG", value: 40)
!76 = !DIEnumerator(name: "JERR_INPUT_EMPTY", value: 41)
!77 = !DIEnumerator(name: "JERR_INPUT_EOF", value: 42)
!78 = !DIEnumerator(name: "JERR_MISMATCHED_QUANT_TABLE", value: 43)
!79 = !DIEnumerator(name: "JERR_MISSING_DATA", value: 44)
!80 = !DIEnumerator(name: "JERR_MODE_CHANGE", value: 45)
!81 = !DIEnumerator(name: "JERR_NOTIMPL", value: 46)
!82 = !DIEnumerator(name: "JERR_NOT_COMPILED", value: 47)
!83 = !DIEnumerator(name: "JERR_NO_BACKING_STORE", value: 48)
!84 = !DIEnumerator(name: "JERR_NO_HUFF_TABLE", value: 49)
!85 = !DIEnumerator(name: "JERR_NO_IMAGE", value: 50)
!86 = !DIEnumerator(name: "JERR_NO_QUANT_TABLE", value: 51)
!87 = !DIEnumerator(name: "JERR_NO_SOI", value: 52)
!88 = !DIEnumerator(name: "JERR_OUT_OF_MEMORY", value: 53)
!89 = !DIEnumerator(name: "JERR_QUANT_COMPONENTS", value: 54)
!90 = !DIEnumerator(name: "JERR_QUANT_FEW_COLORS", value: 55)
!91 = !DIEnumerator(name: "JERR_QUANT_MANY_COLORS", value: 56)
!92 = !DIEnumerator(name: "JERR_SOF_DUPLICATE", value: 57)
!93 = !DIEnumerator(name: "JERR_SOF_NO_SOS", value: 58)
!94 = !DIEnumerator(name: "JERR_SOF_UNSUPPORTED", value: 59)
!95 = !DIEnumerator(name: "JERR_SOI_DUPLICATE", value: 60)
!96 = !DIEnumerator(name: "JERR_SOS_NO_SOF", value: 61)
!97 = !DIEnumerator(name: "JERR_TFILE_CREATE", value: 62)
!98 = !DIEnumerator(name: "JERR_TFILE_READ", value: 63)
!99 = !DIEnumerator(name: "JERR_TFILE_SEEK", value: 64)
!100 = !DIEnumerator(name: "JERR_TFILE_WRITE", value: 65)
!101 = !DIEnumerator(name: "JERR_TOO_LITTLE_DATA", value: 66)
!102 = !DIEnumerator(name: "JERR_UNKNOWN_MARKER", value: 67)
!103 = !DIEnumerator(name: "JERR_VIRTUAL_BUG", value: 68)
!104 = !DIEnumerator(name: "JERR_WIDTH_OVERFLOW", value: 69)
!105 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!106 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!107 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!108 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!109 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!110 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!111 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!112 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!113 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!114 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!115 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!116 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!117 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!118 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!119 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!120 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!121 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!122 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!123 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!124 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!125 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!126 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!127 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!128 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!129 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!130 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!131 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!132 = !DIEnumerator(name: "JTRC_RST", value: 97)
!133 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!134 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!135 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!136 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!137 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!138 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!139 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!140 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!141 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!142 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!143 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!144 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!145 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!146 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!147 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!148 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!149 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!150 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!151 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!152 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!153 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!154 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!155 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!156 = !{!157, !158, !195, !250, !176, !217, !315, !551, !274}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "d_derived_tbl", file: !160, line: 43, baseType: !161)
!160 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jdhuff.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "ae4ee10e9000ceb58d3d7f8a964b87b0")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 26, size: 13120, elements: !162)
!162 = !{!163, !170, !174, !177, !192, !194}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mincode", scope: !161, file: !160, line: 28, baseType: !164, size: 1088)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 1088, elements: !168)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !166, line: 161, baseType: !167)
!166 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!167 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!168 = !{!169}
!169 = !DISubrange(count: 17)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "maxcode", scope: !161, file: !160, line: 29, baseType: !171, size: 1152, offset: 1088)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 1152, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 18)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "valptr", scope: !161, file: !160, line: 31, baseType: !175, size: 544, offset: 2240)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 544, elements: !168)
!176 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !161, file: !160, line: 34, baseType: !178, size: 64, offset: 2816)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !6, line: 111, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 100, size: 2240, elements: !181)
!181 = !{!182, !186, !190}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !180, file: !6, line: 102, baseType: !183, size: 136)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 136, elements: !168)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !166, line: 135, baseType: !185)
!185 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !180, file: !6, line: 104, baseType: !187, size: 2048, offset: 136)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 2048, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !180, file: !6, line: 110, baseType: !191, size: 32, offset: 2208)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !166, line: 227, baseType: !176)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "look_nbits", scope: !161, file: !160, line: 41, baseType: !193, size: 8192, offset: 2880)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 8192, elements: !188)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "look_sym", scope: !161, file: !160, line: 42, baseType: !187, size: 2048, offset: 11072)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !6, line: 248, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !6, line: 240, size: 256, elements: !198)
!198 = !{!199, !242, !304, !313, !314}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !197, file: !6, line: 241, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !6, line: 618, size: 1344, elements: !202)
!202 = !{!203, !207, !211, !212, !218, !219, !220, !231, !232, !233, !238, !239, !240, !241}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !201, file: !6, line: 620, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !195}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !201, file: !6, line: 622, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !195, !176}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !201, file: !6, line: 624, baseType: !204, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !201, file: !6, line: 626, baseType: !213, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !195, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !201, file: !6, line: 629, baseType: !204, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !201, file: !6, line: 634, baseType: !176, size: 32, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !201, file: !6, line: 639, baseType: !221, size: 640, offset: 352)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !201, file: !6, line: 636, size: 640, elements: !222)
!222 = !{!223, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !221, file: !6, line: 637, baseType: !224, size: 256)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 256, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 8)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !221, file: !6, line: 638, baseType: !228, size: 640)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 640, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 80)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !201, file: !6, line: 643, baseType: !176, size: 32, offset: 992)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !201, file: !6, line: 651, baseType: !167, size: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !201, file: !6, line: 663, baseType: !234, size: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !201, file: !6, line: 664, baseType: !176, size: 32, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !201, file: !6, line: 668, baseType: !234, size: 64, offset: 1216)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !201, file: !6, line: 669, baseType: !176, size: 32, offset: 1280)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !201, file: !6, line: 670, baseType: !176, size: 32, offset: 1312)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !197, file: !6, line: 241, baseType: !243, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !6, line: 731, size: 768, elements: !245)
!245 = !{!246, !253, !254, !264, !278, !285, !292, !293, !297, !301, !302, !303}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !244, file: !6, line: 733, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!157, !195, !176, !250}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !251, line: 18, baseType: !252)
!251 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!252 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !244, file: !6, line: 735, baseType: !247, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !244, file: !6, line: 737, baseType: !255, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!258, !195, !176, !263, !263}
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !6, line: 67, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !6, line: 66, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !166, line: 59, baseType: !185)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !166, line: 171, baseType: !7)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !244, file: !6, line: 740, baseType: !265, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!268, !195, !176, !263, !263}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !6, line: 72, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !6, line: 71, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !6, line: 70, baseType: !273)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1024, elements: !276)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !166, line: 99, baseType: !275)
!275 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!276 = !{!277}
!277 = !DISubrange(count: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !244, file: !6, line: 743, baseType: !279, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !195, !176, !191, !263, !263, !263}
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !6, line: 727, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !6, line: 727, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !244, file: !6, line: 749, baseType: !286, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!289, !195, !176, !191, !263, !263, !263}
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !6, line: 728, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !6, line: 728, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !244, file: !6, line: 755, baseType: !204, size: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !244, file: !6, line: 756, baseType: !294, size: 64, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!258, !195, !282, !263, !263, !191}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !244, file: !6, line: 761, baseType: !298, size: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!268, !195, !289, !263, !263, !191}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !244, file: !6, line: 766, baseType: !208, size: 64, offset: 576)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !244, file: !6, line: 767, baseType: !204, size: 64, offset: 640)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !244, file: !6, line: 774, baseType: !167, size: 64, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !197, file: !6, line: 241, baseType: !305, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !6, line: 676, size: 256, elements: !307)
!307 = !{!308, !309, !310, !311, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !306, file: !6, line: 677, baseType: !204, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !306, file: !6, line: 679, baseType: !167, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !306, file: !6, line: 680, baseType: !167, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !306, file: !6, line: 681, baseType: !176, size: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !306, file: !6, line: 682, baseType: !176, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !197, file: !6, line: 241, baseType: !191, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !197, file: !6, line: 241, baseType: !176, size: 32, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "huff_entropy_ptr", file: !3, line: 69, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "huff_entropy_decoder", file: !3, line: 67, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 52, size: 960, elements: !319)
!319 = !{!320, !599, !607, !613, !614, !616}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !318, file: !3, line: 53, baseType: !321, size: 128)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !26, line: 211, size: 128, elements: !322)
!322 = !{!323, !595}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !321, file: !26, line: 212, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !327}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !6, line: 250, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !6, line: 394, size: 4928, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !359, !360, !361, !362, !364, !365, !366, !367, !369, !370, !371, !373, !374, !375, !376, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !398, !411, !413, !414, !415, !441, !442, !443, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !465, !466, !467, !468, !472, !473, !474, !475, !476, !477, !484, !498, !516, !525, !535, !550, !552, !565, !572, !581}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !329, file: !6, line: 395, baseType: !200, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !329, file: !6, line: 395, baseType: !243, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !329, file: !6, line: 395, baseType: !305, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !329, file: !6, line: 395, baseType: !191, size: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !329, file: !6, line: 395, baseType: !176, size: 32, offset: 224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !329, file: !6, line: 398, baseType: !337, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !6, line: 700, size: 448, elements: !339)
!339 = !{!340, !344, !345, !346, !350, !354, !358}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !338, file: !6, line: 701, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !166, line: 110, baseType: !185)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !338, file: !6, line: 702, baseType: !250, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !338, file: !6, line: 704, baseType: !324, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !338, file: !6, line: 705, baseType: !347, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!191, !327}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !338, file: !6, line: 706, baseType: !351, size: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !327, !167}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !338, file: !6, line: 707, baseType: !355, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!191, !327, !176}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !338, file: !6, line: 708, baseType: !324, size: 64, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !329, file: !6, line: 403, baseType: !263, size: 32, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !329, file: !6, line: 404, baseType: !263, size: 32, offset: 352)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !329, file: !6, line: 405, baseType: !176, size: 32, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !329, file: !6, line: 406, baseType: !363, size: 32, offset: 416)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !6, line: 201, baseType: !5)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !329, file: !6, line: 413, baseType: !363, size: 32, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !329, file: !6, line: 415, baseType: !7, size: 32, offset: 480)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !329, file: !6, line: 415, baseType: !7, size: 32, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !329, file: !6, line: 417, baseType: !368, size: 64, offset: 576)
!368 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !329, file: !6, line: 419, baseType: !191, size: 32, offset: 640)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !329, file: !6, line: 420, baseType: !191, size: 32, offset: 672)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !329, file: !6, line: 422, baseType: !372, size: 32, offset: 704)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !6, line: 209, baseType: !15)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !329, file: !6, line: 423, baseType: !191, size: 32, offset: 736)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !329, file: !6, line: 424, baseType: !191, size: 32, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !329, file: !6, line: 426, baseType: !191, size: 32, offset: 800)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !329, file: !6, line: 428, baseType: !377, size: 32, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !6, line: 224, baseType: !20)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !329, file: !6, line: 429, baseType: !191, size: 32, offset: 864)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !329, file: !6, line: 430, baseType: !176, size: 32, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !329, file: !6, line: 432, baseType: !191, size: 32, offset: 928)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !329, file: !6, line: 433, baseType: !191, size: 32, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !329, file: !6, line: 434, baseType: !191, size: 32, offset: 992)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !329, file: !6, line: 442, baseType: !263, size: 32, offset: 1024)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !329, file: !6, line: 443, baseType: !263, size: 32, offset: 1056)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !329, file: !6, line: 444, baseType: !176, size: 32, offset: 1088)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !329, file: !6, line: 445, baseType: !176, size: 32, offset: 1120)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !329, file: !6, line: 449, baseType: !176, size: 32, offset: 1152)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !329, file: !6, line: 461, baseType: !176, size: 32, offset: 1184)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !329, file: !6, line: 462, baseType: !258, size: 64, offset: 1216)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !329, file: !6, line: 472, baseType: !263, size: 32, offset: 1280)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !329, file: !6, line: 477, baseType: !176, size: 32, offset: 1312)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !329, file: !6, line: 478, baseType: !263, size: 32, offset: 1344)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !329, file: !6, line: 484, baseType: !176, size: 32, offset: 1376)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !329, file: !6, line: 485, baseType: !263, size: 32, offset: 1408)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !329, file: !6, line: 494, baseType: !396, size: 64, offset: 1472)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 2048, elements: !276)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !329, file: !6, line: 505, baseType: !399, size: 256, offset: 1536)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 256, elements: !409)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !6, line: 95, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 83, size: 1056, elements: !403)
!403 = !{!404, !408}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !402, file: !6, line: 88, baseType: !405, size: 1024)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 1024, elements: !276)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !166, line: 147, baseType: !407)
!407 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !402, file: !6, line: 94, baseType: !191, size: 32, offset: 1024)
!409 = !{!410}
!410 = !DISubrange(count: 4)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !329, file: !6, line: 508, baseType: !412, size: 256, offset: 1792)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 256, elements: !409)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !329, file: !6, line: 509, baseType: !412, size: 256, offset: 2048)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !329, file: !6, line: 516, baseType: !176, size: 32, offset: 2304)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !329, file: !6, line: 518, baseType: !416, size: 64, offset: 2368)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !6, line: 179, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 116, size: 768, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !418, file: !6, line: 120, baseType: !176, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !418, file: !6, line: 121, baseType: !176, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !418, file: !6, line: 122, baseType: !176, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !418, file: !6, line: 123, baseType: !176, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !418, file: !6, line: 124, baseType: !176, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !418, file: !6, line: 129, baseType: !176, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !418, file: !6, line: 130, baseType: !176, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !418, file: !6, line: 139, baseType: !263, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !418, file: !6, line: 140, baseType: !263, size: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !418, file: !6, line: 147, baseType: !176, size: 32, offset: 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !418, file: !6, line: 154, baseType: !263, size: 32, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !418, file: !6, line: 155, baseType: !263, size: 32, offset: 352)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !418, file: !6, line: 160, baseType: !191, size: 32, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !418, file: !6, line: 164, baseType: !176, size: 32, offset: 416)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !418, file: !6, line: 165, baseType: !176, size: 32, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !418, file: !6, line: 166, baseType: !176, size: 32, offset: 480)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !418, file: !6, line: 167, baseType: !176, size: 32, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !418, file: !6, line: 168, baseType: !176, size: 32, offset: 544)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !418, file: !6, line: 169, baseType: !176, size: 32, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !418, file: !6, line: 175, baseType: !400, size: 64, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !418, file: !6, line: 178, baseType: !157, size: 64, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !329, file: !6, line: 521, baseType: !191, size: 32, offset: 2432)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !329, file: !6, line: 522, baseType: !191, size: 32, offset: 2464)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !329, file: !6, line: 524, baseType: !444, size: 128, offset: 2496)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 16)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !329, file: !6, line: 525, baseType: !444, size: 128, offset: 2624)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !329, file: !6, line: 526, baseType: !444, size: 128, offset: 2752)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !329, file: !6, line: 528, baseType: !7, size: 32, offset: 2880)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !329, file: !6, line: 533, baseType: !191, size: 32, offset: 2912)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !329, file: !6, line: 535, baseType: !184, size: 8, offset: 2944)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !329, file: !6, line: 536, baseType: !406, size: 16, offset: 2960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !329, file: !6, line: 537, baseType: !406, size: 16, offset: 2976)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !329, file: !6, line: 538, baseType: !191, size: 32, offset: 3008)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !329, file: !6, line: 539, baseType: !184, size: 8, offset: 3040)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !329, file: !6, line: 541, baseType: !191, size: 32, offset: 3072)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !329, file: !6, line: 550, baseType: !176, size: 32, offset: 3104)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !329, file: !6, line: 551, baseType: !176, size: 32, offset: 3136)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !329, file: !6, line: 553, baseType: !176, size: 32, offset: 3168)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !329, file: !6, line: 555, baseType: !263, size: 32, offset: 3200)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !329, file: !6, line: 564, baseType: !261, size: 64, offset: 3264)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !329, file: !6, line: 571, baseType: !176, size: 32, offset: 3328)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !329, file: !6, line: 572, baseType: !464, size: 256, offset: 3392)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 256, elements: !409)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !329, file: !6, line: 575, baseType: !263, size: 32, offset: 3648)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !329, file: !6, line: 576, baseType: !263, size: 32, offset: 3680)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !329, file: !6, line: 578, baseType: !176, size: 32, offset: 3712)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !329, file: !6, line: 579, baseType: !469, size: 320, offset: 3744)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 320, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 10)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !329, file: !6, line: 583, baseType: !176, size: 32, offset: 4064)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !329, file: !6, line: 583, baseType: !176, size: 32, offset: 4096)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !329, file: !6, line: 583, baseType: !176, size: 32, offset: 4128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !329, file: !6, line: 583, baseType: !176, size: 32, offset: 4160)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !329, file: !6, line: 589, baseType: !176, size: 32, offset: 4192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !329, file: !6, line: 594, baseType: !478, size: 64, offset: 4224)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !26, line: 136, size: 192, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_output_pass", scope: !479, file: !26, line: 137, baseType: !324, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output_pass", scope: !479, file: !26, line: 138, baseType: !324, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "is_dummy_pass", scope: !479, file: !26, line: 141, baseType: !191, size: 32, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !329, file: !6, line: 595, baseType: !485, size: 64, offset: 4288)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !26, line: 157, size: 128, elements: !487)
!487 = !{!488, !493}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !486, file: !26, line: 158, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !327, !492}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !26, line: 22, baseType: !25)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !486, file: !26, line: 159, baseType: !494, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !327, !258, !497, !263}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !329, file: !6, line: 596, baseType: !499, size: 64, offset: 4352)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !26, line: 165, size: 320, elements: !501)
!501 = !{!502, !503, !507, !508, !514}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !500, file: !26, line: 166, baseType: !324, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "consume_data", scope: !500, file: !26, line: 167, baseType: !504, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!176, !327}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "start_output_pass", scope: !500, file: !26, line: 168, baseType: !324, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "decompress_data", scope: !500, file: !26, line: 169, baseType: !509, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!176, !327, !512}
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !6, line: 68, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "coef_arrays", scope: !500, file: !26, line: 172, baseType: !515, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !329, file: !6, line: 597, baseType: !517, size: 64, offset: 4416)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !26, line: 176, size: 128, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !518, file: !26, line: 177, baseType: !489, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_data", scope: !518, file: !26, line: 178, baseType: !522, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !327, !512, !497, !263, !258, !497, !263}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !329, file: !6, line: 598, baseType: !526, size: 64, offset: 4480)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !26, line: 145, size: 320, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "consume_input", scope: !527, file: !26, line: 146, baseType: !504, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "reset_input_controller", scope: !527, file: !26, line: 147, baseType: !324, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !527, file: !26, line: 148, baseType: !324, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input_pass", scope: !527, file: !26, line: 149, baseType: !324, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "has_multiple_scans", scope: !527, file: !26, line: 152, baseType: !191, size: 32, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "eoi_reached", scope: !527, file: !26, line: 153, baseType: !191, size: 32, offset: 288)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !329, file: !6, line: 599, baseType: !536, size: 64, offset: 4544)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !26, line: 188, size: 1408, elements: !538)
!538 = !{!539, !540, !541, !543, !544, !546, !547, !548, !549}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "reset_marker_reader", scope: !537, file: !26, line: 189, baseType: !324, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "read_markers", scope: !537, file: !26, line: 194, baseType: !504, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "read_restart_marker", scope: !537, file: !26, line: 196, baseType: !542, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_marker_parser_method", file: !6, line: 781, baseType: !347)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "process_COM", scope: !537, file: !26, line: 198, baseType: !542, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "process_APPn", scope: !537, file: !26, line: 199, baseType: !545, size: 1024, offset: 256)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 1024, elements: !445)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOI", scope: !537, file: !26, line: 204, baseType: !191, size: 32, offset: 1280)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOF", scope: !537, file: !26, line: 205, baseType: !191, size: 32, offset: 1312)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next_restart_num", scope: !537, file: !26, line: 206, baseType: !176, size: 32, offset: 1344)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "discarded_bytes", scope: !537, file: !26, line: 207, baseType: !7, size: 32, offset: 1376)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !329, file: !6, line: 600, baseType: !551, size: 64, offset: 4608)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !329, file: !6, line: 601, baseType: !553, size: 64, offset: 4672)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !26, line: 223, size: 704, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !554, file: !26, line: 224, baseType: !324, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_DCT", scope: !554, file: !26, line: 226, baseType: !558, size: 640, offset: 64)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 640, elements: !470)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "inverse_DCT_method_ptr", file: !26, line: 218, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !327, !416, !563, !258, !263}
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEFPTR", file: !6, line: 75, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !329, file: !6, line: 602, baseType: !566, size: 64, offset: 4736)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !26, line: 230, size: 192, elements: !568)
!568 = !{!569, !570, !571}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !567, file: !26, line: 231, baseType: !324, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !567, file: !26, line: 232, baseType: !522, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !567, file: !26, line: 240, baseType: !191, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !329, file: !6, line: 603, baseType: !573, size: 64, offset: 4800)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !26, line: 244, size: 128, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !574, file: !26, line: 245, baseType: !324, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !574, file: !26, line: 246, baseType: !578, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !327, !512, !263, !258, !176}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !329, file: !6, line: 604, baseType: !582, size: 64, offset: 4864)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !26, line: 252, size: 256, elements: !584)
!584 = !{!585, !589, !593, !594}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !583, file: !26, line: 253, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !327, !191}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "color_quantize", scope: !583, file: !26, line: 254, baseType: !590, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !327, !258, !258, !176}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !583, file: !26, line: 257, baseType: !324, size: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "new_color_map", scope: !583, file: !26, line: 258, baseType: !324, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mcu", scope: !321, file: !26, line: 213, baseType: !596, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!191, !327, !269}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bitstate", scope: !318, file: !3, line: 58, baseType: !600, size: 128, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitread_perm_state", file: !160, line: 82, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 78, size: 128, elements: !602)
!602 = !{!603, !605, !606}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !601, file: !160, line: 79, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "bit_buf_type", file: !160, line: 68, baseType: !165)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "bits_left", scope: !601, file: !160, line: 80, baseType: !176, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "printed_eod", scope: !601, file: !160, line: 81, baseType: !191, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !318, file: !3, line: 59, baseType: !608, size: 128, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "savable_state", file: !3, line: 32, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 30, size: 128, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "last_dc_val", scope: !609, file: !3, line: 31, baseType: !612, size: 128)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, elements: !409)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "restarts_to_go", scope: !318, file: !3, line: 62, baseType: !7, size: 32, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dc_derived_tbls", scope: !318, file: !3, line: 65, baseType: !615, size: 256, offset: 448)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 256, elements: !409)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ac_derived_tbls", scope: !318, file: !3, line: 66, baseType: !615, size: 256, offset: 704)
!617 = !{!0, !618}
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "extend_offset", scope: !2, file: !3, line: 378, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 512, elements: !445)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!622 = !{i32 7, !"Dwarf Version", i32 5}
!623 = !{i32 2, !"Debug Info Version", i32 3}
!624 = !{i32 1, !"wchar_size", i32 4}
!625 = !{i32 8, !"PIC Level", i32 2}
!626 = !{i32 7, !"PIE Level", i32 2}
!627 = !{i32 7, !"uwtable", i32 2}
!628 = !{i32 7, !"frame-pointer", i32 2}
!629 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!630 = distinct !DISubprogram(name: "jpeg_make_d_derived_tbl", scope: !3, file: !3, line: 128, type: !631, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !634)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !327, !178, !633}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!634 = !{}
!635 = !DILocalVariable(name: "cinfo", arg: 1, scope: !630, file: !3, line: 128, type: !327)
!636 = !DILocation(line: 128, column: 43, scope: !630)
!637 = !DILocalVariable(name: "htbl", arg: 2, scope: !630, file: !3, line: 128, type: !178)
!638 = !DILocation(line: 128, column: 62, scope: !630)
!639 = !DILocalVariable(name: "pdtbl", arg: 3, scope: !630, file: !3, line: 129, type: !633)
!640 = !DILocation(line: 129, column: 22, scope: !630)
!641 = !DILocalVariable(name: "dtbl", scope: !630, file: !3, line: 131, type: !158)
!642 = !DILocation(line: 131, column: 18, scope: !630)
!643 = !DILocalVariable(name: "p", scope: !630, file: !3, line: 132, type: !176)
!644 = !DILocation(line: 132, column: 7, scope: !630)
!645 = !DILocalVariable(name: "i", scope: !630, file: !3, line: 132, type: !176)
!646 = !DILocation(line: 132, column: 10, scope: !630)
!647 = !DILocalVariable(name: "l", scope: !630, file: !3, line: 132, type: !176)
!648 = !DILocation(line: 132, column: 13, scope: !630)
!649 = !DILocalVariable(name: "si", scope: !630, file: !3, line: 132, type: !176)
!650 = !DILocation(line: 132, column: 16, scope: !630)
!651 = !DILocalVariable(name: "lookbits", scope: !630, file: !3, line: 133, type: !176)
!652 = !DILocation(line: 133, column: 7, scope: !630)
!653 = !DILocalVariable(name: "ctr", scope: !630, file: !3, line: 133, type: !176)
!654 = !DILocation(line: 133, column: 17, scope: !630)
!655 = !DILocalVariable(name: "huffsize", scope: !630, file: !3, line: 134, type: !656)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 2056, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 257)
!659 = !DILocation(line: 134, column: 8, scope: !630)
!660 = !DILocalVariable(name: "huffcode", scope: !630, file: !3, line: 135, type: !661)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8224, elements: !657)
!662 = !DILocation(line: 135, column: 16, scope: !630)
!663 = !DILocalVariable(name: "code", scope: !630, file: !3, line: 136, type: !7)
!664 = !DILocation(line: 136, column: 16, scope: !630)
!665 = !DILocation(line: 139, column: 8, scope: !666)
!666 = distinct !DILexicalBlock(scope: !630, file: !3, line: 139, column: 7)
!667 = !DILocation(line: 139, column: 7, scope: !666)
!668 = !DILocation(line: 139, column: 14, scope: !666)
!669 = !DILocation(line: 141, column: 9, scope: !666)
!670 = !DILocation(line: 141, column: 16, scope: !666)
!671 = !DILocation(line: 141, column: 21, scope: !666)
!672 = !DILocation(line: 141, column: 50, scope: !666)
!673 = !DILocation(line: 141, column: 7, scope: !666)
!674 = !DILocation(line: 140, column: 6, scope: !666)
!675 = !DILocation(line: 140, column: 12, scope: !666)
!676 = !DILocation(line: 140, column: 5, scope: !666)
!677 = !DILocation(line: 143, column: 11, scope: !630)
!678 = !DILocation(line: 143, column: 10, scope: !630)
!679 = !DILocation(line: 143, column: 8, scope: !630)
!680 = !DILocation(line: 144, column: 15, scope: !630)
!681 = !DILocation(line: 144, column: 3, scope: !630)
!682 = !DILocation(line: 144, column: 9, scope: !630)
!683 = !DILocation(line: 144, column: 13, scope: !630)
!684 = !DILocation(line: 149, column: 5, scope: !630)
!685 = !DILocation(line: 150, column: 10, scope: !686)
!686 = distinct !DILexicalBlock(scope: !630, file: !3, line: 150, column: 3)
!687 = !DILocation(line: 150, column: 8, scope: !686)
!688 = !DILocation(line: 150, column: 15, scope: !689)
!689 = distinct !DILexicalBlock(scope: !686, file: !3, line: 150, column: 3)
!690 = !DILocation(line: 150, column: 17, scope: !689)
!691 = !DILocation(line: 150, column: 3, scope: !686)
!692 = !DILocation(line: 151, column: 12, scope: !693)
!693 = distinct !DILexicalBlock(scope: !694, file: !3, line: 151, column: 5)
!694 = distinct !DILexicalBlock(scope: !689, file: !3, line: 150, column: 29)
!695 = !DILocation(line: 151, column: 10, scope: !693)
!696 = !DILocation(line: 151, column: 17, scope: !697)
!697 = distinct !DILexicalBlock(scope: !693, file: !3, line: 151, column: 5)
!698 = !DILocation(line: 151, column: 28, scope: !697)
!699 = !DILocation(line: 151, column: 34, scope: !697)
!700 = !DILocation(line: 151, column: 39, scope: !697)
!701 = !DILocation(line: 151, column: 22, scope: !697)
!702 = !DILocation(line: 151, column: 19, scope: !697)
!703 = !DILocation(line: 151, column: 5, scope: !693)
!704 = !DILocation(line: 152, column: 30, scope: !697)
!705 = !DILocation(line: 152, column: 23, scope: !697)
!706 = !DILocation(line: 152, column: 17, scope: !697)
!707 = !DILocation(line: 152, column: 7, scope: !697)
!708 = !DILocation(line: 152, column: 21, scope: !697)
!709 = !DILocation(line: 151, column: 44, scope: !697)
!710 = !DILocation(line: 151, column: 5, scope: !697)
!711 = distinct !{!711, !703, !712, !713}
!712 = !DILocation(line: 152, column: 30, scope: !693)
!713 = !{!"llvm.loop.mustprogress"}
!714 = !DILocation(line: 153, column: 3, scope: !694)
!715 = !DILocation(line: 150, column: 25, scope: !689)
!716 = !DILocation(line: 150, column: 3, scope: !689)
!717 = distinct !{!717, !691, !718, !713}
!718 = !DILocation(line: 153, column: 3, scope: !686)
!719 = !DILocation(line: 154, column: 12, scope: !630)
!720 = !DILocation(line: 154, column: 3, scope: !630)
!721 = !DILocation(line: 154, column: 15, scope: !630)
!722 = !DILocation(line: 159, column: 8, scope: !630)
!723 = !DILocation(line: 160, column: 8, scope: !630)
!724 = !DILocation(line: 160, column: 6, scope: !630)
!725 = !DILocation(line: 161, column: 5, scope: !630)
!726 = !DILocation(line: 162, column: 3, scope: !630)
!727 = !DILocation(line: 162, column: 19, scope: !630)
!728 = !DILocation(line: 162, column: 10, scope: !630)
!729 = !DILocation(line: 163, column: 5, scope: !730)
!730 = distinct !DILexicalBlock(scope: !630, file: !3, line: 162, column: 23)
!731 = !DILocation(line: 163, column: 28, scope: !730)
!732 = !DILocation(line: 163, column: 19, scope: !730)
!733 = !DILocation(line: 163, column: 13, scope: !730)
!734 = !DILocation(line: 163, column: 35, scope: !730)
!735 = !DILocation(line: 163, column: 32, scope: !730)
!736 = !DILocation(line: 164, column: 23, scope: !737)
!737 = distinct !DILexicalBlock(scope: !730, file: !3, line: 163, column: 39)
!738 = !DILocation(line: 164, column: 17, scope: !737)
!739 = !DILocation(line: 164, column: 7, scope: !737)
!740 = !DILocation(line: 164, column: 21, scope: !737)
!741 = !DILocation(line: 165, column: 11, scope: !737)
!742 = distinct !{!742, !729, !743, !713}
!743 = !DILocation(line: 166, column: 5, scope: !730)
!744 = !DILocation(line: 167, column: 10, scope: !730)
!745 = !DILocation(line: 168, column: 7, scope: !730)
!746 = distinct !{!746, !726, !747, !713}
!747 = !DILocation(line: 169, column: 3, scope: !630)
!748 = !DILocation(line: 173, column: 5, scope: !630)
!749 = !DILocation(line: 174, column: 10, scope: !750)
!750 = distinct !DILexicalBlock(scope: !630, file: !3, line: 174, column: 3)
!751 = !DILocation(line: 174, column: 8, scope: !750)
!752 = !DILocation(line: 174, column: 15, scope: !753)
!753 = distinct !DILexicalBlock(scope: !750, file: !3, line: 174, column: 3)
!754 = !DILocation(line: 174, column: 17, scope: !753)
!755 = !DILocation(line: 174, column: 3, scope: !750)
!756 = !DILocation(line: 175, column: 9, scope: !757)
!757 = distinct !DILexicalBlock(scope: !758, file: !3, line: 175, column: 9)
!758 = distinct !DILexicalBlock(scope: !753, file: !3, line: 174, column: 29)
!759 = !DILocation(line: 175, column: 15, scope: !757)
!760 = !DILocation(line: 175, column: 20, scope: !757)
!761 = !DILocation(line: 176, column: 25, scope: !762)
!762 = distinct !DILexicalBlock(scope: !757, file: !3, line: 175, column: 24)
!763 = !DILocation(line: 176, column: 7, scope: !762)
!764 = !DILocation(line: 176, column: 13, scope: !762)
!765 = !DILocation(line: 176, column: 20, scope: !762)
!766 = !DILocation(line: 176, column: 23, scope: !762)
!767 = !DILocation(line: 177, column: 35, scope: !762)
!768 = !DILocation(line: 177, column: 26, scope: !762)
!769 = !DILocation(line: 177, column: 7, scope: !762)
!770 = !DILocation(line: 177, column: 13, scope: !762)
!771 = !DILocation(line: 177, column: 21, scope: !762)
!772 = !DILocation(line: 177, column: 24, scope: !762)
!773 = !DILocation(line: 178, column: 12, scope: !762)
!774 = !DILocation(line: 178, column: 18, scope: !762)
!775 = !DILocation(line: 178, column: 23, scope: !762)
!776 = !DILocation(line: 178, column: 9, scope: !762)
!777 = !DILocation(line: 179, column: 35, scope: !762)
!778 = !DILocation(line: 179, column: 36, scope: !762)
!779 = !DILocation(line: 179, column: 26, scope: !762)
!780 = !DILocation(line: 179, column: 7, scope: !762)
!781 = !DILocation(line: 179, column: 13, scope: !762)
!782 = !DILocation(line: 179, column: 21, scope: !762)
!783 = !DILocation(line: 179, column: 24, scope: !762)
!784 = !DILocation(line: 180, column: 5, scope: !762)
!785 = !DILocation(line: 181, column: 7, scope: !786)
!786 = distinct !DILexicalBlock(scope: !757, file: !3, line: 180, column: 12)
!787 = !DILocation(line: 181, column: 13, scope: !786)
!788 = !DILocation(line: 181, column: 21, scope: !786)
!789 = !DILocation(line: 181, column: 24, scope: !786)
!790 = !DILocation(line: 183, column: 3, scope: !758)
!791 = !DILocation(line: 174, column: 25, scope: !753)
!792 = !DILocation(line: 174, column: 3, scope: !753)
!793 = distinct !{!793, !755, !794, !713}
!794 = !DILocation(line: 183, column: 3, scope: !750)
!795 = !DILocation(line: 184, column: 3, scope: !630)
!796 = !DILocation(line: 184, column: 9, scope: !630)
!797 = !DILocation(line: 184, column: 21, scope: !630)
!798 = !DILocation(line: 193, column: 3, scope: !630)
!799 = !DILocation(line: 195, column: 5, scope: !630)
!800 = !DILocation(line: 196, column: 10, scope: !801)
!801 = distinct !DILexicalBlock(scope: !630, file: !3, line: 196, column: 3)
!802 = !DILocation(line: 196, column: 8, scope: !801)
!803 = !DILocation(line: 196, column: 15, scope: !804)
!804 = distinct !DILexicalBlock(scope: !801, file: !3, line: 196, column: 3)
!805 = !DILocation(line: 196, column: 17, scope: !804)
!806 = !DILocation(line: 196, column: 3, scope: !801)
!807 = !DILocation(line: 197, column: 12, scope: !808)
!808 = distinct !DILexicalBlock(scope: !809, file: !3, line: 197, column: 5)
!809 = distinct !DILexicalBlock(scope: !804, file: !3, line: 196, column: 41)
!810 = !DILocation(line: 197, column: 10, scope: !808)
!811 = !DILocation(line: 197, column: 17, scope: !812)
!812 = distinct !DILexicalBlock(scope: !808, file: !3, line: 197, column: 5)
!813 = !DILocation(line: 197, column: 28, scope: !812)
!814 = !DILocation(line: 197, column: 34, scope: !812)
!815 = !DILocation(line: 197, column: 39, scope: !812)
!816 = !DILocation(line: 197, column: 22, scope: !812)
!817 = !DILocation(line: 197, column: 19, scope: !812)
!818 = !DILocation(line: 197, column: 5, scope: !808)
!819 = !DILocation(line: 200, column: 27, scope: !820)
!820 = distinct !DILexicalBlock(scope: !812, file: !3, line: 197, column: 53)
!821 = !DILocation(line: 200, column: 18, scope: !820)
!822 = !DILocation(line: 200, column: 49, scope: !820)
!823 = !DILocation(line: 200, column: 48, scope: !820)
!824 = !DILocation(line: 200, column: 30, scope: !820)
!825 = !DILocation(line: 200, column: 16, scope: !820)
!826 = !DILocation(line: 201, column: 39, scope: !827)
!827 = distinct !DILexicalBlock(scope: !820, file: !3, line: 201, column: 7)
!828 = !DILocation(line: 201, column: 38, scope: !827)
!829 = !DILocation(line: 201, column: 20, scope: !827)
!830 = !DILocation(line: 201, column: 16, scope: !827)
!831 = !DILocation(line: 201, column: 12, scope: !827)
!832 = !DILocation(line: 201, column: 43, scope: !833)
!833 = distinct !DILexicalBlock(scope: !827, file: !3, line: 201, column: 7)
!834 = !DILocation(line: 201, column: 47, scope: !833)
!835 = !DILocation(line: 201, column: 7, scope: !827)
!836 = !DILocation(line: 202, column: 31, scope: !837)
!837 = distinct !DILexicalBlock(scope: !833, file: !3, line: 201, column: 59)
!838 = !DILocation(line: 202, column: 2, scope: !837)
!839 = !DILocation(line: 202, column: 8, scope: !837)
!840 = !DILocation(line: 202, column: 19, scope: !837)
!841 = !DILocation(line: 202, column: 29, scope: !837)
!842 = !DILocation(line: 203, column: 29, scope: !837)
!843 = !DILocation(line: 203, column: 35, scope: !837)
!844 = !DILocation(line: 203, column: 43, scope: !837)
!845 = !DILocation(line: 203, column: 2, scope: !837)
!846 = !DILocation(line: 203, column: 8, scope: !837)
!847 = !DILocation(line: 203, column: 17, scope: !837)
!848 = !DILocation(line: 203, column: 27, scope: !837)
!849 = !DILocation(line: 204, column: 10, scope: !837)
!850 = !DILocation(line: 205, column: 7, scope: !837)
!851 = !DILocation(line: 201, column: 55, scope: !833)
!852 = !DILocation(line: 201, column: 7, scope: !833)
!853 = distinct !{!853, !835, !854, !713}
!854 = !DILocation(line: 205, column: 7, scope: !827)
!855 = !DILocation(line: 206, column: 5, scope: !820)
!856 = !DILocation(line: 197, column: 44, scope: !812)
!857 = !DILocation(line: 197, column: 49, scope: !812)
!858 = !DILocation(line: 197, column: 5, scope: !812)
!859 = distinct !{!859, !818, !860, !713}
!860 = !DILocation(line: 206, column: 5, scope: !808)
!861 = !DILocation(line: 207, column: 3, scope: !809)
!862 = !DILocation(line: 196, column: 37, scope: !804)
!863 = !DILocation(line: 196, column: 3, scope: !804)
!864 = distinct !{!864, !806, !865, !713}
!865 = !DILocation(line: 207, column: 3, scope: !801)
!866 = !DILocation(line: 208, column: 1, scope: !630)
!867 = distinct !DISubprogram(name: "jpeg_fill_bit_buffer", scope: !3, file: !3, line: 234, type: !868, scopeLine: 238, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !634)
!868 = !DISubroutineType(types: !869)
!869 = !{!191, !870, !604, !176, !176}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitread_working_state", file: !160, line: 97, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 84, size: 448, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !872, file: !160, line: 86, baseType: !341, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !872, file: !160, line: 87, baseType: !250, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !872, file: !160, line: 88, baseType: !176, size: 32, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !872, file: !160, line: 92, baseType: !604, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "bits_left", scope: !872, file: !160, line: 93, baseType: !176, size: 32, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "cinfo", scope: !872, file: !160, line: 95, baseType: !327, size: 64, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "printed_eod_ptr", scope: !872, file: !160, line: 96, baseType: !881, size: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!882 = !DILocalVariable(name: "state", arg: 1, scope: !867, file: !3, line: 234, type: !870)
!883 = !DILocation(line: 234, column: 47, scope: !867)
!884 = !DILocalVariable(name: "get_buffer", arg: 2, scope: !867, file: !3, line: 235, type: !604)
!885 = !DILocation(line: 235, column: 31, scope: !867)
!886 = !DILocalVariable(name: "bits_left", arg: 3, scope: !867, file: !3, line: 235, type: !176)
!887 = !DILocation(line: 235, column: 56, scope: !867)
!888 = !DILocalVariable(name: "nbits", arg: 4, scope: !867, file: !3, line: 236, type: !176)
!889 = !DILocation(line: 236, column: 13, scope: !867)
!890 = !DILocalVariable(name: "next_input_byte", scope: !867, file: !3, line: 240, type: !341)
!891 = !DILocation(line: 240, column: 27, scope: !867)
!892 = !DILocation(line: 240, column: 45, scope: !867)
!893 = !DILocation(line: 240, column: 52, scope: !867)
!894 = !DILocalVariable(name: "bytes_in_buffer", scope: !867, file: !3, line: 241, type: !250)
!895 = !DILocation(line: 241, column: 19, scope: !867)
!896 = !DILocation(line: 241, column: 37, scope: !867)
!897 = !DILocation(line: 241, column: 44, scope: !867)
!898 = !DILocalVariable(name: "c", scope: !867, file: !3, line: 242, type: !176)
!899 = !DILocation(line: 242, column: 16, scope: !867)
!900 = !DILocation(line: 247, column: 3, scope: !867)
!901 = !DILocation(line: 247, column: 10, scope: !867)
!902 = !DILocation(line: 247, column: 20, scope: !867)
!903 = !DILocation(line: 249, column: 9, scope: !904)
!904 = distinct !DILexicalBlock(scope: !905, file: !3, line: 249, column: 9)
!905 = distinct !DILexicalBlock(scope: !867, file: !3, line: 247, column: 36)
!906 = !DILocation(line: 249, column: 16, scope: !904)
!907 = !DILocation(line: 249, column: 30, scope: !904)
!908 = !DILocation(line: 250, column: 7, scope: !904)
!909 = !DILocation(line: 252, column: 9, scope: !910)
!910 = distinct !DILexicalBlock(scope: !905, file: !3, line: 252, column: 9)
!911 = !DILocation(line: 252, column: 25, scope: !910)
!912 = !DILocation(line: 253, column: 15, scope: !913)
!913 = distinct !DILexicalBlock(scope: !914, file: !3, line: 253, column: 11)
!914 = distinct !DILexicalBlock(scope: !910, file: !3, line: 252, column: 31)
!915 = !DILocation(line: 253, column: 22, scope: !913)
!916 = !DILocation(line: 253, column: 29, scope: !913)
!917 = !DILocation(line: 253, column: 34, scope: !913)
!918 = !DILocation(line: 253, column: 54, scope: !913)
!919 = !DILocation(line: 253, column: 61, scope: !913)
!920 = !DILocation(line: 253, column: 13, scope: !913)
!921 = !DILocation(line: 253, column: 11, scope: !913)
!922 = !DILocation(line: 254, column: 2, scope: !913)
!923 = !DILocation(line: 255, column: 25, scope: !914)
!924 = !DILocation(line: 255, column: 32, scope: !914)
!925 = !DILocation(line: 255, column: 39, scope: !914)
!926 = !DILocation(line: 255, column: 44, scope: !914)
!927 = !DILocation(line: 255, column: 23, scope: !914)
!928 = !DILocation(line: 256, column: 25, scope: !914)
!929 = !DILocation(line: 256, column: 32, scope: !914)
!930 = !DILocation(line: 256, column: 39, scope: !914)
!931 = !DILocation(line: 256, column: 44, scope: !914)
!932 = !DILocation(line: 256, column: 23, scope: !914)
!933 = !DILocation(line: 257, column: 5, scope: !914)
!934 = !DILocation(line: 258, column: 20, scope: !905)
!935 = !DILocation(line: 259, column: 9, scope: !905)
!936 = !DILocation(line: 259, column: 7, scope: !905)
!937 = !DILocation(line: 262, column: 9, scope: !938)
!938 = distinct !DILexicalBlock(scope: !905, file: !3, line: 262, column: 9)
!939 = !DILocation(line: 262, column: 11, scope: !938)
!940 = !DILocation(line: 263, column: 7, scope: !941)
!941 = distinct !DILexicalBlock(scope: !938, file: !3, line: 262, column: 20)
!942 = !DILocation(line: 264, column: 6, scope: !943)
