; ModuleID = 'cBench/consumer_jpeg_c/src/jdmarker.c'
source_filename = "cBench/consumer_jpeg_c/src/jdmarker.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_decompress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], i32, ptr, i32, i32, [16 x i8], [16 x i8], [16 x i8], i32, i32, i8, i16, i16, i32, i8, i32, i32, i32, i32, i32, ptr, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.jpeg_source_mgr = type { ptr, i64, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_marker_reader = type { ptr, ptr, ptr, ptr, [16 x ptr], i32, i32, i32, i32 }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.jpeg_component_info = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }
%struct.JHUFF_TBL = type { [17 x i8], [256 x i8], i32 }
%struct.JQUANT_TBL = type { [64 x i16], i32 }

@jpeg_natural_order = external constant [0 x i32], align 4


!122 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!123 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!124 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!125 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!126 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!127 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!128 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!129 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!130 = !DIEnumerator(name: "JTRC_RST", value: 97)
!131 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!132 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!133 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!134 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!135 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!136 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!137 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!138 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!139 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!140 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!141 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!142 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!143 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!144 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!145 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!146 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!147 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!148 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!149 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!150 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!151 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!152 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!153 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 20, baseType: !5, size: 32, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208}
!156 = !DIEnumerator(name: "M_SOF0", value: 192)
!157 = !DIEnumerator(name: "M_SOF1", value: 193)
!158 = !DIEnumerator(name: "M_SOF2", value: 194)
!159 = !DIEnumerator(name: "M_SOF3", value: 195)
!160 = !DIEnumerator(name: "M_SOF5", value: 197)
!161 = !DIEnumerator(name: "M_SOF6", value: 198)
!162 = !DIEnumerator(name: "M_SOF7", value: 199)
!163 = !DIEnumerator(name: "M_JPG", value: 200)
!164 = !DIEnumerator(name: "M_SOF9", value: 201)
!165 = !DIEnumerator(name: "M_SOF10", value: 202)
!166 = !DIEnumerator(name: "M_SOF11", value: 203)
!167 = !DIEnumerator(name: "M_SOF13", value: 205)
!168 = !DIEnumerator(name: "M_SOF14", value: 206)
!169 = !DIEnumerator(name: "M_SOF15", value: 207)
!170 = !DIEnumerator(name: "M_DHT", value: 196)
!171 = !DIEnumerator(name: "M_DAC", value: 204)
!172 = !DIEnumerator(name: "M_RST0", value: 208)
!173 = !DIEnumerator(name: "M_RST1", value: 209)
!174 = !DIEnumerator(name: "M_RST2", value: 210)
!175 = !DIEnumerator(name: "M_RST3", value: 211)
!176 = !DIEnumerator(name: "M_RST4", value: 212)
!177 = !DIEnumerator(name: "M_RST5", value: 213)
!178 = !DIEnumerator(name: "M_RST6", value: 214)
!179 = !DIEnumerator(name: "M_RST7", value: 215)
!180 = !DIEnumerator(name: "M_SOI", value: 216)
!181 = !DIEnumerator(name: "M_EOI", value: 217)
!182 = !DIEnumerator(name: "M_SOS", value: 218)
!183 = !DIEnumerator(name: "M_DQT", value: 219)
!184 = !DIEnumerator(name: "M_DNL", value: 220)
!185 = !DIEnumerator(name: "M_DRI", value: 221)
!186 = !DIEnumerator(name: "M_DHP", value: 222)
!187 = !DIEnumerator(name: "M_EXP", value: 223)
!188 = !DIEnumerator(name: "M_APP0", value: 224)
!189 = !DIEnumerator(name: "M_APP1", value: 225)
!190 = !DIEnumerator(name: "M_APP2", value: 226)
!191 = !DIEnumerator(name: "M_APP3", value: 227)
!192 = !DIEnumerator(name: "M_APP4", value: 228)
!193 = !DIEnumerator(name: "M_APP5", value: 229)
!194 = !DIEnumerator(name: "M_APP6", value: 230)
!195 = !DIEnumerator(name: "M_APP7", value: 231)
!196 = !DIEnumerator(name: "M_APP8", value: 232)
!197 = !DIEnumerator(name: "M_APP9", value: 233)
!198 = !DIEnumerator(name: "M_APP10", value: 234)
!199 = !DIEnumerator(name: "M_APP11", value: 235)
!200 = !DIEnumerator(name: "M_APP12", value: 236)
!201 = !DIEnumerator(name: "M_APP13", value: 237)
!202 = !DIEnumerator(name: "M_APP14", value: 238)
!203 = !DIEnumerator(name: "M_APP15", value: 239)
!204 = !DIEnumerator(name: "M_JPG0", value: 240)
!205 = !DIEnumerator(name: "M_JPG13", value: 253)
!206 = !DIEnumerator(name: "M_COM", value: 254)
!207 = !DIEnumerator(name: "M_TEM", value: 1)
!208 = !DIEnumerator(name: "M_ERROR", value: 256)
!209 = !{!210, !226, !336, !268, !5, !267, !446, !435, !628, !629, !422, !249}
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !213)
!213 = !{!214, !259, !325, !334, !335}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !212, file: !4, line: 241, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !217)
!217 = !{!218, !222, !227, !228, !234, !235, !236, !247, !248, !250, !255, !256, !257, !258}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !216, file: !4, line: 620, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !210}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !216, file: !4, line: 622, baseType: !223, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !210, !226}
!226 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !216, file: !4, line: 624, baseType: !219, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !216, file: !4, line: 626, baseType: !229, size: 64, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !210, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !216, file: !4, line: 629, baseType: !219, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !216, file: !4, line: 634, baseType: !226, size: 32, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !216, file: !4, line: 639, baseType: !237, size: 640, offset: 352)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !216, file: !4, line: 636, size: 640, elements: !238)
!238 = !{!239, !243}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !237, file: !4, line: 637, baseType: !240, size: 256)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 256, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 8)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !237, file: !4, line: 638, baseType: !244, size: 640)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 640, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 80)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !216, file: !4, line: 643, baseType: !226, size: 32, offset: 992)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !216, file: !4, line: 651, baseType: !249, size: 64, offset: 1024)
!249 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !216, file: !4, line: 663, baseType: !251, size: 64, offset: 1088)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !216, file: !4, line: 664, baseType: !226, size: 32, offset: 1152)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !216, file: !4, line: 668, baseType: !251, size: 64, offset: 1216)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !216, file: !4, line: 669, baseType: !226, size: 32, offset: 1280)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !216, file: !4, line: 670, baseType: !226, size: 32, offset: 1312)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !212, file: !4, line: 241, baseType: !260, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !262)
!262 = !{!263, !271, !272, !284, !298, !306, !313, !314, !318, !322, !323, !324}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !261, file: !4, line: 733, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!267, !210, !226, !268}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !269, line: 18, baseType: !270)
!269 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!270 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !261, file: !4, line: 735, baseType: !264, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !261, file: !4, line: 737, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!276, !210, !226, !283, !283}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !281, line: 59, baseType: !282)
!281 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!282 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !281, line: 171, baseType: !5)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !261, file: !4, line: 740, baseType: !285, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!288, !210, !226, !283, !283}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !293)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 1024, elements: !296)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !281, line: 99, baseType: !295)
!295 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!296 = !{!297}
!297 = !DISubrange(count: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !261, file: !4, line: 743, baseType: !299, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!302, !210, !226, !305, !283, !283, !283}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !281, line: 227, baseType: !226)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !261, file: !4, line: 749, baseType: !307, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!310, !210, !226, !305, !283, !283, !283}
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !261, file: !4, line: 755, baseType: !219, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !261, file: !4, line: 756, baseType: !315, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!276, !210, !302, !283, !283, !305}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !261, file: !4, line: 761, baseType: !319, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!288, !210, !310, !283, !283, !305}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !261, file: !4, line: 766, baseType: !223, size: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !261, file: !4, line: 767, baseType: !219, size: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !261, file: !4, line: 774, baseType: !249, size: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !212, file: !4, line: 241, baseType: !326, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !328)
!328 = !{!329, !330, !331, !332, !333}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !327, file: !4, line: 677, baseType: !219, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !327, file: !4, line: 679, baseType: !249, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !327, file: !4, line: 680, baseType: !249, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !327, file: !4, line: 681, baseType: !226, size: 32, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !327, file: !4, line: 682, baseType: !226, size: 32, offset: 224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !212, file: !4, line: 241, baseType: !305, size: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !212, file: !4, line: 241, baseType: !226, size: 32, offset: 224)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !24, line: 188, size: 1408, elements: !338)
!338 = !{!339, !618, !619, !621, !622, !624, !625, !626, !627}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reset_marker_reader", scope: !337, file: !24, line: 189, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !343}
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !4, line: 250, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !4, line: 394, size: 4928, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !375, !376, !377, !378, !380, !381, !382, !383, !385, !386, !387, !389, !390, !391, !392, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !414, !427, !443, !444, !445, !471, !472, !473, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !495, !496, !497, !498, !502, !503, !504, !505, !506, !507, !514, !528, !546, !555, !565, !566, !575, !588, !595, !604}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !345, file: !4, line: 395, baseType: !215, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !345, file: !4, line: 395, baseType: !260, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !345, file: !4, line: 395, baseType: !326, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !345, file: !4, line: 395, baseType: !305, size: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !345, file: !4, line: 395, baseType: !226, size: 32, offset: 224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !345, file: !4, line: 398, baseType: !353, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !4, line: 700, size: 448, elements: !355)
!355 = !{!356, !360, !361, !362, !366, !370, !374}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !354, file: !4, line: 701, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !281, line: 110, baseType: !282)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !354, file: !4, line: 702, baseType: !268, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !354, file: !4, line: 704, baseType: !340, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !354, file: !4, line: 705, baseType: !363, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!305, !343}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !354, file: !4, line: 706, baseType: !367, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !343, !249}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !354, file: !4, line: 707, baseType: !371, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!305, !343, !226}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !354, file: !4, line: 708, baseType: !340, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !345, file: !4, line: 403, baseType: !283, size: 32, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !345, file: !4, line: 404, baseType: !283, size: 32, offset: 352)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !345, file: !4, line: 405, baseType: !226, size: 32, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !345, file: !4, line: 406, baseType: !379, size: 32, offset: 416)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !345, file: !4, line: 413, baseType: !379, size: 32, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !345, file: !4, line: 415, baseType: !5, size: 32, offset: 480)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !345, file: !4, line: 415, baseType: !5, size: 32, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !345, file: !4, line: 417, baseType: !384, size: 64, offset: 576)
!384 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !345, file: !4, line: 419, baseType: !305, size: 32, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !345, file: !4, line: 420, baseType: !305, size: 32, offset: 672)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !345, file: !4, line: 422, baseType: !388, size: 32, offset: 704)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !345, file: !4, line: 423, baseType: !305, size: 32, offset: 736)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !345, file: !4, line: 424, baseType: !305, size: 32, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !345, file: !4, line: 426, baseType: !305, size: 32, offset: 800)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !345, file: !4, line: 428, baseType: !393, size: 32, offset: 832)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !4, line: 224, baseType: !18)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !345, file: !4, line: 429, baseType: !305, size: 32, offset: 864)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !345, file: !4, line: 430, baseType: !226, size: 32, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !345, file: !4, line: 432, baseType: !305, size: 32, offset: 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !345, file: !4, line: 433, baseType: !305, size: 32, offset: 960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !345, file: !4, line: 434, baseType: !305, size: 32, offset: 992)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !345, file: !4, line: 442, baseType: !283, size: 32, offset: 1024)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !345, file: !4, line: 443, baseType: !283, size: 32, offset: 1056)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !345, file: !4, line: 444, baseType: !226, size: 32, offset: 1088)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !345, file: !4, line: 445, baseType: !226, size: 32, offset: 1120)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !345, file: !4, line: 449, baseType: !226, size: 32, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !345, file: !4, line: 461, baseType: !226, size: 32, offset: 1184)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !345, file: !4, line: 462, baseType: !276, size: 64, offset: 1216)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !345, file: !4, line: 472, baseType: !283, size: 32, offset: 1280)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !345, file: !4, line: 477, baseType: !226, size: 32, offset: 1312)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !345, file: !4, line: 478, baseType: !283, size: 32, offset: 1344)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !345, file: !4, line: 484, baseType: !226, size: 32, offset: 1376)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !345, file: !4, line: 485, baseType: !283, size: 32, offset: 1408)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !345, file: !4, line: 494, baseType: !412, size: 64, offset: 1472)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 2048, elements: !296)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !345, file: !4, line: 505, baseType: !415, size: 256, offset: 1536)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 256, elements: !425)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !419)
!419 = !{!420, !424}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !418, file: !4, line: 88, baseType: !421, size: 1024)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 1024, elements: !296)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !281, line: 147, baseType: !423)
!423 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !418, file: !4, line: 94, baseType: !305, size: 32, offset: 1024)
!425 = !{!426}
!426 = !DISubrange(count: 4)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !345, file: !4, line: 508, baseType: !428, size: 256, offset: 1792)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 256, elements: !425)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !432)
!432 = !{!433, !438, !442}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !431, file: !4, line: 102, baseType: !434, size: 136)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 136, elements: !436)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !281, line: 135, baseType: !282)
!436 = !{!437}
!437 = !DISubrange(count: 17)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !431, file: !4, line: 104, baseType: !439, size: 2048, offset: 136)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 2048, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !431, file: !4, line: 110, baseType: !305, size: 32, offset: 2208)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !345, file: !4, line: 509, baseType: !428, size: 256, offset: 2048)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !345, file: !4, line: 516, baseType: !226, size: 32, offset: 2304)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !345, file: !4, line: 518, baseType: !446, size: 64, offset: 2368)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !449)
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !448, file: !4, line: 120, baseType: !226, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !448, file: !4, line: 121, baseType: !226, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !448, file: !4, line: 122, baseType: !226, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !448, file: !4, line: 123, baseType: !226, size: 32, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !448, file: !4, line: 124, baseType: !226, size: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !448, file: !4, line: 129, baseType: !226, size: 32, offset: 160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !448, file: !4, line: 130, baseType: !226, size: 32, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !448, file: !4, line: 139, baseType: !283, size: 32, offset: 224)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !448, file: !4, line: 140, baseType: !283, size: 32, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !448, file: !4, line: 147, baseType: !226, size: 32, offset: 288)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !448, file: !4, line: 154, baseType: !283, size: 32, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !448, file: !4, line: 155, baseType: !283, size: 32, offset: 352)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !448, file: !4, line: 160, baseType: !305, size: 32, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !448, file: !4, line: 164, baseType: !226, size: 32, offset: 416)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !448, file: !4, line: 165, baseType: !226, size: 32, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !448, file: !4, line: 166, baseType: !226, size: 32, offset: 480)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !448, file: !4, line: 167, baseType: !226, size: 32, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !448, file: !4, line: 168, baseType: !226, size: 32, offset: 544)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !448, file: !4, line: 169, baseType: !226, size: 32, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !448, file: !4, line: 175, baseType: !416, size: 64, offset: 640)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !448, file: !4, line: 178, baseType: !267, size: 64, offset: 704)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !345, file: !4, line: 521, baseType: !305, size: 32, offset: 2432)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !345, file: !4, line: 522, baseType: !305, size: 32, offset: 2464)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !345, file: !4, line: 524, baseType: !474, size: 128, offset: 2496)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 128, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 16)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !345, file: !4, line: 525, baseType: !474, size: 128, offset: 2624)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !345, file: !4, line: 526, baseType: !474, size: 128, offset: 2752)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !345, file: !4, line: 528, baseType: !5, size: 32, offset: 2880)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !345, file: !4, line: 533, baseType: !305, size: 32, offset: 2912)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !345, file: !4, line: 535, baseType: !435, size: 8, offset: 2944)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !345, file: !4, line: 536, baseType: !422, size: 16, offset: 2960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !345, file: !4, line: 537, baseType: !422, size: 16, offset: 2976)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !345, file: !4, line: 538, baseType: !305, size: 32, offset: 3008)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !345, file: !4, line: 539, baseType: !435, size: 8, offset: 3040)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !345, file: !4, line: 541, baseType: !305, size: 32, offset: 3072)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !345, file: !4, line: 550, baseType: !226, size: 32, offset: 3104)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !345, file: !4, line: 551, baseType: !226, size: 32, offset: 3136)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !345, file: !4, line: 553, baseType: !226, size: 32, offset: 3168)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !345, file: !4, line: 555, baseType: !283, size: 32, offset: 3200)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !345, file: !4, line: 564, baseType: !279, size: 64, offset: 3264)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !345, file: !4, line: 571, baseType: !226, size: 32, offset: 3328)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !345, file: !4, line: 572, baseType: !494, size: 256, offset: 3392)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 256, elements: !425)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !345, file: !4, line: 575, baseType: !283, size: 32, offset: 3648)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !345, file: !4, line: 576, baseType: !283, size: 32, offset: 3680)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !345, file: !4, line: 578, baseType: !226, size: 32, offset: 3712)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !345, file: !4, line: 579, baseType: !499, size: 320, offset: 3744)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 320, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 10)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !345, file: !4, line: 583, baseType: !226, size: 32, offset: 4064)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !345, file: !4, line: 583, baseType: !226, size: 32, offset: 4096)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !345, file: !4, line: 583, baseType: !226, size: 32, offset: 4128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !345, file: !4, line: 583, baseType: !226, size: 32, offset: 4160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !345, file: !4, line: 589, baseType: !226, size: 32, offset: 4192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !345, file: !4, line: 594, baseType: !508, size: 64, offset: 4224)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !24, line: 136, size: 192, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_output_pass", scope: !509, file: !24, line: 137, baseType: !340, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output_pass", scope: !509, file: !24, line: 138, baseType: !340, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "is_dummy_pass", scope: !509, file: !24, line: 141, baseType: !305, size: 32, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !345, file: !4, line: 595, baseType: !515, size: 64, offset: 4288)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !24, line: 157, size: 128, elements: !517)
!517 = !{!518, !523}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !516, file: !24, line: 158, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !343, !522}
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !24, line: 22, baseType: !23)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !516, file: !24, line: 159, baseType: !524, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !343, !276, !527, !283}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !345, file: !4, line: 596, baseType: !529, size: 64, offset: 4352)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !24, line: 165, size: 320, elements: !531)
!531 = !{!532, !533, !537, !538, !544}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !530, file: !24, line: 166, baseType: !340, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "consume_data", scope: !530, file: !24, line: 167, baseType: !534, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!226, !343}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "start_output_pass", scope: !530, file: !24, line: 168, baseType: !340, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "decompress_data", scope: !530, file: !24, line: 169, baseType: !539, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!226, !343, !542}
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !4, line: 68, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "coef_arrays", scope: !530, file: !24, line: 172, baseType: !545, size: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !345, file: !4, line: 597, baseType: !547, size: 64, offset: 4416)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !24, line: 176, size: 128, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !548, file: !24, line: 177, baseType: !519, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_data", scope: !548, file: !24, line: 178, baseType: !552, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !343, !542, !527, !283, !276, !527, !283}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !345, file: !4, line: 598, baseType: !556, size: 64, offset: 4480)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !24, line: 145, size: 320, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "consume_input", scope: !557, file: !24, line: 146, baseType: !534, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reset_input_controller", scope: !557, file: !24, line: 147, baseType: !340, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !557, file: !24, line: 148, baseType: !340, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input_pass", scope: !557, file: !24, line: 149, baseType: !340, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "has_multiple_scans", scope: !557, file: !24, line: 152, baseType: !305, size: 32, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "eoi_reached", scope: !557, file: !24, line: 153, baseType: !305, size: 32, offset: 288)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !345, file: !4, line: 599, baseType: !336, size: 64, offset: 4544)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !345, file: !4, line: 600, baseType: !567, size: 64, offset: 4608)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !24, line: 211, size: 128, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !568, file: !24, line: 212, baseType: !340, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mcu", scope: !568, file: !24, line: 213, baseType: !572, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!305, !343, !289}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !345, file: !4, line: 601, baseType: !576, size: 64, offset: 4672)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !24, line: 223, size: 704, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !577, file: !24, line: 224, baseType: !340, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_DCT", scope: !577, file: !24, line: 226, baseType: !581, size: 640, offset: 64)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 640, elements: !500)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "inverse_DCT_method_ptr", file: !24, line: 218, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !343, !446, !586, !276, !283}
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEFPTR", file: !4, line: 75, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !345, file: !4, line: 602, baseType: !589, size: 64, offset: 4736)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !24, line: 230, size: 192, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !590, file: !24, line: 231, baseType: !340, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !590, file: !24, line: 232, baseType: !552, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !590, file: !24, line: 240, baseType: !305, size: 32, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !345, file: !4, line: 603, baseType: !596, size: 64, offset: 4800)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !24, line: 244, size: 128, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !597, file: !24, line: 245, baseType: !340, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !597, file: !24, line: 246, baseType: !601, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !343, !542, !283, !276, !226}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !345, file: !4, line: 604, baseType: !605, size: 64, offset: 4864)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !24, line: 252, size: 256, elements: !607)
!607 = !{!608, !612, !616, !617}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !606, file: !24, line: 253, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !343, !305}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "color_quantize", scope: !606, file: !24, line: 254, baseType: !613, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !343, !276, !276, !226}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !606, file: !24, line: 257, baseType: !340, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "new_color_map", scope: !606, file: !24, line: 258, baseType: !340, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "read_markers", scope: !337, file: !24, line: 194, baseType: !534, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "read_restart_marker", scope: !337, file: !24, line: 196, baseType: !620, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_marker_parser_method", file: !4, line: 781, baseType: !363)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "process_COM", scope: !337, file: !24, line: 198, baseType: !620, size: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "process_APPn", scope: !337, file: !24, line: 199, baseType: !623, size: 1024, offset: 256)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 1024, elements: !475)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOI", scope: !337, file: !24, line: 204, baseType: !305, size: 32, offset: 1280)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOF", scope: !337, file: !24, line: 205, baseType: !305, size: 32, offset: 1312)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "next_restart_num", scope: !337, file: !24, line: 206, baseType: !226, size: 32, offset: 1344)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "discarded_bytes", scope: !337, file: !24, line: 207, baseType: !5, size: 32, offset: 1376)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !281, line: 161, baseType: !249)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!631 = !{i32 7, !"Dwarf Version", i32 5}
!632 = !{i32 2, !"Debug Info Version", i32 3}
!633 = !{i32 1, !"wchar_size", i32 4}
!634 = !{i32 8, !"PIC Level", i32 2}
!635 = !{i32 7, !"PIE Level", i32 2}
!636 = !{i32 7, !"uwtable", i32 2}
!637 = !{i32 7, !"frame-pointer", i32 2}
!638 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!639 = distinct !DISubprogram(name: "jpeg_resync_to_restart", scope: !1, file: !1, line: 969, type: !372, scopeLine: 970, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !640)
!640 = !{}
!641 = !DILocalVariable(name: "cinfo", arg: 1, scope: !639, file: !1, line: 969, type: !343)
!642 = !DILocation(line: 969, column: 42, scope: !639)
!643 = !DILocalVariable(name: "desired", arg: 2, scope: !639, file: !1, line: 969, type: !226)
!644 = !DILocation(line: 969, column: 53, scope: !639)
!645 = !DILocalVariable(name: "marker", scope: !639, file: !1, line: 971, type: !226)
!646 = !DILocation(line: 971, column: 7, scope: !639)
!647 = !DILocation(line: 971, column: 16, scope: !639)
!648 = !DILocation(line: 971, column: 23, scope: !639)
!649 = !DILocalVariable(name: "action", scope: !639, file: !1, line: 972, type: !226)
!650 = !DILocation(line: 972, column: 7, scope: !639)
!651 = !DILocation(line: 975, column: 3, scope: !639)
!652 = !DILocation(line: 978, column: 3, scope: !639)
!653 = !DILocation(line: 979, column: 9, scope: !654)
!654 = distinct !DILexicalBlock(scope: !655, file: !1, line: 979, column: 9)
!655 = distinct !DILexicalBlock(scope: !656, file: !1, line: 978, column: 12)
!656 = distinct !DILexicalBlock(scope: !657, file: !1, line: 978, column: 3)
!657 = distinct !DILexicalBlock(scope: !639, file: !1, line: 978, column: 3)
!658 = !DILocation(line: 979, column: 16, scope: !654)
!659 = !DILocation(line: 980, column: 14, scope: !654)
!660 = !DILocation(line: 980, column: 7, scope: !654)
!661 = !DILocation(line: 981, column: 14, scope: !662)
!662 = distinct !DILexicalBlock(scope: !654, file: !1, line: 981, column: 14)
!663 = !DILocation(line: 981, column: 21, scope: !662)
!664 = !DILocation(line: 981, column: 36, scope: !662)
!665 = !DILocation(line: 981, column: 39, scope: !662)
!666 = !DILocation(line: 981, column: 46, scope: !662)
!667 = !DILocation(line: 982, column: 14, scope: !662)
!668 = !DILocation(line: 982, column: 7, scope: !662)
!669 = !DILocation(line: 984, column: 11, scope: !670)
!670 = distinct !DILexicalBlock(scope: !671, file: !1, line: 984, column: 11)
!671 = distinct !DILexicalBlock(scope: !662, file: !1, line: 983, column: 10)
!672 = !DILocation(line: 984, column: 39, scope: !670)
!673 = !DILocation(line: 984, column: 46, scope: !670)
!674 = !DILocation(line: 984, column: 50, scope: !670)
!675 = !DILocation(line: 984, column: 35, scope: !670)
!676 = !DILocation(line: 984, column: 18, scope: !670)
!677 = !DILocation(line: 984, column: 56, scope: !670)
!678 = !DILocation(line: 985, column: 4, scope: !670)
!679 = !DILocation(line: 985, column: 32, scope: !670)
!680 = !DILocation(line: 985, column: 39, scope: !670)
!681 = !DILocation(line: 985, column: 43, scope: !670)
!682 = !DILocation(line: 985, column: 28, scope: !670)
!683 = !DILocation(line: 985, column: 11, scope: !670)
!684 = !DILocation(line: 986, column: 9, scope: !670)
!685 = !DILocation(line: 986, column: 2, scope: !670)
!686 = !DILocation(line: 987, column: 16, scope: !687)
!687 = distinct !DILexicalBlock(scope: !670, file: !1, line: 987, column: 16)
!688 = !DILocation(line: 987, column: 44, scope: !687)
!689 = !DILocation(line: 987, column: 51, scope: !687)
