; ModuleID = 'cBench/consumer_jpeg_c/src/jdphuff.c'
source_filename = "cBench/consumer_jpeg_c/src/jdphuff.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_decompress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], i32, ptr, i32, i32, [16 x i8], [16 x i8], [16 x i8], i32, i32, i8, i16, i16, i32, i8, i32, i32, i32, i32, i32, ptr, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.phuff_entropy_decoder = type { %struct.jpeg_entropy_decoder, %struct.bitread_perm_state, %struct.savable_state, i32, [4 x ptr], ptr }
%struct.jpeg_entropy_decoder = type { ptr, ptr }
%struct.bitread_perm_state = type { i64, i32, i32 }
%struct.savable_state = type { i32, [4 x i32] }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.jpeg_component_info = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }

!103 = !DIEnumerator(name: "JERR_VIRTUAL_BUG", value: 68)
!104 = !DIEnumerator(name: "JERR_WIDTH_OVERFLOW", value: 69)
!105 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!106 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!107 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!108 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!109 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!110 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!111 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!112 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!113 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!114 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!115 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!116 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!117 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!118 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!119 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!120 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!121 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!122 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!123 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!124 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!125 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!126 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!127 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!128 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!129 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!130 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!131 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!132 = !DIEnumerator(name: "JTRC_RST", value: 97)
!133 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!134 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!135 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!136 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!137 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!138 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!139 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!140 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!141 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!142 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!143 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!144 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!145 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!146 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!147 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!148 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!149 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!150 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!151 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!152 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!153 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!154 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!155 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!156 = !{!157, !181, !196, !533, !364, !194, !195, !222}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "phuff_entropy_ptr", file: !3, line: 74, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "phuff_entropy_decoder", file: !3, line: 72, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 56, size: 768, elements: !161)
!161 = !{!162, !581, !591, !598, !599, !617}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !160, file: !3, line: 57, baseType: !163, size: 128)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !26, line: 211, size: 128, elements: !164)
!164 = !{!165, !577}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !163, file: !26, line: 212, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !169}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !6, line: 250, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !6, line: 394, size: 4928, elements: !172)
!172 = !{!173, !300, !301, !302, !303, !304, !327, !328, !329, !330, !332, !333, !334, !335, !337, !338, !339, !341, !342, !343, !344, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !366, !379, !395, !396, !397, !423, !424, !425, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !447, !448, !449, !450, !454, !455, !456, !457, !458, !459, !466, !480, !498, !507, !517, !532, !534, !547, !554, !563}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !171, file: !6, line: 395, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !6, line: 618, size: 1344, elements: !176)
!176 = !{!177, !268, !269, !270, !276, !277, !278, !289, !290, !291, !296, !297, !298, !299}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !175, file: !6, line: 620, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !181}
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !6, line: 248, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !6, line: 240, size: 256, elements: !184)
!184 = !{!185, !186, !257, !266, !267}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !183, file: !6, line: 241, baseType: !174, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !183, file: !6, line: 241, baseType: !187, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !6, line: 731, size: 768, elements: !189)
!189 = !{!190, !199, !200, !212, !226, !234, !241, !242, !246, !250, !254, !255}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !188, file: !6, line: 733, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !181, !195, !196}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!195 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !197, line: 18, baseType: !198)
!197 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!198 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !188, file: !6, line: 735, baseType: !191, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !188, file: !6, line: 737, baseType: !201, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!204, !181, !195, !211, !211}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !6, line: 67, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !6, line: 66, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !209, line: 59, baseType: !210)
!209 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!210 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !209, line: 171, baseType: !7)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !188, file: !6, line: 740, baseType: !213, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !181, !195, !211, !211}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !6, line: 72, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !6, line: 71, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !6, line: 70, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 1024, elements: !224)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !209, line: 99, baseType: !223)
!223 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!224 = !{!225}
!225 = !DISubrange(count: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !188, file: !6, line: 743, baseType: !227, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !181, !195, !233, !211, !211, !211}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !6, line: 727, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !6, line: 727, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !209, line: 227, baseType: !195)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !188, file: !6, line: 749, baseType: !235, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!238, !181, !195, !233, !211, !211, !211}
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !6, line: 728, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !6, line: 728, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !188, file: !6, line: 755, baseType: !178, size: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !188, file: !6, line: 756, baseType: !243, size: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!204, !181, !230, !211, !211, !233}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !188, file: !6, line: 761, baseType: !247, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!216, !181, !238, !211, !211, !233}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !188, file: !6, line: 766, baseType: !251, size: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !181, !195}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !188, file: !6, line: 767, baseType: !178, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !188, file: !6, line: 774, baseType: !256, size: 64, offset: 704)
!256 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !183, file: !6, line: 241, baseType: !258, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !6, line: 676, size: 256, elements: !260)
!260 = !{!261, !262, !263, !264, !265}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !259, file: !6, line: 677, baseType: !178, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !259, file: !6, line: 679, baseType: !256, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !259, file: !6, line: 680, baseType: !256, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !259, file: !6, line: 681, baseType: !195, size: 32, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !259, file: !6, line: 682, baseType: !195, size: 32, offset: 224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !183, file: !6, line: 241, baseType: !233, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !183, file: !6, line: 241, baseType: !195, size: 32, offset: 224)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !175, file: !6, line: 622, baseType: !251, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !175, file: !6, line: 624, baseType: !178, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !175, file: !6, line: 626, baseType: !271, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !181, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !175, file: !6, line: 629, baseType: !178, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !175, file: !6, line: 634, baseType: !195, size: 32, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !175, file: !6, line: 639, baseType: !279, size: 640, offset: 352)
!279 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !175, file: !6, line: 636, size: 640, elements: !280)
!280 = !{!281, !285}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !279, file: !6, line: 637, baseType: !282, size: 256)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 256, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !279, file: !6, line: 638, baseType: !286, size: 640)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 640, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 80)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !175, file: !6, line: 643, baseType: !195, size: 32, offset: 992)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !175, file: !6, line: 651, baseType: !256, size: 64, offset: 1024)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !175, file: !6, line: 663, baseType: !292, size: 64, offset: 1088)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !175, file: !6, line: 664, baseType: !195, size: 32, offset: 1152)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !175, file: !6, line: 668, baseType: !292, size: 64, offset: 1216)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !175, file: !6, line: 669, baseType: !195, size: 32, offset: 1280)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !175, file: !6, line: 670, baseType: !195, size: 32, offset: 1312)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !171, file: !6, line: 395, baseType: !187, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !171, file: !6, line: 395, baseType: !258, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !171, file: !6, line: 395, baseType: !233, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !171, file: !6, line: 395, baseType: !195, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !171, file: !6, line: 398, baseType: !305, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !6, line: 700, size: 448, elements: !307)
!307 = !{!308, !312, !313, !314, !318, !322, !326}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !306, file: !6, line: 701, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !209, line: 110, baseType: !210)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !306, file: !6, line: 702, baseType: !196, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !306, file: !6, line: 704, baseType: !166, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !306, file: !6, line: 705, baseType: !315, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!233, !169}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !306, file: !6, line: 706, baseType: !319, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !169, !256}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !306, file: !6, line: 707, baseType: !323, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!233, !169, !195}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !306, file: !6, line: 708, baseType: !166, size: 64, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !171, file: !6, line: 403, baseType: !211, size: 32, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !171, file: !6, line: 404, baseType: !211, size: 32, offset: 352)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !171, file: !6, line: 405, baseType: !195, size: 32, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !171, file: !6, line: 406, baseType: !331, size: 32, offset: 416)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !6, line: 201, baseType: !5)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !171, file: !6, line: 413, baseType: !331, size: 32, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !171, file: !6, line: 415, baseType: !7, size: 32, offset: 480)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !171, file: !6, line: 415, baseType: !7, size: 32, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !171, file: !6, line: 417, baseType: !336, size: 64, offset: 576)
!336 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !171, file: !6, line: 419, baseType: !233, size: 32, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !171, file: !6, line: 420, baseType: !233, size: 32, offset: 672)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !171, file: !6, line: 422, baseType: !340, size: 32, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !6, line: 209, baseType: !15)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !171, file: !6, line: 423, baseType: !233, size: 32, offset: 736)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !171, file: !6, line: 424, baseType: !233, size: 32, offset: 768)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !171, file: !6, line: 426, baseType: !233, size: 32, offset: 800)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !171, file: !6, line: 428, baseType: !345, size: 32, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !6, line: 224, baseType: !20)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !171, file: !6, line: 429, baseType: !233, size: 32, offset: 864)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !171, file: !6, line: 430, baseType: !195, size: 32, offset: 896)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !171, file: !6, line: 432, baseType: !233, size: 32, offset: 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !171, file: !6, line: 433, baseType: !233, size: 32, offset: 960)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !171, file: !6, line: 434, baseType: !233, size: 32, offset: 992)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !171, file: !6, line: 442, baseType: !211, size: 32, offset: 1024)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !171, file: !6, line: 443, baseType: !211, size: 32, offset: 1056)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !171, file: !6, line: 444, baseType: !195, size: 32, offset: 1088)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !171, file: !6, line: 445, baseType: !195, size: 32, offset: 1120)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !171, file: !6, line: 449, baseType: !195, size: 32, offset: 1152)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !171, file: !6, line: 461, baseType: !195, size: 32, offset: 1184)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !171, file: !6, line: 462, baseType: !204, size: 64, offset: 1216)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !171, file: !6, line: 472, baseType: !211, size: 32, offset: 1280)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !171, file: !6, line: 477, baseType: !195, size: 32, offset: 1312)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !171, file: !6, line: 478, baseType: !211, size: 32, offset: 1344)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !171, file: !6, line: 484, baseType: !195, size: 32, offset: 1376)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !171, file: !6, line: 485, baseType: !211, size: 32, offset: 1408)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !171, file: !6, line: 494, baseType: !364, size: 64, offset: 1472)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 2048, elements: !224)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !171, file: !6, line: 505, baseType: !367, size: 256, offset: 1536)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 256, elements: !377)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !6, line: 95, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 83, size: 1056, elements: !371)
!371 = !{!372, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !370, file: !6, line: 88, baseType: !373, size: 1024)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 1024, elements: !224)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !209, line: 147, baseType: !375)
!375 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !370, file: !6, line: 94, baseType: !233, size: 32, offset: 1024)
!377 = !{!378}
!378 = !DISubrange(count: 4)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !171, file: !6, line: 508, baseType: !380, size: 256, offset: 1792)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 256, elements: !377)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !6, line: 111, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 100, size: 2240, elements: !384)
!384 = !{!385, !390, !394}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !383, file: !6, line: 102, baseType: !386, size: 136)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 136, elements: !388)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !209, line: 135, baseType: !210)
!388 = !{!389}
!389 = !DISubrange(count: 17)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !383, file: !6, line: 104, baseType: !391, size: 2048, offset: 136)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 2048, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !383, file: !6, line: 110, baseType: !233, size: 32, offset: 2208)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !171, file: !6, line: 509, baseType: !380, size: 256, offset: 2048)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !171, file: !6, line: 516, baseType: !195, size: 32, offset: 2304)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !171, file: !6, line: 518, baseType: !398, size: 64, offset: 2368)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !6, line: 179, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 116, size: 768, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !400, file: !6, line: 120, baseType: !195, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !400, file: !6, line: 121, baseType: !195, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !400, file: !6, line: 122, baseType: !195, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !400, file: !6, line: 123, baseType: !195, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !400, file: !6, line: 124, baseType: !195, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !400, file: !6, line: 129, baseType: !195, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !400, file: !6, line: 130, baseType: !195, size: 32, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !400, file: !6, line: 139, baseType: !211, size: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !400, file: !6, line: 140, baseType: !211, size: 32, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !400, file: !6, line: 147, baseType: !195, size: 32, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !400, file: !6, line: 154, baseType: !211, size: 32, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !400, file: !6, line: 155, baseType: !211, size: 32, offset: 352)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !400, file: !6, line: 160, baseType: !233, size: 32, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !400, file: !6, line: 164, baseType: !195, size: 32, offset: 416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !400, file: !6, line: 165, baseType: !195, size: 32, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !400, file: !6, line: 166, baseType: !195, size: 32, offset: 480)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !400, file: !6, line: 167, baseType: !195, size: 32, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !400, file: !6, line: 168, baseType: !195, size: 32, offset: 544)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !400, file: !6, line: 169, baseType: !195, size: 32, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !400, file: !6, line: 175, baseType: !368, size: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !400, file: !6, line: 178, baseType: !194, size: 64, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !171, file: !6, line: 521, baseType: !233, size: 32, offset: 2432)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !171, file: !6, line: 522, baseType: !233, size: 32, offset: 2464)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !171, file: !6, line: 524, baseType: !426, size: 128, offset: 2496)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 128, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 16)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !171, file: !6, line: 525, baseType: !426, size: 128, offset: 2624)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !171, file: !6, line: 526, baseType: !426, size: 128, offset: 2752)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !171, file: !6, line: 528, baseType: !7, size: 32, offset: 2880)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !171, file: !6, line: 533, baseType: !233, size: 32, offset: 2912)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !171, file: !6, line: 535, baseType: !387, size: 8, offset: 2944)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !171, file: !6, line: 536, baseType: !374, size: 16, offset: 2960)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !171, file: !6, line: 537, baseType: !374, size: 16, offset: 2976)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !171, file: !6, line: 538, baseType: !233, size: 32, offset: 3008)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !171, file: !6, line: 539, baseType: !387, size: 8, offset: 3040)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !171, file: !6, line: 541, baseType: !233, size: 32, offset: 3072)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !171, file: !6, line: 550, baseType: !195, size: 32, offset: 3104)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !171, file: !6, line: 551, baseType: !195, size: 32, offset: 3136)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !171, file: !6, line: 553, baseType: !195, size: 32, offset: 3168)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !171, file: !6, line: 555, baseType: !211, size: 32, offset: 3200)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !171, file: !6, line: 564, baseType: !207, size: 64, offset: 3264)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !171, file: !6, line: 571, baseType: !195, size: 32, offset: 3328)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !171, file: !6, line: 572, baseType: !446, size: 256, offset: 3392)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 256, elements: !377)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !171, file: !6, line: 575, baseType: !211, size: 32, offset: 3648)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !171, file: !6, line: 576, baseType: !211, size: 32, offset: 3680)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !171, file: !6, line: 578, baseType: !195, size: 32, offset: 3712)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !171, file: !6, line: 579, baseType: !451, size: 320, offset: 3744)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 320, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 10)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !171, file: !6, line: 583, baseType: !195, size: 32, offset: 4064)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !171, file: !6, line: 583, baseType: !195, size: 32, offset: 4096)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !171, file: !6, line: 583, baseType: !195, size: 32, offset: 4128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !171, file: !6, line: 583, baseType: !195, size: 32, offset: 4160)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !171, file: !6, line: 589, baseType: !195, size: 32, offset: 4192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !171, file: !6, line: 594, baseType: !460, size: 64, offset: 4224)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !26, line: 136, size: 192, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_output_pass", scope: !461, file: !26, line: 137, baseType: !166, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output_pass", scope: !461, file: !26, line: 138, baseType: !166, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "is_dummy_pass", scope: !461, file: !26, line: 141, baseType: !233, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !171, file: !6, line: 595, baseType: !467, size: 64, offset: 4288)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !26, line: 157, size: 128, elements: !469)
!469 = !{!470, !475}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !468, file: !26, line: 158, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !169, !474}
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !26, line: 22, baseType: !25)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !468, file: !26, line: 159, baseType: !476, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !169, !204, !479, !211}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !171, file: !6, line: 596, baseType: !481, size: 64, offset: 4352)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !26, line: 165, size: 320, elements: !483)
!483 = !{!484, !485, !489, !490, !496}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !482, file: !26, line: 166, baseType: !166, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "consume_data", scope: !482, file: !26, line: 167, baseType: !486, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!195, !169}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "start_output_pass", scope: !482, file: !26, line: 168, baseType: !166, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "decompress_data", scope: !482, file: !26, line: 169, baseType: !491, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!195, !169, !494}
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !6, line: 68, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "coef_arrays", scope: !482, file: !26, line: 172, baseType: !497, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !171, file: !6, line: 597, baseType: !499, size: 64, offset: 4416)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !26, line: 176, size: 128, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !500, file: !26, line: 177, baseType: !471, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_data", scope: !500, file: !26, line: 178, baseType: !504, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !169, !494, !479, !211, !204, !479, !211}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !171, file: !6, line: 598, baseType: !508, size: 64, offset: 4480)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !26, line: 145, size: 320, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "consume_input", scope: !509, file: !26, line: 146, baseType: !486, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reset_input_controller", scope: !509, file: !26, line: 147, baseType: !166, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !509, file: !26, line: 148, baseType: !166, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input_pass", scope: !509, file: !26, line: 149, baseType: !166, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "has_multiple_scans", scope: !509, file: !26, line: 152, baseType: !233, size: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "eoi_reached", scope: !509, file: !26, line: 153, baseType: !233, size: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !171, file: !6, line: 599, baseType: !518, size: 64, offset: 4544)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !26, line: 188, size: 1408, elements: !520)
!520 = !{!521, !522, !523, !525, !526, !528, !529, !530, !531}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reset_marker_reader", scope: !519, file: !26, line: 189, baseType: !166, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "read_markers", scope: !519, file: !26, line: 194, baseType: !486, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "read_restart_marker", scope: !519, file: !26, line: 196, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_marker_parser_method", file: !6, line: 781, baseType: !315)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "process_COM", scope: !519, file: !26, line: 198, baseType: !524, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "process_APPn", scope: !519, file: !26, line: 199, baseType: !527, size: 1024, offset: 256)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 1024, elements: !427)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOI", scope: !519, file: !26, line: 204, baseType: !233, size: 32, offset: 1280)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOF", scope: !519, file: !26, line: 205, baseType: !233, size: 32, offset: 1312)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next_restart_num", scope: !519, file: !26, line: 206, baseType: !195, size: 32, offset: 1344)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "discarded_bytes", scope: !519, file: !26, line: 207, baseType: !7, size: 32, offset: 1376)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !171, file: !6, line: 600, baseType: !533, size: 64, offset: 4608)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !171, file: !6, line: 601, baseType: !535, size: 64, offset: 4672)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !26, line: 223, size: 704, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !536, file: !26, line: 224, baseType: !166, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_DCT", scope: !536, file: !26, line: 226, baseType: !540, size: 640, offset: 64)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 640, elements: !452)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "inverse_DCT_method_ptr", file: !26, line: 218, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !169, !398, !545, !204, !211}
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEFPTR", file: !6, line: 75, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !171, file: !6, line: 602, baseType: !548, size: 64, offset: 4736)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !26, line: 230, size: 192, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !549, file: !26, line: 231, baseType: !166, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !549, file: !26, line: 232, baseType: !504, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !549, file: !26, line: 240, baseType: !233, size: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !171, file: !6, line: 603, baseType: !555, size: 64, offset: 4800)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !26, line: 244, size: 128, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !556, file: !26, line: 245, baseType: !166, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !556, file: !26, line: 246, baseType: !560, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !169, !494, !211, !204, !195}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !171, file: !6, line: 604, baseType: !564, size: 64, offset: 4864)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !26, line: 252, size: 256, elements: !566)
!566 = !{!567, !571, !575, !576}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !565, file: !26, line: 253, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !169, !233}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "color_quantize", scope: !565, file: !26, line: 254, baseType: !572, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !169, !204, !204, !195}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !565, file: !26, line: 257, baseType: !166, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "new_color_map", scope: !565, file: !26, line: 258, baseType: !166, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mcu", scope: !163, file: !26, line: 213, baseType: !578, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!233, !169, !217}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "bitstate", scope: !160, file: !3, line: 62, baseType: !582, size: 128, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitread_perm_state", file: !583, line: 82, baseType: !584)
!583 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jdhuff.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "ae4ee10e9000ceb58d3d7f8a964b87b0")
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !583, line: 78, size: 128, elements: !585)
!585 = !{!586, !589, !590}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !584, file: !583, line: 79, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "bit_buf_type", file: !583, line: 68, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !209, line: 161, baseType: !256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bits_left", scope: !584, file: !583, line: 80, baseType: !195, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "printed_eod", scope: !584, file: !583, line: 81, baseType: !233, size: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !160, file: !3, line: 63, baseType: !592, size: 160, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "savable_state", file: !3, line: 35, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 32, size: 160, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "EOBRUN", scope: !593, file: !3, line: 33, baseType: !7, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "last_dc_val", scope: !593, file: !3, line: 34, baseType: !597, size: 128, offset: 32)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 128, elements: !377)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "restarts_to_go", scope: !160, file: !3, line: 66, baseType: !7, size: 32, offset: 416)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "derived_tbls", scope: !160, file: !3, line: 69, baseType: !600, size: 256, offset: 448)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 256, elements: !377)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "d_derived_tbl", file: !583, line: 43, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !583, line: 26, size: 13120, elements: !604)
!604 = !{!605, !607, !611, !613, !614, !616}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mincode", scope: !603, file: !583, line: 28, baseType: !606, size: 1088)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 1088, elements: !388)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "maxcode", scope: !603, file: !583, line: 29, baseType: !608, size: 1152, offset: 1088)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 1152, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 18)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "valptr", scope: !603, file: !583, line: 31, baseType: !612, size: 544, offset: 2240)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 544, elements: !388)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !603, file: !583, line: 34, baseType: !381, size: 64, offset: 2816)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "look_nbits", scope: !603, file: !583, line: 41, baseType: !615, size: 8192, offset: 2880)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 8192, elements: !392)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "look_sym", scope: !603, file: !583, line: 42, baseType: !391, size: 2048, offset: 11072)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ac_derived_tbl", scope: !160, file: !3, line: 71, baseType: !601, size: 64, offset: 704)
!618 = !{!0, !619}
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "extend_offset", scope: !2, file: !3, line: 213, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 512, elements: !427)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!623 = !{i32 7, !"Dwarf Version", i32 5}
!624 = !{i32 2, !"Debug Info Version", i32 3}
!625 = !{i32 1, !"wchar_size", i32 4}
!626 = !{i32 8, !"PIC Level", i32 2}
!627 = !{i32 7, !"PIE Level", i32 2}
!628 = !{i32 7, !"uwtable", i32 2}
!629 = !{i32 7, !"frame-pointer", i32 2}
!630 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!631 = distinct !DISubprogram(name: "jinit_phuff_decoder", scope: !3, file: !3, line: 615, type: !167, scopeLine: 616, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !632)
!632 = !{}
!633 = !DILocalVariable(name: "cinfo", arg: 1, scope: !631, file: !3, line: 615, type: !169)
!634 = !DILocation(line: 615, column: 39, scope: !631)
!635 = !DILocalVariable(name: "entropy", scope: !631, file: !3, line: 617, type: !157)
!636 = !DILocation(line: 617, column: 21, scope: !631)
!637 = !DILocalVariable(name: "coef_bit_ptr", scope: !631, file: !3, line: 618, type: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!639 = !DILocation(line: 618, column: 8, scope: !631)
!640 = !DILocalVariable(name: "ci", scope: !631, file: !3, line: 619, type: !195)
!641 = !DILocation(line: 619, column: 7, scope: !631)
!642 = !DILocalVariable(name: "i", scope: !631, file: !3, line: 619, type: !195)
!643 = !DILocation(line: 619, column: 11, scope: !631)
!644 = !DILocation(line: 622, column: 7, scope: !631)
!645 = !DILocation(line: 622, column: 14, scope: !631)
!646 = !DILocation(line: 622, column: 19, scope: !631)
!647 = !DILocation(line: 622, column: 48, scope: !631)
!648 = !DILocation(line: 622, column: 5, scope: !631)
!649 = !DILocation(line: 621, column: 11, scope: !631)
!650 = !DILocation(line: 624, column: 52, scope: !631)
!651 = !DILocation(line: 624, column: 3, scope: !631)
!652 = !DILocation(line: 624, column: 10, scope: !631)
!653 = !DILocation(line: 624, column: 18, scope: !631)
!654 = !DILocation(line: 625, column: 3, scope: !631)
!655 = !DILocation(line: 625, column: 12, scope: !631)
!656 = !DILocation(line: 625, column: 16, scope: !631)
!657 = !DILocation(line: 625, column: 27, scope: !631)
!658 = !DILocation(line: 628, column: 10, scope: !659)
!659 = distinct !DILexicalBlock(scope: !631, file: !3, line: 628, column: 3)
!660 = !DILocation(line: 628, column: 8, scope: !659)
!661 = !DILocation(line: 628, column: 15, scope: !662)
!662 = distinct !DILexicalBlock(scope: !659, file: !3, line: 628, column: 3)
!663 = !DILocation(line: 628, column: 17, scope: !662)
!664 = !DILocation(line: 628, column: 3, scope: !659)
!665 = !DILocation(line: 629, column: 5, scope: !666)
!666 = distinct !DILexicalBlock(scope: !662, file: !3, line: 628, column: 39)
!667 = !DILocation(line: 629, column: 14, scope: !666)
!668 = !DILocation(line: 629, column: 27, scope: !666)
!669 = !DILocation(line: 629, column: 30, scope: !666)
!670 = !DILocation(line: 630, column: 3, scope: !666)
!671 = !DILocation(line: 628, column: 35, scope: !662)
!672 = !DILocation(line: 628, column: 3, scope: !662)
!673 = distinct !{!673, !664, !674, !675}
!674 = !DILocation(line: 630, column: 3, scope: !659)
!675 = !{!"llvm.loop.mustprogress"}
!676 = !DILocation(line: 634, column: 7, scope: !631)
!677 = !DILocation(line: 634, column: 14, scope: !631)
!678 = !DILocation(line: 634, column: 19, scope: !631)
!679 = !DILocation(line: 634, column: 48, scope: !631)
!680 = !DILocation(line: 635, column: 5, scope: !631)
!681 = !DILocation(line: 635, column: 12, scope: !631)
!682 = !DILocation(line: 635, column: 26, scope: !631)
!683 = !DILocation(line: 635, column: 35, scope: !631)
!684 = !DILocation(line: 634, column: 5, scope: !631)
!685 = !DILocation(line: 633, column: 3, scope: !631)
!686 = !DILocation(line: 633, column: 10, scope: !631)
!687 = !DILocation(line: 633, column: 20, scope: !631)
!688 = !DILocation(line: 636, column: 20, scope: !631)
!689 = !DILocation(line: 636, column: 27, scope: !631)
!690 = !DILocation(line: 636, column: 16, scope: !631)
!691 = !DILocation(line: 637, column: 11, scope: !692)
!692 = distinct !DILexicalBlock(scope: !631, file: !3, line: 637, column: 3)
!693 = !DILocation(line: 637, column: 8, scope: !692)
!694 = !DILocation(line: 637, column: 16, scope: !695)
!695 = distinct !DILexicalBlock(scope: !692, file: !3, line: 637, column: 3)
!696 = !DILocation(line: 637, column: 21, scope: !695)
!697 = !DILocation(line: 637, column: 28, scope: !695)
!698 = !DILocation(line: 637, column: 19, scope: !695)
!699 = !DILocation(line: 637, column: 3, scope: !692)
!700 = !DILocation(line: 638, column: 12, scope: !701)
!701 = distinct !DILexicalBlock(scope: !695, file: !3, line: 638, column: 5)
!702 = !DILocation(line: 638, column: 10, scope: !701)
!703 = !DILocation(line: 638, column: 17, scope: !704)
!704 = distinct !DILexicalBlock(scope: !701, file: !3, line: 638, column: 5)
!705 = !DILocation(line: 638, column: 19, scope: !704)
!706 = !DILocation(line: 638, column: 5, scope: !701)
!707 = !DILocation(line: 639, column: 20, scope: !704)
!708 = !DILocation(line: 639, column: 23, scope: !704)
!709 = !DILocation(line: 639, column: 7, scope: !704)
!710 = !DILocation(line: 638, column: 32, scope: !704)
!711 = !DILocation(line: 638, column: 5, scope: !704)
!712 = distinct !{!712, !706, !713, !675}
!713 = !DILocation(line: 639, column: 26, scope: !701)
!714 = !DILocation(line: 637, column: 46, scope: !695)
!715 = !DILocation(line: 637, column: 3, scope: !695)
!716 = distinct !{!716, !699, !717, !675}
!717 = !DILocation(line: 639, column: 26, scope: !692)
!718 = !DILocation(line: 640, column: 1, scope: !631)
!719 = distinct !DISubprogram(name: "start_pass_phuff_decoder", scope: !3, file: !3, line: 92, type: !167, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !632)
!720 = !DILocalVariable(name: "cinfo", arg: 1, scope: !719, file: !3, line: 92, type: !169)
!721 = !DILocation(line: 92, column: 44, scope: !719)
!722 = !DILocalVariable(name: "entropy", scope: !719, file: !3, line: 94, type: !157)
!723 = !DILocation(line: 94, column: 21, scope: !719)
!724 = !DILocation(line: 94, column: 51, scope: !719)
!725 = !DILocation(line: 94, column: 58, scope: !719)
!726 = !DILocalVariable(name: "is_DC_band", scope: !719, file: !3, line: 95, type: !233)
!727 = !DILocation(line: 95, column: 11, scope: !719)
!728 = !DILocalVariable(name: "bad", scope: !719, file: !3, line: 95, type: !233)
!729 = !DILocation(line: 95, column: 23, scope: !719)
!730 = !DILocalVariable(name: "ci", scope: !719, file: !3, line: 96, type: !195)
!731 = !DILocation(line: 96, column: 7, scope: !719)
!732 = !DILocalVariable(name: "coefi", scope: !719, file: !3, line: 96, type: !195)
!733 = !DILocation(line: 96, column: 11, scope: !719)
!734 = !DILocalVariable(name: "tbl", scope: !719, file: !3, line: 96, type: !195)
!735 = !DILocation(line: 96, column: 18, scope: !719)
!736 = !DILocalVariable(name: "coef_bit_ptr", scope: !719, file: !3, line: 97, type: !638)
!737 = !DILocation(line: 97, column: 8, scope: !719)
!738 = !DILocalVariable(name: "compptr", scope: !719, file: !3, line: 98, type: !398)
!739 = !DILocation(line: 98, column: 25, scope: !719)
!740 = !DILocation(line: 100, column: 17, scope: !719)
!741 = !DILocation(line: 100, column: 24, scope: !719)
!742 = !DILocation(line: 100, column: 27, scope: !719)
!743 = !DILocation(line: 100, column: 14, scope: !719)
!744 = !DILocation(line: 103, column: 7, scope: !719)
!745 = !DILocation(line: 104, column: 7, scope: !746)
!746 = distinct !DILexicalBlock(scope: !719, file: !3, line: 104, column: 7)
!747 = !DILocation(line: 105, column: 9, scope: !748)
!748 = distinct !DILexicalBlock(scope: !749, file: !3, line: 105, column: 9)
!749 = distinct !DILexicalBlock(scope: !746, file: !3, line: 104, column: 19)
!750 = !DILocation(line: 105, column: 16, scope: !748)
!751 = !DILocation(line: 105, column: 19, scope: !748)
!752 = !DILocation(line: 106, column: 11, scope: !748)
!753 = !DILocation(line: 106, column: 7, scope: !748)
!754 = !DILocation(line: 107, column: 3, scope: !749)
!755 = !DILocation(line: 109, column: 9, scope: !756)
!756 = distinct !DILexicalBlock(scope: !757, file: !3, line: 109, column: 9)
!757 = distinct !DILexicalBlock(scope: !746, file: !3, line: 107, column: 10)
!758 = !DILocation(line: 109, column: 16, scope: !756)
!759 = !DILocation(line: 109, column: 21, scope: !756)
!760 = !DILocation(line: 109, column: 28, scope: !756)
!761 = !DILocation(line: 109, column: 19, scope: !756)
!762 = !DILocation(line: 109, column: 31, scope: !756)
!763 = !DILocation(line: 109, column: 34, scope: !756)
!764 = !DILocation(line: 109, column: 41, scope: !756)
!765 = !DILocation(line: 109, column: 44, scope: !756)
!766 = !DILocation(line: 110, column: 11, scope: !756)
!767 = !DILocation(line: 110, column: 7, scope: !756)
!768 = !DILocation(line: 112, column: 9, scope: !769)
!769 = distinct !DILexicalBlock(scope: !757, file: !3, line: 112, column: 9)
!770 = !DILocation(line: 112, column: 16, scope: !769)
!771 = !DILocation(line: 112, column: 30, scope: !769)
!772 = !DILocation(line: 113, column: 11, scope: !769)
!773 = !DILocation(line: 113, column: 7, scope: !769)
!774 = !DILocation(line: 115, column: 7, scope: !775)
!775 = distinct !DILexicalBlock(scope: !719, file: !3, line: 115, column: 7)
!776 = !DILocation(line: 115, column: 14, scope: !775)
!777 = !DILocation(line: 115, column: 17, scope: !775)
!778 = !DILocation(line: 117, column: 9, scope: !779)
!779 = distinct !DILexicalBlock(scope: !780, file: !3, line: 117, column: 9)
!780 = distinct !DILexicalBlock(scope: !775, file: !3, line: 115, column: 23)
!781 = !DILocation(line: 117, column: 16, scope: !779)
!782 = !DILocation(line: 117, column: 22, scope: !779)
!783 = !DILocation(line: 117, column: 29, scope: !779)
!784 = !DILocation(line: 117, column: 31, scope: !779)
!785 = !DILocation(line: 117, column: 19, scope: !779)
!786 = !DILocation(line: 118, column: 11, scope: !779)
!787 = !DILocation(line: 118, column: 7, scope: !779)
!788 = !DILocation(line: 119, column: 3, scope: !780)
!789 = !DILocation(line: 120, column: 7, scope: !790)
!790 = distinct !DILexicalBlock(scope: !719, file: !3, line: 120, column: 7)
!791 = !DILocation(line: 120, column: 14, scope: !790)
!792 = !DILocation(line: 120, column: 17, scope: !790)
!793 = !DILocation(line: 121, column: 9, scope: !790)
!794 = !DILocation(line: 121, column: 5, scope: !790)
!795 = !DILocation(line: 122, column: 7, scope: !796)
!796 = distinct !DILexicalBlock(scope: !719, file: !3, line: 122, column: 7)
!797 = !DILocation(line: 123, column: 5, scope: !796)
!798 = !DILocation(line: 129, column: 11, scope: !799)
!799 = distinct !DILexicalBlock(scope: !719, file: !3, line: 129, column: 3)
!800 = !DILocation(line: 129, column: 8, scope: !799)
!801 = !DILocation(line: 129, column: 16, scope: !802)
!802 = distinct !DILexicalBlock(scope: !799, file: !3, line: 129, column: 3)
!803 = !DILocation(line: 129, column: 21, scope: !802)
!804 = !DILocation(line: 129, column: 28, scope: !802)
!805 = !DILocation(line: 129, column: 19, scope: !802)
!806 = !DILocation(line: 129, column: 3, scope: !799)
!807 = !DILocalVariable(name: "cindex", scope: !808, file: !3, line: 130, type: !195)
!808 = distinct !DILexicalBlock(scope: !802, file: !3, line: 129, column: 49)
!809 = !DILocation(line: 130, column: 9, scope: !808)
!810 = !DILocation(line: 130, column: 18, scope: !808)
!811 = !DILocation(line: 130, column: 25, scope: !808)
!812 = !DILocation(line: 130, column: 39, scope: !808)
!813 = !DILocation(line: 130, column: 44, scope: !808)
!814 = !DILocation(line: 131, column: 22, scope: !808)
!815 = !DILocation(line: 131, column: 29, scope: !808)
!816 = !DILocation(line: 131, column: 39, scope: !808)
!817 = !DILocation(line: 131, column: 18, scope: !808)
!818 = !DILocation(line: 132, column: 10, scope: !819)
!819 = distinct !DILexicalBlock(scope: !808, file: !3, line: 132, column: 9)
!820 = !DILocation(line: 132, column: 21, scope: !819)
!821 = !DILocation(line: 132, column: 24, scope: !819)
!822 = !DILocation(line: 132, column: 40, scope: !819)
!823 = !DILocation(line: 133, column: 7, scope: !819)
!824 = !DILocation(line: 134, column: 18, scope: !825)
!825 = distinct !DILexicalBlock(scope: !808, file: !3, line: 134, column: 5)
!826 = !DILocation(line: 134, column: 25, scope: !825)
!827 = !DILocation(line: 134, column: 16, scope: !825)
!828 = !DILocation(line: 134, column: 10, scope: !825)
!829 = !DILocation(line: 134, column: 29, scope: !830)
!830 = distinct !DILexicalBlock(scope: !825, file: !3, line: 134, column: 5)
!831 = !DILocation(line: 134, column: 38, scope: !830)
!832 = !DILocation(line: 134, column: 45, scope: !830)
!833 = !DILocation(line: 134, column: 35, scope: !830)
!834 = !DILocation(line: 134, column: 5, scope: !825)
!835 = !DILocalVariable(name: "expected", scope: !836, file: !3, line: 135, type: !195)
!836 = distinct !DILexicalBlock(scope: !830, file: !3, line: 134, column: 58)
!837 = !DILocation(line: 135, column: 11, scope: !836)
!838 = !DILocation(line: 135, column: 23, scope: !836)
!839 = !DILocation(line: 135, column: 36, scope: !836)
!840 = !DILocation(line: 135, column: 43, scope: !836)
!841 = !DILocation(line: 135, column: 22, scope: !836)
!842 = !DILocation(line: 135, column: 54, scope: !836)
!843 = !DILocation(line: 135, column: 67, scope: !836)
!844 = !DILocation(line: 136, column: 11, scope: !845)
!845 = distinct !DILexicalBlock(scope: !836, file: !3, line: 136, column: 11)
!846 = !DILocation(line: 136, column: 18, scope: !845)
!847 = !DILocation(line: 136, column: 24, scope: !845)
!848 = !DILocation(line: 136, column: 21, scope: !845)
!849 = !DILocation(line: 137, column: 2, scope: !845)
!850 = !DILocation(line: 138, column: 29, scope: !836)
!851 = !DILocation(line: 138, column: 36, scope: !836)
!852 = !DILocation(line: 138, column: 7, scope: !836)
!853 = !DILocation(line: 138, column: 20, scope: !836)
!854 = !DILocation(line: 138, column: 27, scope: !836)
!855 = !DILocation(line: 139, column: 5, scope: !836)
!856 = !DILocation(line: 134, column: 54, scope: !830)
!857 = !DILocation(line: 134, column: 5, scope: !830)
!858 = distinct !{!858, !834, !859, !675}
!859 = !DILocation(line: 139, column: 5, scope: !825)
!860 = !DILocation(line: 140, column: 3, scope: !808)
!861 = !DILocation(line: 129, column: 45, scope: !802)
!862 = !DILocation(line: 129, column: 3, scope: !802)
!863 = distinct !{!863, !806, !864, !675}
!864 = !DILocation(line: 140, column: 3, scope: !799)
!865 = !DILocation(line: 143, column: 7, scope: !866)
!866 = distinct !DILexicalBlock(scope: !719, file: !3, line: 143, column: 7)
!867 = !DILocation(line: 143, column: 14, scope: !866)
!868 = !DILocation(line: 143, column: 17, scope: !866)
!869 = !DILocation(line: 144, column: 9, scope: !870)
!870 = distinct !DILexicalBlock(scope: !871, file: !3, line: 144, column: 9)
!871 = distinct !DILexicalBlock(scope: !866, file: !3, line: 143, column: 23)
!872 = !DILocation(line: 145, column: 7, scope: !870)
!873 = !DILocation(line: 145, column: 16, scope: !870)
!874 = !DILocation(line: 145, column: 20, scope: !870)
!875 = !DILocation(line: 145, column: 31, scope: !870)
!876 = !DILocation(line: 147, column: 7, scope: !870)
!877 = !DILocation(line: 147, column: 16, scope: !870)
!878 = !DILocation(line: 147, column: 20, scope: !870)
!879 = !DILocation(line: 147, column: 31, scope: !870)
!880 = !DILocation(line: 148, column: 3, scope: !871)
!881 = !DILocation(line: 149, column: 9, scope: !882)
!882 = distinct !DILexicalBlock(scope: !883, file: !3, line: 149, column: 9)
!883 = distinct !DILexicalBlock(scope: !866, file: !3, line: 148, column: 10)
!884 = !DILocation(line: 150, column: 7, scope: !882)
!885 = !DILocation(line: 150, column: 16, scope: !882)
!886 = !DILocation(line: 150, column: 20, scope: !882)
!887 = !DILocation(line: 150, column: 31, scope: !882)
!888 = !DILocation(line: 152, column: 7, scope: !882)
!889 = !DILocation(line: 152, column: 16, scope: !882)
!890 = !DILocation(line: 152, column: 20, scope: !882)
!891 = !DILocation(line: 152, column: 31, scope: !882)
!892 = !DILocation(line: 155, column: 11, scope: !893)
!893 = distinct !DILexicalBlock(scope: !719, file: !3, line: 155, column: 3)
!894 = !DILocation(line: 155, column: 8, scope: !893)
!895 = !DILocation(line: 155, column: 16, scope: !896)
!896 = distinct !DILexicalBlock(scope: !893, file: !3, line: 155, column: 3)
!897 = !DILocation(line: 155, column: 21, scope: !896)
!898 = !DILocation(line: 155, column: 28, scope: !896)
!899 = !DILocation(line: 155, column: 19, scope: !896)
!900 = !DILocation(line: 155, column: 3, scope: !893)
!901 = !DILocation(line: 156, column: 15, scope: !902)
!902 = distinct !DILexicalBlock(scope: !896, file: !3, line: 155, column: 49)
!903 = !DILocation(line: 156, column: 22, scope: !902)
!904 = !DILocation(line: 156, column: 36, scope: !902)
!905 = !DILocation(line: 156, column: 13, scope: !902)
!906 = !DILocation(line: 160, column: 9, scope: !907)
!907 = distinct !DILexicalBlock(scope: !902, file: !3, line: 160, column: 9)
!908 = !DILocation(line: 161, column: 11, scope: !909)
!909 = distinct !DILexicalBlock(scope: !910, file: !3, line: 161, column: 11)
!910 = distinct !DILexicalBlock(scope: !907, file: !3, line: 160, column: 21)
!911 = !DILocation(line: 161, column: 18, scope: !909)
!912 = !DILocation(line: 161, column: 21, scope: !909)
!913 = !DILocation(line: 162, column: 8, scope: !914)
!914 = distinct !DILexicalBlock(scope: !909, file: !3, line: 161, column: 27)
!915 = !DILocation(line: 162, column: 17, scope: !914)
!916 = !DILocation(line: 162, column: 6, scope: !914)
!917 = !DILocation(line: 163, column: 6, scope: !918)
!918 = distinct !DILexicalBlock(scope: !914, file: !3, line: 163, column: 6)
!919 = !DILocation(line: 163, column: 10, scope: !918)
!920 = !DILocation(line: 163, column: 14, scope: !918)
!921 = !DILocation(line: 163, column: 17, scope: !918)
!922 = !DILocation(line: 163, column: 21, scope: !918)
!923 = !DILocation(line: 163, column: 38, scope: !918)
!924 = !DILocation(line: 164, column: 6, scope: !918)
!925 = !DILocation(line: 164, column: 13, scope: !918)
!926 = !DILocation(line: 164, column: 30, scope: !918)
!927 = !DILocation(line: 164, column: 35, scope: !918)
!928 = !DILocation(line: 165, column: 4, scope: !918)
!929 = !DILocation(line: 166, column: 26, scope: !914)
!930 = !DILocation(line: 166, column: 33, scope: !914)
!931 = !DILocation(line: 166, column: 40, scope: !914)
!932 = !DILocation(line: 166, column: 57, scope: !914)
!933 = !DILocation(line: 167, column: 7, scope: !914)
!934 = !DILocation(line: 167, column: 16, scope: !914)
!935 = !DILocation(line: 167, column: 29, scope: !914)
!936 = !DILocation(line: 166, column: 2, scope: !914)
!937 = !DILocation(line: 168, column: 7, scope: !914)
!938 = !DILocation(line: 169, column: 5, scope: !910)
!939 = !DILocation(line: 170, column: 13, scope: !940)
!940 = distinct !DILexicalBlock(scope: !907, file: !3, line: 169, column: 12)
!941 = !DILocation(line: 170, column: 22, scope: !940)
!942 = !DILocation(line: 170, column: 11, scope: !940)
!943 = !DILocation(line: 171, column: 11, scope: !944)
!944 = distinct !DILexicalBlock(scope: !940, file: !3, line: 171, column: 11)
!945 = !DILocation(line: 171, column: 15, scope: !944)
!946 = !DILocation(line: 171, column: 19, scope: !944)
!947 = !DILocation(line: 171, column: 22, scope: !944)
!948 = !DILocation(line: 171, column: 26, scope: !944)
!949 = !DILocation(line: 171, column: 43, scope: !944)
!950 = !DILocation(line: 172, column: 11, scope: !944)
!951 = !DILocation(line: 172, column: 18, scope: !944)
!952 = !DILocation(line: 172, column: 35, scope: !944)
!953 = !DILocation(line: 172, column: 40, scope: !944)
!954 = !DILocation(line: 173, column: 9, scope: !944)
!955 = !DILocation(line: 174, column: 31, scope: !940)
!956 = !DILocation(line: 174, column: 38, scope: !940)
!957 = !DILocation(line: 174, column: 45, scope: !940)
!958 = !DILocation(line: 174, column: 62, scope: !940)
!959 = !DILocation(line: 175, column: 12, scope: !940)
!960 = !DILocation(line: 175, column: 21, scope: !940)
!961 = !DILocation(line: 175, column: 34, scope: !940)
!962 = !DILocation(line: 174, column: 7, scope: !940)
!963 = !DILocation(line: 177, column: 33, scope: !940)
!964 = !DILocation(line: 177, column: 42, scope: !940)
!965 = !DILocation(line: 177, column: 55, scope: !940)
!966 = !DILocation(line: 177, column: 7, scope: !940)
!967 = !DILocation(line: 177, column: 16, scope: !940)
!968 = !DILocation(line: 177, column: 31, scope: !940)
!969 = !DILocation(line: 180, column: 5, scope: !902)
!970 = !DILocation(line: 180, column: 14, scope: !902)
!971 = !DILocation(line: 180, column: 20, scope: !902)
!972 = !DILocation(line: 180, column: 32, scope: !902)
!973 = !DILocation(line: 180, column: 36, scope: !902)
!974 = !DILocation(line: 181, column: 3, scope: !902)
!975 = !DILocation(line: 155, column: 45, scope: !896)
!976 = !DILocation(line: 155, column: 3, scope: !896)
!977 = distinct !{!977, !900, !978, !675}
!978 = !DILocation(line: 181, column: 3, scope: !893)
!979 = !DILocation(line: 184, column: 3, scope: !719)
!980 = !DILocation(line: 184, column: 12, scope: !719)
!981 = !DILocation(line: 184, column: 21, scope: !719)
!982 = !DILocation(line: 184, column: 31, scope: !719)
!983 = !DILocation(line: 185, column: 3, scope: !719)
!984 = !DILocation(line: 185, column: 12, scope: !719)
!985 = !DILocation(line: 185, column: 21, scope: !719)
!986 = !DILocation(line: 185, column: 32, scope: !719)
!987 = !DILocation(line: 186, column: 3, scope: !719)
!988 = !DILocation(line: 186, column: 12, scope: !719)
!989 = !DILocation(line: 186, column: 21, scope: !719)
!990 = !DILocation(line: 186, column: 33, scope: !719)
!991 = !DILocation(line: 189, column: 3, scope: !719)
!992 = !DILocation(line: 189, column: 12, scope: !719)
!993 = !DILocation(line: 189, column: 18, scope: !719)
!994 = !DILocation(line: 189, column: 25, scope: !719)
!995 = !DILocation(line: 192, column: 29, scope: !719)
!996 = !DILocation(line: 192, column: 36, scope: !719)
!997 = !DILocation(line: 192, column: 3, scope: !719)
!998 = !DILocation(line: 192, column: 12, scope: !719)
!999 = !DILocation(line: 192, column: 27, scope: !719)
!1000 = !DILocation(line: 193, column: 1, scope: !719)
!1001 = distinct !DISubprogram(name: "decode_mcu_DC_first", scope: !3, file: !3, line: 281, type: !579, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !632)
!1002 = !DILocalVariable(name: "cinfo", arg: 1, scope: !1001, file: !3, line: 281, type: !169)
!1003 = !DILocation(line: 281, column: 39, scope: !1001)
!1004 = !DILocalVariable(name: "MCU_data", arg: 2, scope: !1001, file: !3, line: 281, type: !217)
!1005 = !DILocation(line: 281, column: 57, scope: !1001)
!1006 = !DILocalVariable(name: "entropy", scope: !1001, file: !3, line: 283, type: !157)
!1007 = !DILocation(line: 283, column: 21, scope: !1001)
!1008 = !DILocation(line: 283, column: 51, scope: !1001)
!1009 = !DILocation(line: 283, column: 58, scope: !1001)
!1010 = !DILocalVariable(name: "Al", scope: !1001, file: !3, line: 284, type: !195)
!1011 = !DILocation(line: 284, column: 7, scope: !1001)
!1012 = !DILocation(line: 284, column: 12, scope: !1001)
!1013 = !DILocation(line: 284, column: 19, scope: !1001)
!1014 = !DILocalVariable(name: "s", scope: !1001, file: !3, line: 285, type: !195)
!1015 = !DILocation(line: 285, column: 16, scope: !1001)
!1016 = !DILocalVariable(name: "r", scope: !1001, file: !3, line: 285, type: !195)
!1017 = !DILocation(line: 285, column: 19, scope: !1001)
!1018 = !DILocalVariable(name: "blkn", scope: !1001, file: !3, line: 286, type: !195)
!1019 = !DILocation(line: 286, column: 7, scope: !1001)
!1020 = !DILocalVariable(name: "ci", scope: !1001, file: !3, line: 286, type: !195)
!1021 = !DILocation(line: 286, column: 13, scope: !1001)
!1022 = !DILocalVariable(name: "block", scope: !1001, file: !3, line: 287, type: !218)
!1023 = !DILocation(line: 287, column: 13, scope: !1001)
!1024 = !DILocalVariable(name: "get_buffer", scope: !1001, file: !3, line: 288, type: !587)
!1025 = !DILocation(line: 288, column: 3, scope: !1001)
!1026 = !DILocalVariable(name: "bits_left", scope: !1001, file: !3, line: 288, type: !195)
!1027 = !DILocalVariable(name: "br_state", scope: !1001, file: !3, line: 288, type: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitread_working_state", file: !583, line: 97, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !583, line: 84, size: 448, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1036, !1037}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !1029, file: !583, line: 86, baseType: !309, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !1029, file: !583, line: 87, baseType: !196, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !1029, file: !583, line: 88, baseType: !195, size: 32, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !1029, file: !583, line: 92, baseType: !587, size: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "bits_left", scope: !1029, file: !583, line: 93, baseType: !195, size: 32, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "cinfo", scope: !1029, file: !583, line: 95, baseType: !169, size: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "printed_eod_ptr", scope: !1029, file: !583, line: 96, baseType: !1038, size: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!1039 = !DILocalVariable(name: "state", scope: !1001, file: !3, line: 289, type: !592)
!1040 = !DILocation(line: 289, column: 17, scope: !1001)
!1041 = !DILocalVariable(name: "tbl", scope: !1001, file: !3, line: 290, type: !601)
!1042 = !DILocation(line: 290, column: 19, scope: !1001)
!1043 = !DILocalVariable(name: "compptr", scope: !1001, file: !3, line: 291, type: !398)
!1044 = !DILocation(line: 291, column: 25, scope: !1001)
!1045 = !DILocation(line: 294, column: 7, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 294, column: 7)
!1047 = !DILocation(line: 294, column: 14, scope: !1046)
!1048 = !DILocation(line: 295, column: 9, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 295, column: 9)
!1050 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 294, column: 32)
!1051 = !DILocation(line: 295, column: 18, scope: !1049)
!1052 = !DILocation(line: 295, column: 33, scope: !1049)
!1053 = !DILocation(line: 296, column: 29, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 296, column: 11)
!1055 = !DILocation(line: 296, column: 13, scope: !1054)
!1056 = !DILocation(line: 296, column: 11, scope: !1054)
!1057 = !DILocation(line: 297, column: 2, scope: !1054)
!1058 = !DILocation(line: 296, column: 34, scope: !1054)
!1059 = !DILocation(line: 298, column: 3, scope: !1050)
!1060 = !DILocation(line: 301, column: 3, scope: !1001)
!1061 = !DILocation(line: 302, column: 3, scope: !1001)
!1062 = !DILocation(line: 306, column: 13, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 306, column: 3)
!1064 = !DILocation(line: 306, column: 8, scope: !1063)
!1065 = !DILocation(line: 306, column: 18, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 306, column: 3)
!1067 = !DILocation(line: 306, column: 25, scope: !1066)
!1068 = !DILocation(line: 306, column: 32, scope: !1066)
!1069 = !DILocation(line: 306, column: 23, scope: !1066)
!1070 = !DILocation(line: 306, column: 3, scope: !1063)
!1071 = !DILocation(line: 307, column: 13, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 306, column: 55)
!1073 = !DILocation(line: 307, column: 22, scope: !1072)
!1074 = !DILocation(line: 307, column: 11, scope: !1072)
!1075 = !DILocation(line: 308, column: 10, scope: !1072)
!1076 = !DILocation(line: 308, column: 17, scope: !1072)
!1077 = !DILocation(line: 308, column: 32, scope: !1072)
!1078 = !DILocation(line: 308, column: 8, scope: !1072)
!1079 = !DILocation(line: 309, column: 15, scope: !1072)
!1080 = !DILocation(line: 309, column: 22, scope: !1072)
!1081 = !DILocation(line: 309, column: 36, scope: !1072)
!1082 = !DILocation(line: 309, column: 13, scope: !1072)
!1083 = !DILocation(line: 310, column: 11, scope: !1072)
!1084 = !DILocation(line: 310, column: 20, scope: !1072)
!1085 = !DILocation(line: 310, column: 33, scope: !1072)
!1086 = !DILocation(line: 310, column: 42, scope: !1072)
!1087 = !DILocation(line: 310, column: 9, scope: !1072)
!1088 = !DILocalVariable(name: "nb", scope: !1089, file: !3, line: 315, type: !195)
!1089 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 315, column: 5)
!1090 = !DILocation(line: 315, column: 5, scope: !1089)
!1091 = !DILocalVariable(name: "look", scope: !1089, file: !3, line: 315, type: !195)
!1092 = !DILocation(line: 315, column: 5, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 315, column: 5)
!1094 = !DILocation(line: 315, column: 5, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 315, column: 5)
!1096 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 315, column: 5)
!1097 = !DILocation(line: 315, column: 5, scope: !1098)
