; ModuleID = 'cBench/consumer_jpeg_c/src/jerror.c'
source_filename = "cBench/consumer_jpeg_c/src/jerror.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.jpeg_common_struct = type { ptr, ptr, ptr, i32, i32 }

@.str = private unnamed_addr constant [22 x i8] c"Bogus message code %d\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [57 x i8] c"Sorry, there are legal restrictions on arithmetic coding\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [32 x i8] c"ALIGN_TYPE is wrong, please fix\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [37 x i8] c"MAX_ALLOC_CHUNK is wrong, please fix\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [26 x i8] c"Bogus buffer control mode\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [31 x i8] c"Invalid component ID %d in SOS\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [40 x i8] c"IDCT output block size %d not supported\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [23 x i8] c"Bogus input colorspace\00", align 1, !dbg !37
@.str.8 = private unnamed_addr constant [22 x i8] c"Bogus JPEG colorspace\00", align 1, !dbg !42

!460 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!461 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!462 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!463 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!464 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!465 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!466 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!467 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!468 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!469 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!470 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!471 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!472 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!473 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!474 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!475 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!476 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!477 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!478 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!479 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!480 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!481 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!482 = !DIEnumerator(name: "JTRC_RST", value: 97)
!483 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!484 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!485 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!486 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!487 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!488 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!489 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!490 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!491 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!492 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!493 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!494 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!495 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!496 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!497 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!498 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!499 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!500 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!501 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!502 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!503 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!504 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!505 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!508 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!509 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !44, !49, !54, !59, !64, !69, !74, !76, !78, !80, !85, !90, !95, !100, !102, !104, !109, !111, !116, !121, !126, !128, !130, !132, !134, !136, !141, !143, !148, !150, !152, !154, !156, !158, !160, !165, !170, !172, !174, !179, !181, !183, !188, !190, !192, !197, !199, !201, !203, !208, !210, !212, !214, !219, !221, !223, !225, !230, !232, !234, !236, !238, !240, !242, !244, !249, !251, !256, !258, !260, !262, !264, !266, !268, !270, !272, !274, !276, !281, !286, !288, !290, !292, !297, !299, !301, !306, !308, !310, !315, !317, !322, !324, !329, !334, !336, !338, !340, !342, !347, !349, !351, !353, !355, !357, !362, !364, !366, !368, !373, !375, !377, !510}
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !380, line: 88, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 4)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 7744, elements: !519)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!519 = !{!520}
!520 = !DISubrange(count: 121)
!521 = !{i32 7, !"Dwarf Version", i32 5}
!522 = !{i32 2, !"Debug Info Version", i32 3}
!523 = !{i32 1, !"wchar_size", i32 4}
!524 = !{i32 8, !"PIC Level", i32 2}
!525 = !{i32 7, !"PIE Level", i32 2}
!526 = !{i32 7, !"uwtable", i32 2}
!527 = !{i32 7, !"frame-pointer", i32 2}
!528 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!529 = distinct !DISubprogram(name: "jpeg_std_error", scope: !380, file: !380, line: 207, type: !530, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !379, retainedNodes: !653)
!530 = !DISubroutineType(types: !531)
!531 = !{!532, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !534, line: 618, size: 1344, elements: !535)
!534 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpeglib.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "2a2b23235fe587b10147d741e3371e67")
!535 = !{!536, !625, !626, !627, !632, !633, !634, !645, !646, !647, !649, !650, !651, !652}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !533, file: !534, line: 620, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !540}
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !534, line: 248, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !534, line: 240, size: 256, elements: !543)
!543 = !{!544, !545, !614, !623, !624}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !542, file: !534, line: 241, baseType: !532, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !542, file: !534, line: 241, baseType: !546, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !534, line: 731, size: 768, elements: !548)
!548 = !{!549, !556, !557, !569, !583, !591, !598, !599, !603, !607, !611, !612}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !547, file: !534, line: 733, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!507, !540, !508, !553}
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !554, line: 18, baseType: !555)
!554 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!555 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !547, file: !534, line: 735, baseType: !550, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !547, file: !534, line: 737, baseType: !558, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!561, !540, !508, !568, !568}
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !534, line: 67, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !534, line: 66, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !566, line: 59, baseType: !567)
!566 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!567 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !566, line: 171, baseType: !383)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !547, file: !534, line: 740, baseType: !570, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!573, !540, !508, !568, !568}
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !534, line: 72, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !534, line: 71, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !534, line: 70, baseType: !578)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 1024, elements: !581)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !566, line: 99, baseType: !580)
!580 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!581 = !{!582}
!582 = !DISubrange(count: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !547, file: !534, line: 743, baseType: !584, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!587, !540, !508, !590, !568, !568, !568}
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !534, line: 727, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !534, line: 727, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !566, line: 227, baseType: !508)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !547, file: !534, line: 749, baseType: !592, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!595, !540, !508, !590, !568, !568, !568}
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !534, line: 728, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !534, line: 728, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !547, file: !534, line: 755, baseType: !537, size: 64, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !547, file: !534, line: 756, baseType: !600, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!561, !540, !587, !568, !568, !590}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !547, file: !534, line: 761, baseType: !604, size: 64, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!573, !540, !595, !568, !568, !590}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !547, file: !534, line: 766, baseType: !608, size: 64, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !540, !508}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !547, file: !534, line: 767, baseType: !537, size: 64, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !547, file: !534, line: 774, baseType: !613, size: 64, offset: 704)
!613 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !542, file: !534, line: 241, baseType: !615, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !534, line: 676, size: 256, elements: !617)
!617 = !{!618, !619, !620, !621, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !616, file: !534, line: 677, baseType: !537, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !616, file: !534, line: 679, baseType: !613, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !616, file: !534, line: 680, baseType: !613, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !616, file: !534, line: 681, baseType: !508, size: 32, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !616, file: !534, line: 682, baseType: !508, size: 32, offset: 224)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !542, file: !534, line: 241, baseType: !590, size: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !542, file: !534, line: 241, baseType: !508, size: 32, offset: 224)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !533, file: !534, line: 622, baseType: !608, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !533, file: !534, line: 624, baseType: !537, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !533, file: !534, line: 626, baseType: !628, size: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !540, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !533, file: !534, line: 629, baseType: !537, size: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !533, file: !534, line: 634, baseType: !508, size: 32, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !533, file: !534, line: 639, baseType: !635, size: 640, offset: 352)
!635 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !534, line: 636, size: 640, elements: !636)
!636 = !{!637, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !635, file: !534, line: 637, baseType: !638, size: 256)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 256, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 8)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !635, file: !534, line: 638, baseType: !642, size: 640)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 640, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 80)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !533, file: !534, line: 643, baseType: !508, size: 32, offset: 992)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !533, file: !534, line: 651, baseType: !613, size: 64, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !533, file: !534, line: 663, baseType: !648, size: 64, offset: 1088)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !533, file: !534, line: 664, baseType: !508, size: 32, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !533, file: !534, line: 668, baseType: !648, size: 64, offset: 1216)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !533, file: !534, line: 669, baseType: !508, size: 32, offset: 1280)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !533, file: !534, line: 670, baseType: !508, size: 32, offset: 1312)
!653 = !{}
!654 = !DILocalVariable(name: "err", arg: 1, scope: !529, file: !380, line: 207, type: !532)
!655 = !DILocation(line: 207, column: 41, scope: !529)
!656 = !DILocation(line: 209, column: 3, scope: !529)
!657 = !DILocation(line: 209, column: 8, scope: !529)
!658 = !DILocation(line: 209, column: 19, scope: !529)
!659 = !DILocation(line: 210, column: 3, scope: !529)
!660 = !DILocation(line: 210, column: 8, scope: !529)
!661 = !DILocation(line: 210, column: 21, scope: !529)
!662 = !DILocation(line: 211, column: 3, scope: !529)
!663 = !DILocation(line: 211, column: 8, scope: !529)
!664 = !DILocation(line: 211, column: 23, scope: !529)
!665 = !DILocation(line: 212, column: 3, scope: !529)
!666 = !DILocation(line: 212, column: 8, scope: !529)
!667 = !DILocation(line: 212, column: 23, scope: !529)
!668 = !DILocation(line: 213, column: 3, scope: !529)
!669 = !DILocation(line: 213, column: 8, scope: !529)
!670 = !DILocation(line: 213, column: 24, scope: !529)
!671 = !DILocation(line: 215, column: 3, scope: !529)
!672 = !DILocation(line: 215, column: 8, scope: !529)
!673 = !DILocation(line: 215, column: 20, scope: !529)
!674 = !DILocation(line: 216, column: 3, scope: !529)
!675 = !DILocation(line: 216, column: 8, scope: !529)
!676 = !DILocation(line: 216, column: 21, scope: !529)
!677 = !DILocation(line: 217, column: 3, scope: !529)
!678 = !DILocation(line: 217, column: 8, scope: !529)
!679 = !DILocation(line: 217, column: 17, scope: !529)
!680 = !DILocation(line: 220, column: 3, scope: !529)
!681 = !DILocation(line: 220, column: 8, scope: !529)
!682 = !DILocation(line: 220, column: 27, scope: !529)
!683 = !DILocation(line: 221, column: 3, scope: !529)
!684 = !DILocation(line: 221, column: 8, scope: !529)
!685 = !DILocation(line: 221, column: 26, scope: !529)
!686 = !DILocation(line: 223, column: 3, scope: !529)
!687 = !DILocation(line: 223, column: 8, scope: !529)
!688 = !DILocation(line: 223, column: 28, scope: !529)
!689 = !DILocation(line: 224, column: 3, scope: !529)
!690 = !DILocation(line: 224, column: 8, scope: !529)
!691 = !DILocation(line: 224, column: 28, scope: !529)
!692 = !DILocation(line: 225, column: 3, scope: !529)
!693 = !DILocation(line: 225, column: 8, scope: !529)
!694 = !DILocation(line: 225, column: 27, scope: !529)
!695 = !DILocation(line: 227, column: 10, scope: !529)
!696 = !DILocation(line: 227, column: 3, scope: !529)
!697 = distinct !DISubprogram(name: "error_exit", scope: !380, file: !380, line: 61, type: !538, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !379, retainedNodes: !653)
!698 = !DILocalVariable(name: "cinfo", arg: 1, scope: !697, file: !380, line: 61, type: !540)
!699 = !DILocation(line: 61, column: 26, scope: !697)
!700 = !DILocation(line: 64, column: 5, scope: !697)
!701 = !DILocation(line: 64, column: 12, scope: !697)
!702 = !DILocation(line: 64, column: 17, scope: !697)
!703 = !DILocation(line: 64, column: 34, scope: !697)
!704 = !DILocation(line: 64, column: 3, scope: !697)
!705 = !DILocation(line: 67, column: 16, scope: !697)
!706 = !DILocation(line: 67, column: 3, scope: !697)
!707 = !DILocation(line: 69, column: 3, scope: !697)
!708 = distinct !DISubprogram(name: "emit_message", scope: !380, file: !380, line: 104, type: !609, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !379, retainedNodes: !653)
!709 = !DILocalVariable(name: "cinfo", arg: 1, scope: !708, file: !380, line: 104, type: !540)
!710 = !DILocation(line: 104, column: 28, scope: !708)
!711 = !DILocalVariable(name: "msg_level", arg: 2, scope: !708, file: !380, line: 104, type: !508)
!712 = !DILocation(line: 104, column: 39, scope: !708)
!713 = !DILocalVariable(name: "err", scope: !708, file: !380, line: 106, type: !532)
!714 = !DILocation(line: 106, column: 27, scope: !708)
