; ModuleID = 'cBench/consumer_jpeg_c/src/jidctred.c'
source_filename = "cBench/consumer_jpeg_c/src/jidctred.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_decompress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], i32, ptr, i32, i32, [16 x i8], [16 x i8], [16 x i8], i32, i32, i8, i16, i16, i32, i8, i32, i32, i32, i32, i32, ptr, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_component_info = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }

; Function Attrs: noinline nounwind uwtable
define dso_local void @jpeg_idct_4x4(ptr noundef %0, ptr noundef %1, ptr noundef %2, ptr noundef %3, i32 noundef %4) #0 !dbg !46 {
  %6 = alloca ptr, align 8
  %7 = alloca ptr, align 8
  %8 = alloca ptr, align 8
  %9 = alloca ptr, align 8
  %10 = alloca i32, align 4
  %11 = alloca i64, align 8
  %12 = alloca i64, align 8
  %13 = alloca i64, align 8
  %14 = alloca i64, align 8
  %15 = alloca i64, align 8
  %16 = alloca i64, align 8
  %17 = alloca i64, align 8
  %18 = alloca i64, align 8
  %19 = alloca ptr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1, producer: "clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !30, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jidctred.c", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "239dcdd901a7e662b456edae7bc7d272")
!2 = !{!3, !13, !18, !23}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 194, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpeglib.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "2a2b23235fe587b10147d741e3371e67")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "JCS_UNKNOWN", value: 0)
!8 = !DIEnumerator(name: "JCS_GRAYSCALE", value: 1)
!9 = !DIEnumerator(name: "JCS_RGB", value: 2)
!10 = !DIEnumerator(name: "JCS_YCbCr", value: 3)
!11 = !DIEnumerator(name: "JCS_CMYK", value: 4)
!12 = !DIEnumerator(name: "JCS_YCCK", value: 5)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 205, baseType: !5, size: 32, elements: !14)
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "JDCT_ISLOW", value: 0)
!16 = !DIEnumerator(name: "JDCT_IFAST", value: 1)
!17 = !DIEnumerator(name: "JDCT_FLOAT", value: 2)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 220, baseType: !5, size: 32, elements: !19)
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "JDITHER_NONE", value: 0)
!21 = !DIEnumerator(name: "JDITHER_ORDERED", value: 1)
!22 = !DIEnumerator(name: "JDITHER_FS", value: 2)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 16, baseType: !5, size: 32, elements: !25)
!24 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpegint.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "87e9869e13f29b8e74a9dee50528c6c5")
!25 = !{!26, !27, !28, !29}
!26 = !DIEnumerator(name: "JBUF_PASS_THRU", value: 0)
!27 = !DIEnumerator(name: "JBUF_SAVE_SOURCE", value: 1)
!28 = !DIEnumerator(name: "JBUF_CRANK_DEST", value: 2)
!29 = !DIEnumerator(name: "JBUF_SAVE_AND_PASS", value: 3)
!30 = !{!31, !32, !35, !34}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLOW_MULT_TYPE", file: !33, line: 56, baseType: !34)
!33 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jdct.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "18978d93cfb1aabf5618c3caa5dbcf5a")
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !36, line: 161, baseType: !37)
!36 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!37 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!38 = !{i32 7, !"Dwarf Version", i32 5}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = !{i32 8, !"PIC Level", i32 2}
!42 = !{i32 7, !"PIE Level", i32 2}
!43 = !{i32 7, !"uwtable", i32 2}
!44 = !{i32 7, !"frame-pointer", i32 2}
!45 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!46 = distinct !DISubprogram(name: "jpeg_idct_4x4", scope: !1, file: !1, line: 118, type: !47, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !462)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !49, !278, !460, !83, !89}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !4, line: 250, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !4, line: 394, size: 4928, elements: !52)
!52 = !{!53, !177, !178, !179, !180, !181, !207, !208, !209, !210, !212, !213, !214, !215, !217, !218, !219, !221, !222, !223, !224, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !246, !259, !275, !276, !277, !303, !304, !305, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !327, !328, !329, !330, !334, !335, !336, !337, !338, !339, !346, !360, !378, !387, !397, !412, !421, !430, !437, !446}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !51, file: !4, line: 395, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !56)
!56 = !{!57, !145, !146, !147, !153, !154, !155, !166, !167, !168, !173, !174, !175, !176}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !55, file: !4, line: 620, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !61}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !64)
!64 = !{!65, !66, !134, !143, !144}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !63, file: !4, line: 241, baseType: !54, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !63, file: !4, line: 241, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !69)
!69 = !{!70, !78, !79, !90, !104, !112, !119, !120, !124, !128, !132, !133}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !68, file: !4, line: 733, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !61, !34, !75}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 18, baseType: !77)
!76 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!77 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !68, file: !4, line: 735, baseType: !71, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !68, file: !4, line: 737, baseType: !80, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !61, !34, !89, !89}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !36, line: 59, baseType: !88)
!88 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !36, line: 171, baseType: !5)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !68, file: !4, line: 740, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !61, !34, !89, !89}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !99)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 1024, elements: !102)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !36, line: 99, baseType: !101)
!101 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!102 = !{!103}
!103 = !DISubrange(count: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !68, file: !4, line: 743, baseType: !105, size: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !61, !34, !111, !89, !89, !89}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !36, line: 227, baseType: !34)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !68, file: !4, line: 749, baseType: !113, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !61, !34, !111, !89, !89, !89}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !68, file: !4, line: 755, baseType: !58, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !68, file: !4, line: 756, baseType: !121, size: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!83, !61, !108, !89, !89, !111}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !68, file: !4, line: 761, baseType: !125, size: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!94, !61, !116, !89, !89, !111}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !68, file: !4, line: 766, baseType: !129, size: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !61, !34}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !68, file: !4, line: 767, baseType: !58, size: 64, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !68, file: !4, line: 774, baseType: !37, size: 64, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !63, file: !4, line: 241, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !137)
!137 = !{!138, !139, !140, !141, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !136, file: !4, line: 677, baseType: !58, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !136, file: !4, line: 679, baseType: !37, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !136, file: !4, line: 680, baseType: !37, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !136, file: !4, line: 681, baseType: !34, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !136, file: !4, line: 682, baseType: !34, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !63, file: !4, line: 241, baseType: !111, size: 32, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !63, file: !4, line: 241, baseType: !34, size: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !55, file: !4, line: 622, baseType: !129, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !55, file: !4, line: 624, baseType: !58, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !55, file: !4, line: 626, baseType: !148, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !61, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !55, file: !4, line: 629, baseType: !58, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !55, file: !4, line: 634, baseType: !34, size: 32, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !55, file: !4, line: 639, baseType: !156, size: 640, offset: 352)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !55, file: !4, line: 636, size: 640, elements: !157)
!157 = !{!158, !162}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !156, file: !4, line: 637, baseType: !159, size: 256)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 256, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 8)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !156, file: !4, line: 638, baseType: !163, size: 640)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 640, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 80)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !55, file: !4, line: 643, baseType: !34, size: 32, offset: 992)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !55, file: !4, line: 651, baseType: !37, size: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !55, file: !4, line: 663, baseType: !169, size: 64, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !55, file: !4, line: 664, baseType: !34, size: 32, offset: 1152)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !55, file: !4, line: 668, baseType: !169, size: 64, offset: 1216)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !55, file: !4, line: 669, baseType: !34, size: 32, offset: 1280)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !55, file: !4, line: 670, baseType: !34, size: 32, offset: 1312)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !51, file: !4, line: 395, baseType: !67, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !51, file: !4, line: 395, baseType: !135, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !51, file: !4, line: 395, baseType: !111, size: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !51, file: !4, line: 395, baseType: !34, size: 32, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !51, file: !4, line: 398, baseType: !182, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !4, line: 700, size: 448, elements: !184)
!184 = !{!185, !189, !190, !194, !198, !202, !206}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !183, file: !4, line: 701, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !36, line: 110, baseType: !88)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !183, file: !4, line: 702, baseType: !75, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !183, file: !4, line: 704, baseType: !191, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !49}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !183, file: !4, line: 705, baseType: !195, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!111, !49}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !183, file: !4, line: 706, baseType: !199, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !49, !37}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !183, file: !4, line: 707, baseType: !203, size: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!111, !49, !34}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !183, file: !4, line: 708, baseType: !191, size: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !51, file: !4, line: 403, baseType: !89, size: 32, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !51, file: !4, line: 404, baseType: !89, size: 32, offset: 352)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !51, file: !4, line: 405, baseType: !34, size: 32, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !51, file: !4, line: 406, baseType: !211, size: 32, offset: 416)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !51, file: !4, line: 413, baseType: !211, size: 32, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !51, file: !4, line: 415, baseType: !5, size: 32, offset: 480)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !51, file: !4, line: 415, baseType: !5, size: 32, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !51, file: !4, line: 417, baseType: !216, size: 64, offset: 576)
!216 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !51, file: !4, line: 419, baseType: !111, size: 32, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !51, file: !4, line: 420, baseType: !111, size: 32, offset: 672)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !51, file: !4, line: 422, baseType: !220, size: 32, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !51, file: !4, line: 423, baseType: !111, size: 32, offset: 736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !51, file: !4, line: 424, baseType: !111, size: 32, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !51, file: !4, line: 426, baseType: !111, size: 32, offset: 800)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !51, file: !4, line: 428, baseType: !225, size: 32, offset: 832)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !4, line: 224, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !51, file: !4, line: 429, baseType: !111, size: 32, offset: 864)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !51, file: !4, line: 430, baseType: !34, size: 32, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !51, file: !4, line: 432, baseType: !111, size: 32, offset: 928)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !51, file: !4, line: 433, baseType: !111, size: 32, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !51, file: !4, line: 434, baseType: !111, size: 32, offset: 992)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !51, file: !4, line: 442, baseType: !89, size: 32, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !51, file: !4, line: 443, baseType: !89, size: 32, offset: 1056)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !51, file: !4, line: 444, baseType: !34, size: 32, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !51, file: !4, line: 445, baseType: !34, size: 32, offset: 1120)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !51, file: !4, line: 449, baseType: !34, size: 32, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !51, file: !4, line: 461, baseType: !34, size: 32, offset: 1184)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !51, file: !4, line: 462, baseType: !83, size: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !51, file: !4, line: 472, baseType: !89, size: 32, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !51, file: !4, line: 477, baseType: !34, size: 32, offset: 1312)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !51, file: !4, line: 478, baseType: !89, size: 32, offset: 1344)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !51, file: !4, line: 484, baseType: !34, size: 32, offset: 1376)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !51, file: !4, line: 485, baseType: !89, size: 32, offset: 1408)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !51, file: !4, line: 494, baseType: !244, size: 64, offset: 1472)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 2048, elements: !102)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !51, file: !4, line: 505, baseType: !247, size: 256, offset: 1536)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 256, elements: !257)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !251)
!251 = !{!252, !256}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !250, file: !4, line: 88, baseType: !253, size: 1024)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 1024, elements: !102)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !36, line: 147, baseType: !255)
!255 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !250, file: !4, line: 94, baseType: !111, size: 32, offset: 1024)
!257 = !{!258}
!258 = !DISubrange(count: 4)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !51, file: !4, line: 508, baseType: !260, size: 256, offset: 1792)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 256, elements: !257)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !264)
!264 = !{!265, !270, !274}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !263, file: !4, line: 102, baseType: !266, size: 136)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 136, elements: !268)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !36, line: 135, baseType: !88)
!268 = !{!269}
!269 = !DISubrange(count: 17)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !263, file: !4, line: 104, baseType: !271, size: 2048, offset: 136)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 2048, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !263, file: !4, line: 110, baseType: !111, size: 32, offset: 2208)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !51, file: !4, line: 509, baseType: !260, size: 256, offset: 2048)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !51, file: !4, line: 516, baseType: !34, size: 32, offset: 2304)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !51, file: !4, line: 518, baseType: !278, size: 64, offset: 2368)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !280, file: !4, line: 120, baseType: !34, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !280, file: !4, line: 121, baseType: !34, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !280, file: !4, line: 122, baseType: !34, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !280, file: !4, line: 123, baseType: !34, size: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !280, file: !4, line: 124, baseType: !34, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !280, file: !4, line: 129, baseType: !34, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !280, file: !4, line: 130, baseType: !34, size: 32, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !280, file: !4, line: 139, baseType: !89, size: 32, offset: 224)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !280, file: !4, line: 140, baseType: !89, size: 32, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !280, file: !4, line: 147, baseType: !34, size: 32, offset: 288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !280, file: !4, line: 154, baseType: !89, size: 32, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !280, file: !4, line: 155, baseType: !89, size: 32, offset: 352)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !280, file: !4, line: 160, baseType: !111, size: 32, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !280, file: !4, line: 164, baseType: !34, size: 32, offset: 416)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !280, file: !4, line: 165, baseType: !34, size: 32, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !280, file: !4, line: 166, baseType: !34, size: 32, offset: 480)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !280, file: !4, line: 167, baseType: !34, size: 32, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !280, file: !4, line: 168, baseType: !34, size: 32, offset: 544)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !280, file: !4, line: 169, baseType: !34, size: 32, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !280, file: !4, line: 175, baseType: !248, size: 64, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !280, file: !4, line: 178, baseType: !74, size: 64, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !51, file: !4, line: 521, baseType: !111, size: 32, offset: 2432)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !51, file: !4, line: 522, baseType: !111, size: 32, offset: 2464)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !51, file: !4, line: 524, baseType: !306, size: 128, offset: 2496)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 128, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 16)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !51, file: !4, line: 525, baseType: !306, size: 128, offset: 2624)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !51, file: !4, line: 526, baseType: !306, size: 128, offset: 2752)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !51, file: !4, line: 528, baseType: !5, size: 32, offset: 2880)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !51, file: !4, line: 533, baseType: !111, size: 32, offset: 2912)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !51, file: !4, line: 535, baseType: !267, size: 8, offset: 2944)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !51, file: !4, line: 536, baseType: !254, size: 16, offset: 2960)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !51, file: !4, line: 537, baseType: !254, size: 16, offset: 2976)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !51, file: !4, line: 538, baseType: !111, size: 32, offset: 3008)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !51, file: !4, line: 539, baseType: !267, size: 8, offset: 3040)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !51, file: !4, line: 541, baseType: !111, size: 32, offset: 3072)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !51, file: !4, line: 550, baseType: !34, size: 32, offset: 3104)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !51, file: !4, line: 551, baseType: !34, size: 32, offset: 3136)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !51, file: !4, line: 553, baseType: !34, size: 32, offset: 3168)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !51, file: !4, line: 555, baseType: !89, size: 32, offset: 3200)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !51, file: !4, line: 564, baseType: !86, size: 64, offset: 3264)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !51, file: !4, line: 571, baseType: !34, size: 32, offset: 3328)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !51, file: !4, line: 572, baseType: !326, size: 256, offset: 3392)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 256, elements: !257)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !51, file: !4, line: 575, baseType: !89, size: 32, offset: 3648)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !51, file: !4, line: 576, baseType: !89, size: 32, offset: 3680)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !51, file: !4, line: 578, baseType: !34, size: 32, offset: 3712)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !51, file: !4, line: 579, baseType: !331, size: 320, offset: 3744)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 320, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 10)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !51, file: !4, line: 583, baseType: !34, size: 32, offset: 4064)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !51, file: !4, line: 583, baseType: !34, size: 32, offset: 4096)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !51, file: !4, line: 583, baseType: !34, size: 32, offset: 4128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !51, file: !4, line: 583, baseType: !34, size: 32, offset: 4160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !51, file: !4, line: 589, baseType: !34, size: 32, offset: 4192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !51, file: !4, line: 594, baseType: !340, size: 64, offset: 4224)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !24, line: 136, size: 192, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_output_pass", scope: !341, file: !24, line: 137, baseType: !191, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output_pass", scope: !341, file: !24, line: 138, baseType: !191, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "is_dummy_pass", scope: !341, file: !24, line: 141, baseType: !111, size: 32, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !51, file: !4, line: 595, baseType: !347, size: 64, offset: 4288)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !24, line: 157, size: 128, elements: !349)
!349 = !{!350, !355}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !348, file: !24, line: 158, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !49, !354}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !24, line: 22, baseType: !23)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !348, file: !24, line: 159, baseType: !356, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !49, !83, !359, !89}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !51, file: !4, line: 596, baseType: !361, size: 64, offset: 4352)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !24, line: 165, size: 320, elements: !363)
!363 = !{!364, !365, !369, !370, !376}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !362, file: !24, line: 166, baseType: !191, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "consume_data", scope: !362, file: !24, line: 167, baseType: !366, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!34, !49}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "start_output_pass", scope: !362, file: !24, line: 168, baseType: !191, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "decompress_data", scope: !362, file: !24, line: 169, baseType: !371, size: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!34, !49, !374}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !4, line: 68, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "coef_arrays", scope: !362, file: !24, line: 172, baseType: !377, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !51, file: !4, line: 597, baseType: !379, size: 64, offset: 4416)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !24, line: 176, size: 128, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !380, file: !24, line: 177, baseType: !351, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_data", scope: !380, file: !24, line: 178, baseType: !384, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !49, !374, !359, !89, !83, !359, !89}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !51, file: !4, line: 598, baseType: !388, size: 64, offset: 4480)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !24, line: 145, size: 320, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "consume_input", scope: !389, file: !24, line: 146, baseType: !366, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "reset_input_controller", scope: !389, file: !24, line: 147, baseType: !191, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !389, file: !24, line: 148, baseType: !191, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input_pass", scope: !389, file: !24, line: 149, baseType: !191, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "has_multiple_scans", scope: !389, file: !24, line: 152, baseType: !111, size: 32, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "eoi_reached", scope: !389, file: !24, line: 153, baseType: !111, size: 32, offset: 288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !51, file: !4, line: 599, baseType: !398, size: 64, offset: 4544)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !24, line: 188, size: 1408, elements: !400)
!400 = !{!401, !402, !403, !405, !406, !408, !409, !410, !411}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "reset_marker_reader", scope: !399, file: !24, line: 189, baseType: !191, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "read_markers", scope: !399, file: !24, line: 194, baseType: !366, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "read_restart_marker", scope: !399, file: !24, line: 196, baseType: !404, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_marker_parser_method", file: !4, line: 781, baseType: !195)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "process_COM", scope: !399, file: !24, line: 198, baseType: !404, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "process_APPn", scope: !399, file: !24, line: 199, baseType: !407, size: 1024, offset: 256)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 1024, elements: !307)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOI", scope: !399, file: !24, line: 204, baseType: !111, size: 32, offset: 1280)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOF", scope: !399, file: !24, line: 205, baseType: !111, size: 32, offset: 1312)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next_restart_num", scope: !399, file: !24, line: 206, baseType: !34, size: 32, offset: 1344)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "discarded_bytes", scope: !399, file: !24, line: 207, baseType: !5, size: 32, offset: 1376)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !51, file: !4, line: 600, baseType: !413, size: 64, offset: 4608)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !24, line: 211, size: 128, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !414, file: !24, line: 212, baseType: !191, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mcu", scope: !414, file: !24, line: 213, baseType: !418, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!111, !49, !95}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !51, file: !4, line: 601, baseType: !422, size: 64, offset: 4672)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !24, line: 223, size: 704, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !423, file: !24, line: 224, baseType: !191, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_DCT", scope: !423, file: !24, line: 226, baseType: !427, size: 640, offset: 64)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 640, elements: !332)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "inverse_DCT_method_ptr", file: !24, line: 218, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !51, file: !4, line: 602, baseType: !431, size: 64, offset: 4736)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !24, line: 230, size: 192, elements: !433)
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !432, file: !24, line: 231, baseType: !191, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !432, file: !24, line: 232, baseType: !384, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !432, file: !24, line: 240, baseType: !111, size: 32, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !51, file: !4, line: 603, baseType: !438, size: 64, offset: 4800)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !24, line: 244, size: 128, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !439, file: !24, line: 245, baseType: !191, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !439, file: !24, line: 246, baseType: !443, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !49, !374, !89, !83, !34}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !51, file: !4, line: 604, baseType: !447, size: 64, offset: 4864)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !24, line: 252, size: 256, elements: !449)
!449 = !{!450, !454, !458, !459}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !448, file: !24, line: 253, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !49, !111}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "color_quantize", scope: !448, file: !24, line: 254, baseType: !455, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !49, !83, !83, !34}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !448, file: !24, line: 257, baseType: !191, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "new_color_map", scope: !448, file: !24, line: 258, baseType: !191, size: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEFPTR", file: !4, line: 75, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!462 = !{}
!463 = !DILocalVariable(name: "cinfo", arg: 1, scope: !46, file: !1, line: 118, type: !49)
!464 = !DILocation(line: 118, column: 33, scope: !46)
!465 = !DILocalVariable(name: "compptr", arg: 2, scope: !46, file: !1, line: 118, type: !278)
!466 = !DILocation(line: 118, column: 62, scope: !46)
!467 = !DILocalVariable(name: "coef_block", arg: 3, scope: !46, file: !1, line: 119, type: !460)
!468 = !DILocation(line: 119, column: 18, scope: !46)
!469 = !DILocalVariable(name: "output_buf", arg: 4, scope: !46, file: !1, line: 120, type: !83)
!470 = !DILocation(line: 120, column: 20, scope: !46)
!471 = !DILocalVariable(name: "output_col", arg: 5, scope: !46, file: !1, line: 120, type: !89)
!472 = !DILocation(line: 120, column: 43, scope: !46)
!473 = !DILocalVariable(name: "tmp0", scope: !46, file: !1, line: 122, type: !35)
!474 = !DILocation(line: 122, column: 9, scope: !46)
!475 = !DILocalVariable(name: "tmp2", scope: !46, file: !1, line: 122, type: !35)
!476 = !DILocation(line: 122, column: 15, scope: !46)
!477 = !DILocalVariable(name: "tmp10", scope: !46, file: !1, line: 122, type: !35)
!478 = !DILocation(line: 122, column: 21, scope: !46)
!479 = !DILocalVariable(name: "tmp12", scope: !46, file: !1, line: 122, type: !35)
!480 = !DILocation(line: 122, column: 28, scope: !46)
!481 = !DILocalVariable(name: "z1", scope: !46, file: !1, line: 123, type: !35)
!482 = !DILocation(line: 123, column: 9, scope: !46)
!483 = !DILocalVariable(name: "z2", scope: !46, file: !1, line: 123, type: !35)
!484 = !DILocation(line: 123, column: 13, scope: !46)
!485 = !DILocalVariable(name: "z3", scope: !46, file: !1, line: 123, type: !35)
!486 = !DILocation(line: 123, column: 17, scope: !46)
!487 = !DILocalVariable(name: "z4", scope: !46, file: !1, line: 123, type: !35)
!488 = !DILocation(line: 123, column: 21, scope: !46)
!489 = !DILocalVariable(name: "inptr", scope: !46, file: !1, line: 124, type: !460)
!490 = !DILocation(line: 124, column: 12, scope: !46)
!491 = !DILocalVariable(name: "quantptr", scope: !46, file: !1, line: 125, type: !31)
!492 = !DILocation(line: 125, column: 21, scope: !46)
!493 = !DILocalVariable(name: "wsptr", scope: !46, file: !1, line: 126, type: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!495 = !DILocation(line: 126, column: 9, scope: !46)
!496 = !DILocalVariable(name: "outptr", scope: !46, file: !1, line: 127, type: !85)
!497 = !DILocation(line: 127, column: 12, scope: !46)
!498 = !DILocalVariable(name: "range_limit", scope: !46, file: !1, line: 128, type: !86)
!499 = !DILocation(line: 128, column: 12, scope: !46)
!500 = !DILocation(line: 128, column: 26, scope: !46)
!501 = !DILocalVariable(name: "ctr", scope: !46, file: !1, line: 129, type: !34)
!502 = !DILocation(line: 129, column: 7, scope: !46)
!503 = !DILocalVariable(name: "workspace", scope: !46, file: !1, line: 130, type: !504)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1024, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 32)
!507 = !DILocation(line: 130, column: 7, scope: !46)
!508 = !DILocation(line: 135, column: 11, scope: !46)
!509 = !DILocation(line: 135, column: 9, scope: !46)
!510 = !DILocation(line: 136, column: 34, scope: !46)
!511 = !DILocation(line: 136, column: 43, scope: !46)
!512 = !DILocation(line: 136, column: 12, scope: !46)
!513 = !DILocation(line: 137, column: 11, scope: !46)
!514 = !DILocation(line: 137, column: 9, scope: !46)
!515 = !DILocation(line: 138, column: 12, scope: !516)
!516 = distinct !DILexicalBlock(scope: !46, file: !1, line: 138, column: 3)
!517 = !DILocation(line: 138, column: 8, scope: !516)
!518 = !DILocation(line: 138, column: 23, scope: !519)
