; ModuleID = 'cBench/consumer_jpeg_c/src/jidctfst.c'
source_filename = "cBench/consumer_jpeg_c/src/jidctfst.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_decompress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], i32, ptr, i32, i32, [16 x i8], [16 x i8], [16 x i8], i32, i32, i8, i16, i16, i32, i8, i32, i32, i32, i32, i32, ptr, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_component_info = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }

; Function Attrs: noinline nounwind uwtable
define dso_local void @jpeg_idct_ifast(ptr noundef %0, ptr noundef %1, ptr noundef %2, ptr noundef %3, i32 noundef %4) #0 !dbg !47 {
  %6 = alloca ptr, align 8
  %7 = alloca ptr, align 8
  %8 = alloca ptr, align 8
  %9 = alloca ptr, align 8
  %10 = alloca i32, align 4
  %11 = alloca i32, align 4
  %12 = alloca i32, align 4
  %13 = alloca i32, align 4
  %14 = alloca i32, align 4
  %15 = alloca i32, align 4
  %16 = alloca i32, align 4
  %17 = alloca i32, align 4
  %18 = alloca i32, align 4
  %19 = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1, producer: "clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !30, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jidctfst.c", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "66032cdf37bce13681cc5aa3ab884d71")
!2 = !{!3, !13, !18, !23}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 194, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpeglib.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "2a2b23235fe587b10147d741e3371e67")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "JCS_UNKNOWN", value: 0)
!8 = !DIEnumerator(name: "JCS_GRAYSCALE", value: 1)
!9 = !DIEnumerator(name: "JCS_RGB", value: 2)
!10 = !DIEnumerator(name: "JCS_YCbCr", value: 3)
!11 = !DIEnumerator(name: "JCS_CMYK", value: 4)
!12 = !DIEnumerator(name: "JCS_YCCK", value: 5)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 205, baseType: !5, size: 32, elements: !14)
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "JDCT_ISLOW", value: 0)
!16 = !DIEnumerator(name: "JDCT_IFAST", value: 1)
!17 = !DIEnumerator(name: "JDCT_FLOAT", value: 2)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 220, baseType: !5, size: 32, elements: !19)
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "JDITHER_NONE", value: 0)
!21 = !DIEnumerator(name: "JDITHER_ORDERED", value: 1)
!22 = !DIEnumerator(name: "JDITHER_FS", value: 2)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 16, baseType: !5, size: 32, elements: !25)
!24 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpegint.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "87e9869e13f29b8e74a9dee50528c6c5")
!25 = !{!26, !27, !28, !29}
!26 = !DIEnumerator(name: "JBUF_PASS_THRU", value: 0)
!27 = !DIEnumerator(name: "JBUF_SAVE_SOURCE", value: 1)
!28 = !DIEnumerator(name: "JBUF_CRANK_DEST", value: 2)
!29 = !DIEnumerator(name: "JBUF_SAVE_AND_PASS", value: 3)
!30 = !{!31, !34, !32, !35, !36}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "IFAST_MULT_TYPE", file: !33, line: 58, baseType: !34)
!33 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jdct.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "18978d93cfb1aabf5618c3caa5dbcf5a")
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCTELEM", file: !33, line: 30, baseType: !34)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !37, line: 161, baseType: !38)
!37 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!38 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!39 = !{i32 7, !"Dwarf Version", i32 5}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{i32 1, !"wchar_size", i32 4}
!42 = !{i32 8, !"PIC Level", i32 2}
!43 = !{i32 7, !"PIE Level", i32 2}
!44 = !{i32 7, !"uwtable", i32 2}
!45 = !{i32 7, !"frame-pointer", i32 2}
!46 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!47 = distinct !DISubprogram(name: "jpeg_idct_ifast", scope: !1, file: !1, line: 168, type: !48, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !463)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50, !279, !461, !84, !90}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !4, line: 250, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !4, line: 394, size: 4928, elements: !53)
!53 = !{!54, !178, !179, !180, !181, !182, !208, !209, !210, !211, !213, !214, !215, !216, !218, !219, !220, !222, !223, !224, !225, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !247, !260, !276, !277, !278, !304, !305, !306, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !328, !329, !330, !331, !335, !336, !337, !338, !339, !340, !347, !361, !379, !388, !398, !413, !422, !431, !438, !447}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !52, file: !4, line: 395, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !57)
!57 = !{!58, !146, !147, !148, !154, !155, !156, !167, !168, !169, !174, !175, !176, !177}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !56, file: !4, line: 620, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !65)
!65 = !{!66, !67, !135, !144, !145}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !64, file: !4, line: 241, baseType: !55, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !64, file: !4, line: 241, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !70)
!70 = !{!71, !79, !80, !91, !105, !113, !120, !121, !125, !129, !133, !134}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !69, file: !4, line: 733, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !62, !34, !76}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 18, baseType: !78)
!77 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!78 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !69, file: !4, line: 735, baseType: !72, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !69, file: !4, line: 737, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !62, !34, !90, !90}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !37, line: 59, baseType: !89)
!89 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !37, line: 171, baseType: !5)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !69, file: !4, line: 740, baseType: !92, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !62, !34, !90, !90}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !100)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 1024, elements: !103)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !37, line: 99, baseType: !102)
!102 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!103 = !{!104}
!104 = !DISubrange(count: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !69, file: !4, line: 743, baseType: !106, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!109, !62, !34, !112, !90, !90, !90}
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !37, line: 227, baseType: !34)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !69, file: !4, line: 749, baseType: !114, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!117, !62, !34, !112, !90, !90, !90}
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !69, file: !4, line: 755, baseType: !59, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !69, file: !4, line: 756, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!84, !62, !109, !90, !90, !112}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !69, file: !4, line: 761, baseType: !126, size: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!95, !62, !117, !90, !90, !112}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !69, file: !4, line: 766, baseType: !130, size: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !62, !34}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !69, file: !4, line: 767, baseType: !59, size: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !69, file: !4, line: 774, baseType: !38, size: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !64, file: !4, line: 241, baseType: !136, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !138)
!138 = !{!139, !140, !141, !142, !143}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !137, file: !4, line: 677, baseType: !59, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !137, file: !4, line: 679, baseType: !38, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !137, file: !4, line: 680, baseType: !38, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !137, file: !4, line: 681, baseType: !34, size: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !137, file: !4, line: 682, baseType: !34, size: 32, offset: 224)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !64, file: !4, line: 241, baseType: !112, size: 32, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !64, file: !4, line: 241, baseType: !34, size: 32, offset: 224)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !56, file: !4, line: 622, baseType: !130, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !56, file: !4, line: 624, baseType: !59, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !56, file: !4, line: 626, baseType: !149, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !62, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !56, file: !4, line: 629, baseType: !59, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !56, file: !4, line: 634, baseType: !34, size: 32, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !56, file: !4, line: 639, baseType: !157, size: 640, offset: 352)
!157 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !56, file: !4, line: 636, size: 640, elements: !158)
!158 = !{!159, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !157, file: !4, line: 637, baseType: !160, size: 256)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 256, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !157, file: !4, line: 638, baseType: !164, size: 640)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 640, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 80)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !56, file: !4, line: 643, baseType: !34, size: 32, offset: 992)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !56, file: !4, line: 651, baseType: !38, size: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !56, file: !4, line: 663, baseType: !170, size: 64, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !56, file: !4, line: 664, baseType: !34, size: 32, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !56, file: !4, line: 668, baseType: !170, size: 64, offset: 1216)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !56, file: !4, line: 669, baseType: !34, size: 32, offset: 1280)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !56, file: !4, line: 670, baseType: !34, size: 32, offset: 1312)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !52, file: !4, line: 395, baseType: !68, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !52, file: !4, line: 395, baseType: !136, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !52, file: !4, line: 395, baseType: !112, size: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !52, file: !4, line: 395, baseType: !34, size: 32, offset: 224)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !52, file: !4, line: 398, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !4, line: 700, size: 448, elements: !185)
!185 = !{!186, !190, !191, !195, !199, !203, !207}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !184, file: !4, line: 701, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !37, line: 110, baseType: !89)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !184, file: !4, line: 702, baseType: !76, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !184, file: !4, line: 704, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !50}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !184, file: !4, line: 705, baseType: !196, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!112, !50}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !184, file: !4, line: 706, baseType: !200, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !50, !38}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !184, file: !4, line: 707, baseType: !204, size: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!112, !50, !34}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !184, file: !4, line: 708, baseType: !192, size: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !52, file: !4, line: 403, baseType: !90, size: 32, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !52, file: !4, line: 404, baseType: !90, size: 32, offset: 352)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !52, file: !4, line: 405, baseType: !34, size: 32, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !52, file: !4, line: 406, baseType: !212, size: 32, offset: 416)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !52, file: !4, line: 413, baseType: !212, size: 32, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !52, file: !4, line: 415, baseType: !5, size: 32, offset: 480)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !52, file: !4, line: 415, baseType: !5, size: 32, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !52, file: !4, line: 417, baseType: !217, size: 64, offset: 576)
!217 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !52, file: !4, line: 419, baseType: !112, size: 32, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !52, file: !4, line: 420, baseType: !112, size: 32, offset: 672)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !52, file: !4, line: 422, baseType: !221, size: 32, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !52, file: !4, line: 423, baseType: !112, size: 32, offset: 736)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !52, file: !4, line: 424, baseType: !112, size: 32, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !52, file: !4, line: 426, baseType: !112, size: 32, offset: 800)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !52, file: !4, line: 428, baseType: !226, size: 32, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !4, line: 224, baseType: !18)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !52, file: !4, line: 429, baseType: !112, size: 32, offset: 864)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !52, file: !4, line: 430, baseType: !34, size: 32, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !52, file: !4, line: 432, baseType: !112, size: 32, offset: 928)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !52, file: !4, line: 433, baseType: !112, size: 32, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !52, file: !4, line: 434, baseType: !112, size: 32, offset: 992)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !52, file: !4, line: 442, baseType: !90, size: 32, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !52, file: !4, line: 443, baseType: !90, size: 32, offset: 1056)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !52, file: !4, line: 444, baseType: !34, size: 32, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !52, file: !4, line: 445, baseType: !34, size: 32, offset: 1120)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !52, file: !4, line: 449, baseType: !34, size: 32, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !52, file: !4, line: 461, baseType: !34, size: 32, offset: 1184)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !52, file: !4, line: 462, baseType: !84, size: 64, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !52, file: !4, line: 472, baseType: !90, size: 32, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !52, file: !4, line: 477, baseType: !34, size: 32, offset: 1312)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !52, file: !4, line: 478, baseType: !90, size: 32, offset: 1344)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !52, file: !4, line: 484, baseType: !34, size: 32, offset: 1376)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !52, file: !4, line: 485, baseType: !90, size: 32, offset: 1408)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !52, file: !4, line: 494, baseType: !245, size: 64, offset: 1472)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 2048, elements: !103)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !52, file: !4, line: 505, baseType: !248, size: 256, offset: 1536)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 256, elements: !258)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !252)
!252 = !{!253, !257}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !251, file: !4, line: 88, baseType: !254, size: 1024)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 1024, elements: !103)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !37, line: 147, baseType: !256)
!256 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !251, file: !4, line: 94, baseType: !112, size: 32, offset: 1024)
!258 = !{!259}
!259 = !DISubrange(count: 4)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !52, file: !4, line: 508, baseType: !261, size: 256, offset: 1792)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 256, elements: !258)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !265)
!265 = !{!266, !271, !275}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !264, file: !4, line: 102, baseType: !267, size: 136)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 136, elements: !269)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !37, line: 135, baseType: !89)
!269 = !{!270}
!270 = !DISubrange(count: 17)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !264, file: !4, line: 104, baseType: !272, size: 2048, offset: 136)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 2048, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !264, file: !4, line: 110, baseType: !112, size: 32, offset: 2208)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !52, file: !4, line: 509, baseType: !261, size: 256, offset: 2048)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !52, file: !4, line: 516, baseType: !34, size: 32, offset: 2304)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !52, file: !4, line: 518, baseType: !279, size: 64, offset: 2368)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !281, file: !4, line: 120, baseType: !34, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !281, file: !4, line: 121, baseType: !34, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !281, file: !4, line: 122, baseType: !34, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !281, file: !4, line: 123, baseType: !34, size: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !281, file: !4, line: 124, baseType: !34, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !281, file: !4, line: 129, baseType: !34, size: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !281, file: !4, line: 130, baseType: !34, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !281, file: !4, line: 139, baseType: !90, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !281, file: !4, line: 140, baseType: !90, size: 32, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !281, file: !4, line: 147, baseType: !34, size: 32, offset: 288)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !281, file: !4, line: 154, baseType: !90, size: 32, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !281, file: !4, line: 155, baseType: !90, size: 32, offset: 352)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !281, file: !4, line: 160, baseType: !112, size: 32, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !281, file: !4, line: 164, baseType: !34, size: 32, offset: 416)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !281, file: !4, line: 165, baseType: !34, size: 32, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !281, file: !4, line: 166, baseType: !34, size: 32, offset: 480)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !281, file: !4, line: 167, baseType: !34, size: 32, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !281, file: !4, line: 168, baseType: !34, size: 32, offset: 544)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !281, file: !4, line: 169, baseType: !34, size: 32, offset: 576)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !281, file: !4, line: 175, baseType: !249, size: 64, offset: 640)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !281, file: !4, line: 178, baseType: !75, size: 64, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !52, file: !4, line: 521, baseType: !112, size: 32, offset: 2432)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !52, file: !4, line: 522, baseType: !112, size: 32, offset: 2464)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !52, file: !4, line: 524, baseType: !307, size: 128, offset: 2496)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 128, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 16)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !52, file: !4, line: 525, baseType: !307, size: 128, offset: 2624)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !52, file: !4, line: 526, baseType: !307, size: 128, offset: 2752)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !52, file: !4, line: 528, baseType: !5, size: 32, offset: 2880)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !52, file: !4, line: 533, baseType: !112, size: 32, offset: 2912)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !52, file: !4, line: 535, baseType: !268, size: 8, offset: 2944)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !52, file: !4, line: 536, baseType: !255, size: 16, offset: 2960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !52, file: !4, line: 537, baseType: !255, size: 16, offset: 2976)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !52, file: !4, line: 538, baseType: !112, size: 32, offset: 3008)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !52, file: !4, line: 539, baseType: !268, size: 8, offset: 3040)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !52, file: !4, line: 541, baseType: !112, size: 32, offset: 3072)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !52, file: !4, line: 550, baseType: !34, size: 32, offset: 3104)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !52, file: !4, line: 551, baseType: !34, size: 32, offset: 3136)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !52, file: !4, line: 553, baseType: !34, size: 32, offset: 3168)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !52, file: !4, line: 555, baseType: !90, size: 32, offset: 3200)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !52, file: !4, line: 564, baseType: !87, size: 64, offset: 3264)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !52, file: !4, line: 571, baseType: !34, size: 32, offset: 3328)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !52, file: !4, line: 572, baseType: !327, size: 256, offset: 3392)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 256, elements: !258)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !52, file: !4, line: 575, baseType: !90, size: 32, offset: 3648)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !52, file: !4, line: 576, baseType: !90, size: 32, offset: 3680)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !52, file: !4, line: 578, baseType: !34, size: 32, offset: 3712)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !52, file: !4, line: 579, baseType: !332, size: 320, offset: 3744)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 320, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 10)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !52, file: !4, line: 583, baseType: !34, size: 32, offset: 4064)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !52, file: !4, line: 583, baseType: !34, size: 32, offset: 4096)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !52, file: !4, line: 583, baseType: !34, size: 32, offset: 4128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !52, file: !4, line: 583, baseType: !34, size: 32, offset: 4160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !52, file: !4, line: 589, baseType: !34, size: 32, offset: 4192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !52, file: !4, line: 594, baseType: !341, size: 64, offset: 4224)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !24, line: 136, size: 192, elements: !343)
!343 = !{!344, !345, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_output_pass", scope: !342, file: !24, line: 137, baseType: !192, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output_pass", scope: !342, file: !24, line: 138, baseType: !192, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "is_dummy_pass", scope: !342, file: !24, line: 141, baseType: !112, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !52, file: !4, line: 595, baseType: !348, size: 64, offset: 4288)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !24, line: 157, size: 128, elements: !350)
!350 = !{!351, !356}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !349, file: !24, line: 158, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !50, !355}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !24, line: 22, baseType: !23)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !349, file: !24, line: 159, baseType: !357, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !50, !84, !360, !90}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !52, file: !4, line: 596, baseType: !362, size: 64, offset: 4352)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !24, line: 165, size: 320, elements: !364)
!364 = !{!365, !366, !370, !371, !377}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !363, file: !24, line: 166, baseType: !192, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "consume_data", scope: !363, file: !24, line: 167, baseType: !367, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!34, !50}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "start_output_pass", scope: !363, file: !24, line: 168, baseType: !192, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "decompress_data", scope: !363, file: !24, line: 169, baseType: !372, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!34, !50, !375}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !4, line: 68, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "coef_arrays", scope: !363, file: !24, line: 172, baseType: !378, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !52, file: !4, line: 597, baseType: !380, size: 64, offset: 4416)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !24, line: 176, size: 128, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !381, file: !24, line: 177, baseType: !352, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_data", scope: !381, file: !24, line: 178, baseType: !385, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !50, !375, !360, !90, !84, !360, !90}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !52, file: !4, line: 598, baseType: !389, size: 64, offset: 4480)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !24, line: 145, size: 320, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "consume_input", scope: !390, file: !24, line: 146, baseType: !367, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reset_input_controller", scope: !390, file: !24, line: 147, baseType: !192, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !390, file: !24, line: 148, baseType: !192, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input_pass", scope: !390, file: !24, line: 149, baseType: !192, size: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "has_multiple_scans", scope: !390, file: !24, line: 152, baseType: !112, size: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "eoi_reached", scope: !390, file: !24, line: 153, baseType: !112, size: 32, offset: 288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !52, file: !4, line: 599, baseType: !399, size: 64, offset: 4544)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !24, line: 188, size: 1408, elements: !401)
!401 = !{!402, !403, !404, !406, !407, !409, !410, !411, !412}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "reset_marker_reader", scope: !400, file: !24, line: 189, baseType: !192, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "read_markers", scope: !400, file: !24, line: 194, baseType: !367, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "read_restart_marker", scope: !400, file: !24, line: 196, baseType: !405, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_marker_parser_method", file: !4, line: 781, baseType: !196)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "process_COM", scope: !400, file: !24, line: 198, baseType: !405, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "process_APPn", scope: !400, file: !24, line: 199, baseType: !408, size: 1024, offset: 256)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 1024, elements: !308)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOI", scope: !400, file: !24, line: 204, baseType: !112, size: 32, offset: 1280)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOF", scope: !400, file: !24, line: 205, baseType: !112, size: 32, offset: 1312)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "next_restart_num", scope: !400, file: !24, line: 206, baseType: !34, size: 32, offset: 1344)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "discarded_bytes", scope: !400, file: !24, line: 207, baseType: !5, size: 32, offset: 1376)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !52, file: !4, line: 600, baseType: !414, size: 64, offset: 4608)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !24, line: 211, size: 128, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !415, file: !24, line: 212, baseType: !192, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mcu", scope: !415, file: !24, line: 213, baseType: !419, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!112, !50, !96}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !52, file: !4, line: 601, baseType: !423, size: 64, offset: 4672)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !24, line: 223, size: 704, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !424, file: !24, line: 224, baseType: !192, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_DCT", scope: !424, file: !24, line: 226, baseType: !428, size: 640, offset: 64)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 640, elements: !333)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "inverse_DCT_method_ptr", file: !24, line: 218, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !52, file: !4, line: 602, baseType: !432, size: 64, offset: 4736)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !24, line: 230, size: 192, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !433, file: !24, line: 231, baseType: !192, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !433, file: !24, line: 232, baseType: !385, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !433, file: !24, line: 240, baseType: !112, size: 32, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !52, file: !4, line: 603, baseType: !439, size: 64, offset: 4800)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !24, line: 244, size: 128, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !440, file: !24, line: 245, baseType: !192, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !440, file: !24, line: 246, baseType: !444, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !50, !375, !90, !84, !34}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !52, file: !4, line: 604, baseType: !448, size: 64, offset: 4864)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !24, line: 252, size: 256, elements: !450)
!450 = !{!451, !455, !459, !460}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !449, file: !24, line: 253, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !50, !112}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "color_quantize", scope: !449, file: !24, line: 254, baseType: !456, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !50, !84, !84, !34}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !449, file: !24, line: 257, baseType: !192, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "new_color_map", scope: !449, file: !24, line: 258, baseType: !192, size: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEFPTR", file: !4, line: 75, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!463 = !{}
!464 = !DILocalVariable(name: "cinfo", arg: 1, scope: !47, file: !1, line: 168, type: !50)
!465 = !DILocation(line: 168, column: 35, scope: !47)
!466 = !DILocalVariable(name: "compptr", arg: 2, scope: !47, file: !1, line: 168, type: !279)
!467 = !DILocation(line: 168, column: 64, scope: !47)
!468 = !DILocalVariable(name: "coef_block", arg: 3, scope: !47, file: !1, line: 169, type: !461)
!469 = !DILocation(line: 169, column: 13, scope: !47)
!470 = !DILocalVariable(name: "output_buf", arg: 4, scope: !47, file: !1, line: 170, type: !84)
!471 = !DILocation(line: 170, column: 15, scope: !47)
!472 = !DILocalVariable(name: "output_col", arg: 5, scope: !47, file: !1, line: 170, type: !90)
!473 = !DILocation(line: 170, column: 38, scope: !47)
!474 = !DILocalVariable(name: "tmp0", scope: !47, file: !1, line: 172, type: !35)
!475 = !DILocation(line: 172, column: 11, scope: !47)
!476 = !DILocalVariable(name: "tmp1", scope: !47, file: !1, line: 172, type: !35)
!477 = !DILocation(line: 172, column: 17, scope: !47)
!478 = !DILocalVariable(name: "tmp2", scope: !47, file: !1, line: 172, type: !35)
!479 = !DILocation(line: 172, column: 23, scope: !47)
!480 = !DILocalVariable(name: "tmp3", scope: !47, file: !1, line: 172, type: !35)
!481 = !DILocation(line: 172, column: 29, scope: !47)
!482 = !DILocalVariable(name: "tmp4", scope: !47, file: !1, line: 172, type: !35)
!483 = !DILocation(line: 172, column: 35, scope: !47)
!484 = !DILocalVariable(name: "tmp5", scope: !47, file: !1, line: 172, type: !35)
!485 = !DILocation(line: 172, column: 41, scope: !47)
!486 = !DILocalVariable(name: "tmp6", scope: !47, file: !1, line: 172, type: !35)
!487 = !DILocation(line: 172, column: 47, scope: !47)
!488 = !DILocalVariable(name: "tmp7", scope: !47, file: !1, line: 172, type: !35)
!489 = !DILocation(line: 172, column: 53, scope: !47)
!490 = !DILocalVariable(name: "tmp10", scope: !47, file: !1, line: 173, type: !35)
!491 = !DILocation(line: 173, column: 11, scope: !47)
!492 = !DILocalVariable(name: "tmp11", scope: !47, file: !1, line: 173, type: !35)
!493 = !DILocation(line: 173, column: 18, scope: !47)
!494 = !DILocalVariable(name: "tmp12", scope: !47, file: !1, line: 173, type: !35)
!495 = !DILocation(line: 173, column: 25, scope: !47)
!496 = !DILocalVariable(name: "tmp13", scope: !47, file: !1, line: 173, type: !35)
!497 = !DILocation(line: 173, column: 32, scope: !47)
!498 = !DILocalVariable(name: "z5", scope: !47, file: !1, line: 174, type: !35)
!499 = !DILocation(line: 174, column: 11, scope: !47)
!500 = !DILocalVariable(name: "z10", scope: !47, file: !1, line: 174, type: !35)
!501 = !DILocation(line: 174, column: 15, scope: !47)
!502 = !DILocalVariable(name: "z11", scope: !47, file: !1, line: 174, type: !35)
!503 = !DILocation(line: 174, column: 20, scope: !47)
!504 = !DILocalVariable(name: "z12", scope: !47, file: !1, line: 174, type: !35)
!505 = !DILocation(line: 174, column: 25, scope: !47)
!506 = !DILocalVariable(name: "z13", scope: !47, file: !1, line: 174, type: !35)
!507 = !DILocation(line: 174, column: 30, scope: !47)
!508 = !DILocalVariable(name: "inptr", scope: !47, file: !1, line: 175, type: !461)
!509 = !DILocation(line: 175, column: 12, scope: !47)
!510 = !DILocalVariable(name: "quantptr", scope: !47, file: !1, line: 176, type: !31)
!511 = !DILocation(line: 176, column: 21, scope: !47)
!512 = !DILocalVariable(name: "wsptr", scope: !47, file: !1, line: 177, type: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!514 = !DILocation(line: 177, column: 9, scope: !47)
!515 = !DILocalVariable(name: "outptr", scope: !47, file: !1, line: 178, type: !86)
!516 = !DILocation(line: 178, column: 12, scope: !47)
