; ModuleID = 'cBench/consumer_jpeg_c/src/jmemmgr.c'
source_filename = "cBench/consumer_jpeg_c/src/jmemmgr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_common_struct = type { ptr, ptr, ptr, i32, i32 }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.my_memory_mgr = type { %struct.jpeg_memory_mgr, [2 x ptr], [2 x ptr], ptr, ptr, i64, i32 }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.anon = type { ptr, i64, i64 }
%union.small_pool_struct = type { %struct.anon }
%struct.anon.0 = type { ptr, i64, i64 }
%union.large_pool_struct = type { %struct.anon.0 }
%struct.jvirt_sarray_control = type { ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, %struct.backing_store_struct }
%struct.backing_store_struct = type { ptr, ptr, ptr, ptr, [64 x i8] }
%struct.jvirt_barray_control = type { ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, %struct.backing_store_struct }

@.str = private unnamed_addr constant [8 x i8] c"JPEGMEM\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [6 x i8] c"%ld%c\00", align 1, !dbg !7
@first_pool_slop = internal constant [2 x i64] [i64 1600, i64 16000], align 16, !dbg !12

!66 = !DIEnumerator(name: "JERR_NOTIMPL", value: 46)
!67 = !DIEnumerator(name: "JERR_NOT_COMPILED", value: 47)
!68 = !DIEnumerator(name: "JERR_NO_BACKING_STORE", value: 48)
!69 = !DIEnumerator(name: "JERR_NO_HUFF_TABLE", value: 49)
!70 = !DIEnumerator(name: "JERR_NO_IMAGE", value: 50)
!71 = !DIEnumerator(name: "JERR_NO_QUANT_TABLE", value: 51)
!72 = !DIEnumerator(name: "JERR_NO_SOI", value: 52)
!73 = !DIEnumerator(name: "JERR_OUT_OF_MEMORY", value: 53)
!74 = !DIEnumerator(name: "JERR_QUANT_COMPONENTS", value: 54)
!75 = !DIEnumerator(name: "JERR_QUANT_FEW_COLORS", value: 55)
!76 = !DIEnumerator(name: "JERR_QUANT_MANY_COLORS", value: 56)
!77 = !DIEnumerator(name: "JERR_SOF_DUPLICATE", value: 57)
!78 = !DIEnumerator(name: "JERR_SOF_NO_SOS", value: 58)
!79 = !DIEnumerator(name: "JERR_SOF_UNSUPPORTED", value: 59)
!80 = !DIEnumerator(name: "JERR_SOI_DUPLICATE", value: 60)
!81 = !DIEnumerator(name: "JERR_SOS_NO_SOF", value: 61)
!82 = !DIEnumerator(name: "JERR_TFILE_CREATE", value: 62)
!83 = !DIEnumerator(name: "JERR_TFILE_READ", value: 63)
!84 = !DIEnumerator(name: "JERR_TFILE_SEEK", value: 64)
!85 = !DIEnumerator(name: "JERR_TFILE_WRITE", value: 65)
!86 = !DIEnumerator(name: "JERR_TOO_LITTLE_DATA", value: 66)
!87 = !DIEnumerator(name: "JERR_UNKNOWN_MARKER", value: 67)
!88 = !DIEnumerator(name: "JERR_VIRTUAL_BUG", value: 68)
!89 = !DIEnumerator(name: "JERR_WIDTH_OVERFLOW", value: 69)
!90 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!91 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!92 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!93 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!94 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!95 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!96 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!97 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!98 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!99 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!100 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!101 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!102 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!103 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!104 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!105 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!106 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!107 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!108 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!109 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!110 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!111 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!112 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!113 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!114 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!115 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!116 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!117 = !DIEnumerator(name: "JTRC_RST", value: 97)
!118 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!119 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!120 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!121 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!122 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!123 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!124 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!125 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!126 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!127 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!128 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!129 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!130 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!131 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!132 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!133 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!134 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!135 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!136 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!137 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!138 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!139 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!140 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!141 = !{!142, !145, !146, !367, !200, !375, !169, !391, !213, !206, !208, !218, !220, !232, !327}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !143, line: 18, baseType: !144)
!143 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!144 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!145 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !147, line: 248, baseType: !148)
!147 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpeglib.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "2a2b23235fe587b10147d741e3371e67")
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !147, line: 240, size: 256, elements: !150)
!150 = !{!151, !192, !356, !365, !366}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !149, file: !147, line: 241, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !147, line: 618, size: 1344, elements: !154)
!154 = !{!155, !159, !164, !165, !170, !171, !172, !181, !182, !183, !188, !189, !190, !191}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !153, file: !147, line: 620, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !146}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !153, file: !147, line: 622, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !146, !163}
!163 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !153, file: !147, line: 624, baseType: !156, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !153, file: !147, line: 626, baseType: !166, size: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !146, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !153, file: !147, line: 629, baseType: !156, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !153, file: !147, line: 634, baseType: !163, size: 32, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !153, file: !147, line: 639, baseType: !173, size: 640, offset: 352)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !153, file: !147, line: 636, size: 640, elements: !174)
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !173, file: !147, line: 637, baseType: !176, size: 256)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 256, elements: !5)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !173, file: !147, line: 638, baseType: !178, size: 640)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 640, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 80)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !153, file: !147, line: 643, baseType: !163, size: 32, offset: 992)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !153, file: !147, line: 651, baseType: !145, size: 64, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !153, file: !147, line: 663, baseType: !184, size: 64, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !153, file: !147, line: 664, baseType: !163, size: 32, offset: 1152)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !153, file: !147, line: 668, baseType: !184, size: 64, offset: 1216)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !153, file: !147, line: 669, baseType: !163, size: 32, offset: 1280)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !153, file: !147, line: 670, baseType: !163, size: 32, offset: 1312)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !149, file: !147, line: 241, baseType: !193, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !147, line: 731, size: 768, elements: !195)
!195 = !{!196, !201, !202, !214, !228, !323, !344, !345, !349, !353, !354, !355}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !194, file: !147, line: 733, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!200, !146, !163, !142}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !194, file: !147, line: 735, baseType: !197, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !194, file: !147, line: 737, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !146, !163, !213, !213}
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !147, line: 67, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !147, line: 66, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !211, line: 59, baseType: !212)
!211 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!212 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !211, line: 171, baseType: !18)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !194, file: !147, line: 740, baseType: !215, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !146, !163, !213, !213}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !147, line: 72, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !147, line: 71, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !147, line: 70, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 1024, elements: !226)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !211, line: 99, baseType: !225)
!225 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!226 = !{!227}
!227 = !DISubrange(count: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !194, file: !147, line: 743, baseType: !229, size: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !146, !163, !245, !213, !213, !213}
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !147, line: 727, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !2, line: 150, size: 1216, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !246, !247, !248, !249}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mem_buffer", scope: !234, file: !2, line: 151, baseType: !206, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "rows_in_array", scope: !234, file: !2, line: 152, baseType: !213, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "samplesperrow", scope: !234, file: !2, line: 153, baseType: !213, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "maxaccess", scope: !234, file: !2, line: 154, baseType: !213, size: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "rows_in_mem", scope: !234, file: !2, line: 155, baseType: !213, size: 32, offset: 160)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "rowsperchunk", scope: !234, file: !2, line: 156, baseType: !213, size: 32, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cur_start_row", scope: !234, file: !2, line: 157, baseType: !213, size: 32, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "first_undef_row", scope: !234, file: !2, line: 158, baseType: !213, size: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pre_zero", scope: !234, file: !2, line: 159, baseType: !245, size: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !211, line: 227, baseType: !163)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !234, file: !2, line: 160, baseType: !245, size: 32, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_s_open", scope: !234, file: !2, line: 161, baseType: !245, size: 32, offset: 352)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !2, line: 162, baseType: !232, size: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "b_s_info", scope: !234, file: !2, line: 163, baseType: !250, size: 768, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "backing_store_info", file: !251, line: 155, baseType: !252)
!251 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmemsys.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "6d2a46c951025f2d29fe74061c465221")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "backing_store_struct", file: !251, line: 132, size: 768, elements: !253)
!253 = !{!254, !260, !261, !265, !321}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "read_backing_store", scope: !252, file: !251, line: 134, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !146, !258, !200, !145, !145}
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "backing_store_ptr", file: !251, line: 130, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "write_backing_store", scope: !252, file: !251, line: 138, baseType: !255, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "close_backing_store", scope: !252, file: !251, line: 142, baseType: !262, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !146, !258}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !252, file: !251, line: 152, baseType: !266, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !268, line: 7, baseType: !269)
!268 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !270, line: 49, size: 1728, elements: !271)
!270 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !287, !289, !290, !291, !294, !296, !298, !302, !305, !307, !310, !313, !314, !315, !316, !317}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !269, file: !270, line: 51, baseType: !163, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !269, file: !270, line: 54, baseType: !169, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !269, file: !270, line: 55, baseType: !169, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !269, file: !270, line: 56, baseType: !169, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !269, file: !270, line: 57, baseType: !169, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !269, file: !270, line: 58, baseType: !169, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !269, file: !270, line: 59, baseType: !169, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !269, file: !270, line: 60, baseType: !169, size: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !269, file: !270, line: 61, baseType: !169, size: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !269, file: !270, line: 64, baseType: !169, size: 64, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !269, file: !270, line: 65, baseType: !169, size: 64, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !269, file: !270, line: 66, baseType: !169, size: 64, offset: 704)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !269, file: !270, line: 68, baseType: !285, size: 64, offset: 768)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !270, line: 36, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !269, file: !270, line: 70, baseType: !288, size: 64, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !269, file: !270, line: 72, baseType: !163, size: 32, offset: 896)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !269, file: !270, line: 73, baseType: !163, size: 32, offset: 928)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !269, file: !270, line: 74, baseType: !292, size: 64, offset: 960)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !293, line: 152, baseType: !145)
!293 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !269, file: !270, line: 77, baseType: !295, size: 16, offset: 1024)
!295 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !269, file: !270, line: 78, baseType: !297, size: 8, offset: 1040)
!297 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !269, file: !270, line: 79, baseType: !299, size: 8, offset: 1048)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 1)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !269, file: !270, line: 81, baseType: !303, size: 64, offset: 1088)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !270, line: 43, baseType: null)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !269, file: !270, line: 89, baseType: !306, size: 64, offset: 1152)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !293, line: 153, baseType: !145)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !269, file: !270, line: 91, baseType: !308, size: 64, offset: 1216)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !270, line: 37, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !269, file: !270, line: 92, baseType: !311, size: 64, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !270, line: 38, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !269, file: !270, line: 93, baseType: !288, size: 64, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !269, file: !270, line: 94, baseType: !200, size: 64, offset: 1408)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !269, file: !270, line: 95, baseType: !142, size: 64, offset: 1472)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !269, file: !270, line: 96, baseType: !163, size: 32, offset: 1536)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !269, file: !270, line: 98, baseType: !318, size: 160, offset: 1568)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 20)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "temp_name", scope: !252, file: !251, line: 153, baseType: !322, size: 512, offset: 256)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !226)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !194, file: !147, line: 749, baseType: !324, size: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!327, !146, !163, !245, !213, !213, !213}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !147, line: 728, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !2, line: 166, size: 1216, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mem_buffer", scope: !329, file: !2, line: 167, baseType: !218, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rows_in_array", scope: !329, file: !2, line: 168, baseType: !213, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "blocksperrow", scope: !329, file: !2, line: 169, baseType: !213, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "maxaccess", scope: !329, file: !2, line: 170, baseType: !213, size: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "rows_in_mem", scope: !329, file: !2, line: 171, baseType: !213, size: 32, offset: 160)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rowsperchunk", scope: !329, file: !2, line: 172, baseType: !213, size: 32, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "cur_start_row", scope: !329, file: !2, line: 173, baseType: !213, size: 32, offset: 224)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "first_undef_row", scope: !329, file: !2, line: 174, baseType: !213, size: 32, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pre_zero", scope: !329, file: !2, line: 175, baseType: !245, size: 32, offset: 288)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !329, file: !2, line: 176, baseType: !245, size: 32, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "b_s_open", scope: !329, file: !2, line: 177, baseType: !245, size: 32, offset: 352)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !329, file: !2, line: 178, baseType: !327, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "b_s_info", scope: !329, file: !2, line: 179, baseType: !250, size: 768, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !194, file: !147, line: 755, baseType: !156, size: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !194, file: !147, line: 756, baseType: !346, size: 64, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!206, !146, !232, !213, !213, !245}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !194, file: !147, line: 761, baseType: !350, size: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!218, !146, !327, !213, !213, !245}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !194, file: !147, line: 766, baseType: !160, size: 64, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !194, file: !147, line: 767, baseType: !156, size: 64, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !194, file: !147, line: 774, baseType: !145, size: 64, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !149, file: !147, line: 241, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !147, line: 676, size: 256, elements: !359)
!359 = !{!360, !361, !362, !363, !364}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !358, file: !147, line: 677, baseType: !156, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !358, file: !147, line: 679, baseType: !145, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !358, file: !147, line: 680, baseType: !145, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !358, file: !147, line: 681, baseType: !163, size: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !358, file: !147, line: 682, baseType: !163, size: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !149, file: !147, line: 241, baseType: !245, size: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !149, file: !147, line: 241, baseType: !163, size: 32, offset: 224)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_mem_ptr", file: !2, line: 140, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_memory_mgr", file: !2, line: 138, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 116, size: 1280, elements: !371)
!371 = !{!372, !373, !389, !402, !403, !404, !405}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !370, file: !2, line: 117, baseType: !194, size: 768)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "small_list", scope: !370, file: !2, line: 120, baseType: !374, size: 128, offset: 768)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 128, elements: !387)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "small_pool_ptr", file: !2, line: 89, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "small_pool_struct", file: !2, line: 91, size: 192, elements: !378)
!378 = !{!379, !385}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !377, file: !2, line: 96, baseType: !380, size: 192)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !2, line: 92, size: 192, elements: !381)
!381 = !{!382, !383, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !380, file: !2, line: 93, baseType: !375, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !380, file: !2, line: 94, baseType: !142, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_left", scope: !380, file: !2, line: 95, baseType: !142, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !377, file: !2, line: 97, baseType: !386, size: 64)
!386 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!387 = !{!388}
!388 = !DISubrange(count: 2)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "large_list", scope: !370, file: !2, line: 121, baseType: !390, size: 128, offset: 896)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 128, elements: !387)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "large_pool_ptr", file: !2, line: 100, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "large_pool_struct", file: !2, line: 102, size: 192, elements: !394)
!394 = !{!395, !401}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !393, file: !2, line: 107, baseType: !396, size: 192)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !2, line: 103, size: 192, elements: !397)
!397 = !{!398, !399, !400}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !396, file: !2, line: 104, baseType: !391, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !396, file: !2, line: 105, baseType: !142, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_left", scope: !396, file: !2, line: 106, baseType: !142, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !393, file: !2, line: 108, baseType: !386, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "virt_sarray_list", scope: !370, file: !2, line: 128, baseType: !232, size: 64, offset: 1024)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "virt_barray_list", scope: !370, file: !2, line: 129, baseType: !327, size: 64, offset: 1088)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_allocated", scope: !370, file: !2, line: 132, baseType: !145, size: 64, offset: 1152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "last_rowsperchunk", scope: !370, file: !2, line: 137, baseType: !213, size: 32, offset: 1216)
!406 = !{!0, !7, !12, !407}
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "extra_pool_slop", scope: !14, file: !2, line: 247, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 128, elements: !387)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!411 = !{i32 7, !"Dwarf Version", i32 5}
!412 = !{i32 2, !"Debug Info Version", i32 3}
!413 = !{i32 1, !"wchar_size", i32 4}
!414 = !{i32 8, !"PIC Level", i32 2}
!415 = !{i32 7, !"PIE Level", i32 2}
!416 = !{i32 7, !"uwtable", i32 2}
!417 = !{i32 7, !"frame-pointer", i32 2}
!418 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!419 = distinct !DISubprogram(name: "jinit_memory_mgr", scope: !2, file: !2, line: 1028, type: !157, scopeLine: 1029, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !420)
!420 = !{}
!421 = !DILocalVariable(name: "cinfo", arg: 1, scope: !419, file: !2, line: 1028, type: !146)
!422 = !DILocation(line: 1028, column: 32, scope: !419)
!423 = !DILocalVariable(name: "mem", scope: !419, file: !2, line: 1030, type: !367)
!424 = !DILocation(line: 1030, column: 14, scope: !419)
!425 = !DILocalVariable(name: "max_to_use", scope: !419, file: !2, line: 1031, type: !145)
!426 = !DILocation(line: 1031, column: 8, scope: !419)
!427 = !DILocalVariable(name: "pool", scope: !419, file: !2, line: 1032, type: !163)
!428 = !DILocation(line: 1032, column: 7, scope: !419)
!429 = !DILocalVariable(name: "test_mac", scope: !419, file: !2, line: 1033, type: !142)
!430 = !DILocation(line: 1033, column: 10, scope: !419)
!431 = !DILocation(line: 1035, column: 3, scope: !419)
!432 = !DILocation(line: 1035, column: 10, scope: !419)
!433 = !DILocation(line: 1035, column: 14, scope: !419)
!434 = !DILocation(line: 1051, column: 12, scope: !419)
!435 = !DILocation(line: 1052, column: 14, scope: !436)
!436 = distinct !DILexicalBlock(scope: !419, file: !2, line: 1052, column: 7)
!437 = !DILocation(line: 1052, column: 23, scope: !436)
!438 = !DILocation(line: 1052, column: 42, scope: !436)
!439 = !DILocation(line: 1054, column: 5, scope: !436)
!440 = !DILocation(line: 1056, column: 30, scope: !419)
!441 = !DILocation(line: 1056, column: 16, scope: !419)
!442 = !DILocation(line: 1056, column: 14, scope: !419)
!443 = !DILocation(line: 1059, column: 37, scope: !419)
!444 = !DILocation(line: 1059, column: 22, scope: !419)
!445 = !DILocation(line: 1059, column: 7, scope: !419)
!446 = !DILocation(line: 1061, column: 7, scope: !447)
!447 = distinct !DILexicalBlock(scope: !419, file: !2, line: 1061, column: 7)
!448 = !DILocation(line: 1061, column: 11, scope: !447)
!449 = !DILocation(line: 1062, column: 19, scope: !450)
!450 = distinct !DILexicalBlock(scope: !447, file: !2, line: 1061, column: 20)
!451 = !DILocation(line: 1062, column: 5, scope: !450)
!452 = !DILocation(line: 1063, column: 5, scope: !450)
!453 = !DILocation(line: 1064, column: 3, scope: !450)
!454 = !DILocation(line: 1067, column: 3, scope: !419)
!455 = !DILocation(line: 1067, column: 8, scope: !419)
!456 = !DILocation(line: 1067, column: 12, scope: !419)
!457 = !DILocation(line: 1067, column: 24, scope: !419)
!458 = !DILocation(line: 1068, column: 3, scope: !419)
!459 = !DILocation(line: 1068, column: 8, scope: !419)
!460 = !DILocation(line: 1068, column: 12, scope: !419)
!461 = !DILocation(line: 1068, column: 24, scope: !419)
!462 = !DILocation(line: 1069, column: 3, scope: !419)
!463 = !DILocation(line: 1069, column: 8, scope: !419)
!464 = !DILocation(line: 1069, column: 12, scope: !419)
!465 = !DILocation(line: 1069, column: 25, scope: !419)
!466 = !DILocation(line: 1070, column: 3, scope: !419)
!467 = !DILocation(line: 1070, column: 8, scope: !419)
