; ModuleID = 'cBench/consumer_jpeg_c/src/jquant1.c'
source_filename = "cBench/consumer_jpeg_c/src/jquant1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_decompress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], i32, ptr, i32, i32, [16 x i8], [16 x i8], [16 x i8], i32, i32, i8, i16, i16, i32, i8, i32, i32, i32, i32, i32, ptr, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.my_cquantizer = type { %struct.jpeg_color_quantizer, ptr, i32, ptr, i32, [4 x i32], i32, [4 x ptr], [4 x ptr], i32 }
%struct.jpeg_color_quantizer = type { ptr, ptr, ptr, ptr }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }


!105 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!106 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!107 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!108 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!109 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!110 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!111 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!112 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!113 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!114 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!115 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!116 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!117 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!118 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!119 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!120 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!121 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!122 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!123 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!124 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!125 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!126 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!127 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!128 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!129 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!130 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!131 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!132 = !DIEnumerator(name: "JTRC_RST", value: 97)
!133 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!134 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!135 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!136 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!137 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!138 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!139 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!140 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!141 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!142 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!143 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!144 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!145 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!146 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!147 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!148 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!149 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!150 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!151 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!152 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!153 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!154 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!155 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!156 = !{!157, !181, !196, !574, !194, !195, !208, !590, !600, !597, !211, !256, !595}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_cquantize_ptr", file: !3, line: 167, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_cquantizer", file: !3, line: 165, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 142, size: 1216, elements: !161)
!161 = !{!162, !581, !582, !583, !584, !585, !587, !588, !593, !599}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !160, file: !3, line: 143, baseType: !163, size: 256)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !26, line: 252, size: 256, elements: !164)
!164 = !{!165, !575, !579, !580}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !163, file: !26, line: 253, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !169, !233}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !6, line: 250, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !6, line: 394, size: 4928, elements: !172)
!172 = !{!173, !300, !301, !302, !303, !304, !330, !331, !332, !333, !335, !336, !337, !338, !340, !341, !342, !344, !345, !346, !347, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !369, !382, !398, !399, !400, !426, !427, !428, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !450, !451, !452, !453, !457, !458, !459, !460, !461, !462, !469, !483, !501, !510, !520, !535, !544, !557, !564, !573}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !171, file: !6, line: 395, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !6, line: 618, size: 1344, elements: !176)
!176 = !{!177, !268, !269, !270, !276, !277, !278, !289, !290, !291, !296, !297, !298, !299}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !175, file: !6, line: 620, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !181}
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !6, line: 248, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !6, line: 240, size: 256, elements: !184)
!184 = !{!185, !186, !257, !266, !267}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !183, file: !6, line: 241, baseType: !174, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !183, file: !6, line: 241, baseType: !187, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !6, line: 731, size: 768, elements: !189)
!189 = !{!190, !199, !200, !212, !226, !234, !241, !242, !246, !250, !254, !255}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !188, file: !6, line: 733, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !181, !195, !196}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!195 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !197, line: 18, baseType: !198)
!197 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!198 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !188, file: !6, line: 735, baseType: !191, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !188, file: !6, line: 737, baseType: !201, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!204, !181, !195, !211, !211}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !6, line: 67, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !6, line: 66, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !209, line: 59, baseType: !210)
!209 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!210 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !209, line: 171, baseType: !7)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !188, file: !6, line: 740, baseType: !213, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !181, !195, !211, !211}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !6, line: 72, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !6, line: 71, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !6, line: 70, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 1024, elements: !224)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !209, line: 99, baseType: !223)
!223 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!224 = !{!225}
!225 = !DISubrange(count: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !188, file: !6, line: 743, baseType: !227, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !181, !195, !233, !211, !211, !211}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !6, line: 727, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !6, line: 727, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !209, line: 227, baseType: !195)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !188, file: !6, line: 749, baseType: !235, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!238, !181, !195, !233, !211, !211, !211}
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !6, line: 728, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !6, line: 728, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !188, file: !6, line: 755, baseType: !178, size: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !188, file: !6, line: 756, baseType: !243, size: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!204, !181, !230, !211, !211, !233}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !188, file: !6, line: 761, baseType: !247, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!216, !181, !238, !211, !211, !233}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !188, file: !6, line: 766, baseType: !251, size: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !181, !195}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !188, file: !6, line: 767, baseType: !178, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !188, file: !6, line: 774, baseType: !256, size: 64, offset: 704)
!256 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !183, file: !6, line: 241, baseType: !258, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !6, line: 676, size: 256, elements: !260)
!260 = !{!261, !262, !263, !264, !265}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !259, file: !6, line: 677, baseType: !178, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !259, file: !6, line: 679, baseType: !256, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !259, file: !6, line: 680, baseType: !256, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !259, file: !6, line: 681, baseType: !195, size: 32, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !259, file: !6, line: 682, baseType: !195, size: 32, offset: 224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !183, file: !6, line: 241, baseType: !233, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !183, file: !6, line: 241, baseType: !195, size: 32, offset: 224)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !175, file: !6, line: 622, baseType: !251, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !175, file: !6, line: 624, baseType: !178, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !175, file: !6, line: 626, baseType: !271, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !181, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !175, file: !6, line: 629, baseType: !178, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !175, file: !6, line: 634, baseType: !195, size: 32, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !175, file: !6, line: 639, baseType: !279, size: 640, offset: 352)
!279 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !175, file: !6, line: 636, size: 640, elements: !280)
!280 = !{!281, !285}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !279, file: !6, line: 637, baseType: !282, size: 256)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 256, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !279, file: !6, line: 638, baseType: !286, size: 640)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 640, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 80)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !175, file: !6, line: 643, baseType: !195, size: 32, offset: 992)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !175, file: !6, line: 651, baseType: !256, size: 64, offset: 1024)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !175, file: !6, line: 663, baseType: !292, size: 64, offset: 1088)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !175, file: !6, line: 664, baseType: !195, size: 32, offset: 1152)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !175, file: !6, line: 668, baseType: !292, size: 64, offset: 1216)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !175, file: !6, line: 669, baseType: !195, size: 32, offset: 1280)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !175, file: !6, line: 670, baseType: !195, size: 32, offset: 1312)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !171, file: !6, line: 395, baseType: !187, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !171, file: !6, line: 395, baseType: !258, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !171, file: !6, line: 395, baseType: !233, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !171, file: !6, line: 395, baseType: !195, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !171, file: !6, line: 398, baseType: !305, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !6, line: 700, size: 448, elements: !307)
!307 = !{!308, !312, !313, !317, !321, !325, !329}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !306, file: !6, line: 701, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !209, line: 110, baseType: !210)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !306, file: !6, line: 702, baseType: !196, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !306, file: !6, line: 704, baseType: !314, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !169}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !306, file: !6, line: 705, baseType: !318, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!233, !169}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !306, file: !6, line: 706, baseType: !322, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !169, !256}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !306, file: !6, line: 707, baseType: !326, size: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!233, !169, !195}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !306, file: !6, line: 708, baseType: !314, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !171, file: !6, line: 403, baseType: !211, size: 32, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !171, file: !6, line: 404, baseType: !211, size: 32, offset: 352)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !171, file: !6, line: 405, baseType: !195, size: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !171, file: !6, line: 406, baseType: !334, size: 32, offset: 416)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !6, line: 201, baseType: !5)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !171, file: !6, line: 413, baseType: !334, size: 32, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !171, file: !6, line: 415, baseType: !7, size: 32, offset: 480)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !171, file: !6, line: 415, baseType: !7, size: 32, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !171, file: !6, line: 417, baseType: !339, size: 64, offset: 576)
!339 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !171, file: !6, line: 419, baseType: !233, size: 32, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !171, file: !6, line: 420, baseType: !233, size: 32, offset: 672)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !171, file: !6, line: 422, baseType: !343, size: 32, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !6, line: 209, baseType: !15)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !171, file: !6, line: 423, baseType: !233, size: 32, offset: 736)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !171, file: !6, line: 424, baseType: !233, size: 32, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !171, file: !6, line: 426, baseType: !233, size: 32, offset: 800)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !171, file: !6, line: 428, baseType: !348, size: 32, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !6, line: 224, baseType: !20)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !171, file: !6, line: 429, baseType: !233, size: 32, offset: 864)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !171, file: !6, line: 430, baseType: !195, size: 32, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !171, file: !6, line: 432, baseType: !233, size: 32, offset: 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !171, file: !6, line: 433, baseType: !233, size: 32, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !171, file: !6, line: 434, baseType: !233, size: 32, offset: 992)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !171, file: !6, line: 442, baseType: !211, size: 32, offset: 1024)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !171, file: !6, line: 443, baseType: !211, size: 32, offset: 1056)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !171, file: !6, line: 444, baseType: !195, size: 32, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !171, file: !6, line: 445, baseType: !195, size: 32, offset: 1120)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !171, file: !6, line: 449, baseType: !195, size: 32, offset: 1152)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !171, file: !6, line: 461, baseType: !195, size: 32, offset: 1184)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !171, file: !6, line: 462, baseType: !204, size: 64, offset: 1216)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !171, file: !6, line: 472, baseType: !211, size: 32, offset: 1280)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !171, file: !6, line: 477, baseType: !195, size: 32, offset: 1312)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !171, file: !6, line: 478, baseType: !211, size: 32, offset: 1344)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !171, file: !6, line: 484, baseType: !195, size: 32, offset: 1376)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !171, file: !6, line: 485, baseType: !211, size: 32, offset: 1408)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !171, file: !6, line: 494, baseType: !367, size: 64, offset: 1472)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 2048, elements: !224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !171, file: !6, line: 505, baseType: !370, size: 256, offset: 1536)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 256, elements: !380)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !6, line: 95, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 83, size: 1056, elements: !374)
!374 = !{!375, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !373, file: !6, line: 88, baseType: !376, size: 1024)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 1024, elements: !224)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !209, line: 147, baseType: !378)
!378 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !373, file: !6, line: 94, baseType: !233, size: 32, offset: 1024)
!380 = !{!381}
!381 = !DISubrange(count: 4)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !171, file: !6, line: 508, baseType: !383, size: 256, offset: 1792)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 256, elements: !380)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !6, line: 111, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 100, size: 2240, elements: !387)
!387 = !{!388, !393, !397}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !386, file: !6, line: 102, baseType: !389, size: 136)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 136, elements: !391)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !209, line: 135, baseType: !210)
!391 = !{!392}
!392 = !DISubrange(count: 17)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !386, file: !6, line: 104, baseType: !394, size: 2048, offset: 136)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 2048, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !386, file: !6, line: 110, baseType: !233, size: 32, offset: 2208)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !171, file: !6, line: 509, baseType: !383, size: 256, offset: 2048)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !171, file: !6, line: 516, baseType: !195, size: 32, offset: 2304)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !171, file: !6, line: 518, baseType: !401, size: 64, offset: 2368)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !6, line: 179, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 116, size: 768, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !403, file: !6, line: 120, baseType: !195, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !403, file: !6, line: 121, baseType: !195, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !403, file: !6, line: 122, baseType: !195, size: 32, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !403, file: !6, line: 123, baseType: !195, size: 32, offset: 96)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !403, file: !6, line: 124, baseType: !195, size: 32, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !403, file: !6, line: 129, baseType: !195, size: 32, offset: 160)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !403, file: !6, line: 130, baseType: !195, size: 32, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !403, file: !6, line: 139, baseType: !211, size: 32, offset: 224)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !403, file: !6, line: 140, baseType: !211, size: 32, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !403, file: !6, line: 147, baseType: !195, size: 32, offset: 288)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !403, file: !6, line: 154, baseType: !211, size: 32, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !403, file: !6, line: 155, baseType: !211, size: 32, offset: 352)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !403, file: !6, line: 160, baseType: !233, size: 32, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !403, file: !6, line: 164, baseType: !195, size: 32, offset: 416)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !403, file: !6, line: 165, baseType: !195, size: 32, offset: 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !403, file: !6, line: 166, baseType: !195, size: 32, offset: 480)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !403, file: !6, line: 167, baseType: !195, size: 32, offset: 512)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !403, file: !6, line: 168, baseType: !195, size: 32, offset: 544)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !403, file: !6, line: 169, baseType: !195, size: 32, offset: 576)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !403, file: !6, line: 175, baseType: !371, size: 64, offset: 640)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !403, file: !6, line: 178, baseType: !194, size: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !171, file: !6, line: 521, baseType: !233, size: 32, offset: 2432)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !171, file: !6, line: 522, baseType: !233, size: 32, offset: 2464)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !171, file: !6, line: 524, baseType: !429, size: 128, offset: 2496)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 128, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 16)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !171, file: !6, line: 525, baseType: !429, size: 128, offset: 2624)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !171, file: !6, line: 526, baseType: !429, size: 128, offset: 2752)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !171, file: !6, line: 528, baseType: !7, size: 32, offset: 2880)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !171, file: !6, line: 533, baseType: !233, size: 32, offset: 2912)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !171, file: !6, line: 535, baseType: !390, size: 8, offset: 2944)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !171, file: !6, line: 536, baseType: !377, size: 16, offset: 2960)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !171, file: !6, line: 537, baseType: !377, size: 16, offset: 2976)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !171, file: !6, line: 538, baseType: !233, size: 32, offset: 3008)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !171, file: !6, line: 539, baseType: !390, size: 8, offset: 3040)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !171, file: !6, line: 541, baseType: !233, size: 32, offset: 3072)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !171, file: !6, line: 550, baseType: !195, size: 32, offset: 3104)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !171, file: !6, line: 551, baseType: !195, size: 32, offset: 3136)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !171, file: !6, line: 553, baseType: !195, size: 32, offset: 3168)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !171, file: !6, line: 555, baseType: !211, size: 32, offset: 3200)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !171, file: !6, line: 564, baseType: !207, size: 64, offset: 3264)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !171, file: !6, line: 571, baseType: !195, size: 32, offset: 3328)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !171, file: !6, line: 572, baseType: !449, size: 256, offset: 3392)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 256, elements: !380)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !171, file: !6, line: 575, baseType: !211, size: 32, offset: 3648)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !171, file: !6, line: 576, baseType: !211, size: 32, offset: 3680)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !171, file: !6, line: 578, baseType: !195, size: 32, offset: 3712)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !171, file: !6, line: 579, baseType: !454, size: 320, offset: 3744)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 320, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 10)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !171, file: !6, line: 583, baseType: !195, size: 32, offset: 4064)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !171, file: !6, line: 583, baseType: !195, size: 32, offset: 4096)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !171, file: !6, line: 583, baseType: !195, size: 32, offset: 4128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !171, file: !6, line: 583, baseType: !195, size: 32, offset: 4160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !171, file: !6, line: 589, baseType: !195, size: 32, offset: 4192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !171, file: !6, line: 594, baseType: !463, size: 64, offset: 4224)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !26, line: 136, size: 192, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_output_pass", scope: !464, file: !26, line: 137, baseType: !314, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output_pass", scope: !464, file: !26, line: 138, baseType: !314, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "is_dummy_pass", scope: !464, file: !26, line: 141, baseType: !233, size: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !171, file: !6, line: 595, baseType: !470, size: 64, offset: 4288)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !26, line: 157, size: 128, elements: !472)
!472 = !{!473, !478}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !471, file: !26, line: 158, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !169, !477}
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !26, line: 22, baseType: !25)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !471, file: !26, line: 159, baseType: !479, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !169, !204, !482, !211}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !171, file: !6, line: 596, baseType: !484, size: 64, offset: 4352)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !26, line: 165, size: 320, elements: !486)
!486 = !{!487, !488, !492, !493, !499}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !485, file: !26, line: 166, baseType: !314, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "consume_data", scope: !485, file: !26, line: 167, baseType: !489, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!195, !169}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "start_output_pass", scope: !485, file: !26, line: 168, baseType: !314, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "decompress_data", scope: !485, file: !26, line: 169, baseType: !494, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!195, !169, !497}
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !6, line: 68, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "coef_arrays", scope: !485, file: !26, line: 172, baseType: !500, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !171, file: !6, line: 597, baseType: !502, size: 64, offset: 4416)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !26, line: 176, size: 128, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !503, file: !26, line: 177, baseType: !474, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_data", scope: !503, file: !26, line: 178, baseType: !507, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !169, !497, !482, !211, !204, !482, !211}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !171, file: !6, line: 598, baseType: !511, size: 64, offset: 4480)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !26, line: 145, size: 320, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "consume_input", scope: !512, file: !26, line: 146, baseType: !489, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "reset_input_controller", scope: !512, file: !26, line: 147, baseType: !314, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !512, file: !26, line: 148, baseType: !314, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input_pass", scope: !512, file: !26, line: 149, baseType: !314, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "has_multiple_scans", scope: !512, file: !26, line: 152, baseType: !233, size: 32, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "eoi_reached", scope: !512, file: !26, line: 153, baseType: !233, size: 32, offset: 288)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !171, file: !6, line: 599, baseType: !521, size: 64, offset: 4544)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !26, line: 188, size: 1408, elements: !523)
!523 = !{!524, !525, !526, !528, !529, !531, !532, !533, !534}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "reset_marker_reader", scope: !522, file: !26, line: 189, baseType: !314, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "read_markers", scope: !522, file: !26, line: 194, baseType: !489, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "read_restart_marker", scope: !522, file: !26, line: 196, baseType: !527, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_marker_parser_method", file: !6, line: 781, baseType: !318)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "process_COM", scope: !522, file: !26, line: 198, baseType: !527, size: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "process_APPn", scope: !522, file: !26, line: 199, baseType: !530, size: 1024, offset: 256)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 1024, elements: !430)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOI", scope: !522, file: !26, line: 204, baseType: !233, size: 32, offset: 1280)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOF", scope: !522, file: !26, line: 205, baseType: !233, size: 32, offset: 1312)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "next_restart_num", scope: !522, file: !26, line: 206, baseType: !195, size: 32, offset: 1344)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "discarded_bytes", scope: !522, file: !26, line: 207, baseType: !7, size: 32, offset: 1376)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !171, file: !6, line: 600, baseType: !536, size: 64, offset: 4608)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !26, line: 211, size: 128, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !537, file: !26, line: 212, baseType: !314, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mcu", scope: !537, file: !26, line: 213, baseType: !541, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!233, !169, !217}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !171, file: !6, line: 601, baseType: !545, size: 64, offset: 4672)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !26, line: 223, size: 704, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !546, file: !26, line: 224, baseType: !314, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_DCT", scope: !546, file: !26, line: 226, baseType: !550, size: 640, offset: 64)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 640, elements: !455)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "inverse_DCT_method_ptr", file: !26, line: 218, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !169, !401, !555, !204, !211}
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEFPTR", file: !6, line: 75, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !171, file: !6, line: 602, baseType: !558, size: 64, offset: 4736)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !26, line: 230, size: 192, elements: !560)
!560 = !{!561, !562, !563}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !559, file: !26, line: 231, baseType: !314, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !559, file: !26, line: 232, baseType: !507, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !559, file: !26, line: 240, baseType: !233, size: 32, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !171, file: !6, line: 603, baseType: !565, size: 64, offset: 4800)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !26, line: 244, size: 128, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !566, file: !26, line: 245, baseType: !314, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !566, file: !26, line: 246, baseType: !570, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !169, !497, !211, !204, !195}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !171, file: !6, line: 604, baseType: !574, size: 64, offset: 4864)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "color_quantize", scope: !163, file: !26, line: 254, baseType: !576, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !169, !204, !204, !195}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !163, file: !26, line: 257, baseType: !314, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "new_color_map", scope: !163, file: !26, line: 258, baseType: !314, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "sv_colormap", scope: !160, file: !3, line: 146, baseType: !204, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sv_actual", scope: !160, file: !3, line: 147, baseType: !195, size: 32, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "colorindex", scope: !160, file: !3, line: 149, baseType: !204, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "is_padded", scope: !160, file: !3, line: 154, baseType: !233, size: 32, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Ncolors", scope: !160, file: !3, line: 156, baseType: !586, size: 128, offset: 480)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 128, elements: !380)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "row_index", scope: !160, file: !3, line: 159, baseType: !195, size: 32, offset: 608)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "odither", scope: !160, file: !3, line: 160, baseType: !589, size: 256, offset: 640)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 256, elements: !380)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "ODITHER_MATRIX_PTR", file: !3, line: 77, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 512, elements: !430)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "fserrors", scope: !160, file: !3, line: 163, baseType: !594, size: 256, offset: 896)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 256, elements: !380)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSERRPTR", file: !3, line: 135, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSERROR", file: !3, line: 128, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !209, line: 155, baseType: !223)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "on_odd_row", scope: !160, file: !3, line: 164, baseType: !233, size: 32, offset: 1152)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !209, line: 161, baseType: !256)
!601 = !{!0, !602}
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "RGB_order", scope: !604, file: !3, line: 196, type: !609, isLocal: true, isDefinition: true)
!604 = distinct !DISubprogram(name: "select_ncolors", scope: !3, file: !3, line: 186, type: !605, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !608)
!605 = !DISubroutineType(types: !606)
!606 = !{!195, !169, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!608 = !{}
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 96, elements: !611)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!611 = !{!612}
!612 = !DISubrange(count: 3)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 2048, elements: !615)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!615 = !{!431, !431}
!616 = !{i32 7, !"Dwarf Version", i32 5}
!617 = !{i32 2, !"Debug Info Version", i32 3}
!618 = !{i32 1, !"wchar_size", i32 4}
!619 = !{i32 8, !"PIC Level", i32 2}
!620 = !{i32 7, !"PIE Level", i32 2}
!621 = !{i32 7, !"uwtable", i32 2}
!622 = !{i32 7, !"frame-pointer", i32 2}
!623 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!624 = distinct !DISubprogram(name: "jinit_1pass_quantizer", scope: !3, file: !3, line: 821, type: !315, scopeLine: 822, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !608)
!625 = !DILocalVariable(name: "cinfo", arg: 1, scope: !624, file: !3, line: 821, type: !169)
!626 = !DILocation(line: 821, column: 41, scope: !624)
!627 = !DILocalVariable(name: "cquantize", scope: !624, file: !3, line: 823, type: !157)
!628 = !DILocation(line: 823, column: 20, scope: !624)
!629 = !DILocation(line: 826, column: 7, scope: !624)
!630 = !DILocation(line: 826, column: 14, scope: !624)
!631 = !DILocation(line: 826, column: 19, scope: !624)
!632 = !DILocation(line: 826, column: 48, scope: !624)
!633 = !DILocation(line: 826, column: 5, scope: !624)
!634 = !DILocation(line: 825, column: 13, scope: !624)
!635 = !DILocation(line: 828, column: 54, scope: !624)
!636 = !DILocation(line: 828, column: 3, scope: !624)
!637 = !DILocation(line: 828, column: 10, scope: !624)
!638 = !DILocation(line: 828, column: 20, scope: !624)
!639 = !DILocation(line: 829, column: 3, scope: !624)
!640 = !DILocation(line: 829, column: 14, scope: !624)
!641 = !DILocation(line: 829, column: 18, scope: !624)
!642 = !DILocation(line: 829, column: 29, scope: !624)
!643 = !DILocation(line: 830, column: 3, scope: !624)
!644 = !DILocation(line: 830, column: 14, scope: !624)
!645 = !DILocation(line: 830, column: 18, scope: !624)
!646 = !DILocation(line: 830, column: 30, scope: !624)
!647 = !DILocation(line: 831, column: 3, scope: !624)
!648 = !DILocation(line: 831, column: 14, scope: !624)
!649 = !DILocation(line: 831, column: 18, scope: !624)
!650 = !DILocation(line: 831, column: 32, scope: !624)
!651 = !DILocation(line: 832, column: 3, scope: !624)
!652 = !DILocation(line: 832, column: 14, scope: !624)
!653 = !DILocation(line: 832, column: 26, scope: !624)
!654 = !DILocation(line: 833, column: 3, scope: !624)
!655 = !DILocation(line: 833, column: 14, scope: !624)
!656 = !DILocation(line: 833, column: 25, scope: !624)
!657 = !DILocation(line: 836, column: 7, scope: !658)
!658 = distinct !DILexicalBlock(scope: !624, file: !3, line: 836, column: 7)
!659 = !DILocation(line: 836, column: 14, scope: !658)
!660 = !DILocation(line: 836, column: 35, scope: !658)
!661 = !DILocation(line: 837, column: 5, scope: !658)
!662 = !DILocation(line: 839, column: 7, scope: !663)
