; ModuleID = 'cBench/consumer_jpeg_c/src/jquant2.c'
source_filename = "cBench/consumer_jpeg_c/src/jquant2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_decompress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], i32, ptr, i32, i32, [16 x i8], [16 x i8], [16 x i8], i32, i32, i8, i16, i16, i32, i8, i32, i32, i32, i32, i32, ptr, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.my_cquantizer = type { %struct.jpeg_color_quantizer, ptr, i32, ptr, i32, ptr, i32, ptr }
%struct.jpeg_color_quantizer = type { ptr, ptr, ptr, ptr }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.box = type { i32, i32, i32, i32, i32, i32, i64, i64 }

; Function Attrs: noinline nounwind uwtable
define dso_local void @jinit_2pass_quantizer(ptr noundef %0) #0 !dbg !622 {
  %2 = alloca ptr, align 8
  %3 = alloca ptr, align 8
  %4 = alloca i32, align 4
  %5 = alloca i32, align 4
  store ptr %0, ptr %2, align 8

!103 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!104 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!105 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!106 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!107 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!108 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!109 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!110 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!111 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!112 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!113 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!114 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!115 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!116 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!117 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!118 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!119 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!120 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!121 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!122 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!123 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!124 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!125 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!126 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!127 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!128 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!129 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!130 = !DIEnumerator(name: "JTRC_RST", value: 97)
!131 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!132 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!133 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!134 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!135 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!136 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!137 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!138 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!139 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!140 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!141 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!142 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!143 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!144 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!145 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!146 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!147 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!148 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!149 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!150 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!151 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!152 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!153 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!154 = !{!155, !179, !194, !572, !582, !584, !209, !593, !192, !193, !600, !206, !595, !588, !599}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_cquantize_ptr", file: !1, line: 211, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_cquantizer", file: !1, line: 209, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 193, size: 704, elements: !159)
!159 = !{!160, !579, !580, !581, !591, !592, !597, !598}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !158, file: !1, line: 194, baseType: !161, size: 256)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !24, line: 252, size: 256, elements: !162)
!162 = !{!163, !573, !577, !578}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !161, file: !24, line: 253, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !167, !231}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_decompress_ptr", file: !4, line: 250, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decompress_struct", file: !4, line: 394, size: 4928, elements: !170)
!170 = !{!171, !298, !299, !300, !301, !302, !328, !329, !330, !331, !333, !334, !335, !336, !338, !339, !340, !342, !343, !344, !345, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !367, !380, !396, !397, !398, !424, !425, !426, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !448, !449, !450, !451, !455, !456, !457, !458, !459, !460, !467, !481, !499, !508, !518, !533, !542, !555, !562, !571}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !169, file: !4, line: 395, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !174)
!174 = !{!175, !266, !267, !268, !274, !275, !276, !287, !288, !289, !294, !295, !296, !297}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !173, file: !4, line: 620, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !179}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !182)
!182 = !{!183, !184, !255, !264, !265}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !181, file: !4, line: 241, baseType: !172, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !181, file: !4, line: 241, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !187)
!187 = !{!188, !197, !198, !210, !224, !232, !239, !240, !244, !248, !252, !253}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !186, file: !4, line: 733, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !179, !193, !194}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!193 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !195, line: 18, baseType: !196)
!195 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!196 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !186, file: !4, line: 735, baseType: !189, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !186, file: !4, line: 737, baseType: !199, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !179, !193, !209, !209}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !207, line: 59, baseType: !208)
!207 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!208 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !207, line: 171, baseType: !5)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !186, file: !4, line: 740, baseType: !211, size: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !179, !193, !209, !209}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 1024, elements: !222)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !207, line: 99, baseType: !221)
!221 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!222 = !{!223}
!223 = !DISubrange(count: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !186, file: !4, line: 743, baseType: !225, size: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !179, !193, !231, !209, !209, !209}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !207, line: 227, baseType: !193)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !186, file: !4, line: 749, baseType: !233, size: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !179, !193, !231, !209, !209, !209}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !186, file: !4, line: 755, baseType: !176, size: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !186, file: !4, line: 756, baseType: !241, size: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!202, !179, !228, !209, !209, !231}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !186, file: !4, line: 761, baseType: !245, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!214, !179, !236, !209, !209, !231}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !186, file: !4, line: 766, baseType: !249, size: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !179, !193}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !186, file: !4, line: 767, baseType: !176, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !186, file: !4, line: 774, baseType: !254, size: 64, offset: 704)
!254 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !181, file: !4, line: 241, baseType: !256, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !258)
!258 = !{!259, !260, !261, !262, !263}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !257, file: !4, line: 677, baseType: !176, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !257, file: !4, line: 679, baseType: !254, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !257, file: !4, line: 680, baseType: !254, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !257, file: !4, line: 681, baseType: !193, size: 32, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !257, file: !4, line: 682, baseType: !193, size: 32, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !181, file: !4, line: 241, baseType: !231, size: 32, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !181, file: !4, line: 241, baseType: !193, size: 32, offset: 224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !173, file: !4, line: 622, baseType: !249, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !173, file: !4, line: 624, baseType: !176, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !173, file: !4, line: 626, baseType: !269, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !179, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !173, file: !4, line: 629, baseType: !176, size: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !173, file: !4, line: 634, baseType: !193, size: 32, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !173, file: !4, line: 639, baseType: !277, size: 640, offset: 352)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !173, file: !4, line: 636, size: 640, elements: !278)
!278 = !{!279, !283}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !277, file: !4, line: 637, baseType: !280, size: 256)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 256, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !277, file: !4, line: 638, baseType: !284, size: 640)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 640, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 80)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !173, file: !4, line: 643, baseType: !193, size: 32, offset: 992)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !173, file: !4, line: 651, baseType: !254, size: 64, offset: 1024)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !173, file: !4, line: 663, baseType: !290, size: 64, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !173, file: !4, line: 664, baseType: !193, size: 32, offset: 1152)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !173, file: !4, line: 668, baseType: !290, size: 64, offset: 1216)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !173, file: !4, line: 669, baseType: !193, size: 32, offset: 1280)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !173, file: !4, line: 670, baseType: !193, size: 32, offset: 1312)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !169, file: !4, line: 395, baseType: !185, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !169, file: !4, line: 395, baseType: !256, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !169, file: !4, line: 395, baseType: !231, size: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !169, file: !4, line: 395, baseType: !193, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !169, file: !4, line: 398, baseType: !303, size: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_source_mgr", file: !4, line: 700, size: 448, elements: !305)
!305 = !{!306, !310, !311, !315, !319, !323, !327}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !304, file: !4, line: 701, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !207, line: 110, baseType: !208)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !304, file: !4, line: 702, baseType: !194, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !304, file: !4, line: 704, baseType: !312, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !167}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !304, file: !4, line: 705, baseType: !316, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!231, !167}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !304, file: !4, line: 706, baseType: !320, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !167, !254}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !304, file: !4, line: 707, baseType: !324, size: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!231, !167, !193}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !304, file: !4, line: 708, baseType: !312, size: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !169, file: !4, line: 403, baseType: !209, size: 32, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !169, file: !4, line: 404, baseType: !209, size: 32, offset: 352)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !169, file: !4, line: 405, baseType: !193, size: 32, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !169, file: !4, line: 406, baseType: !332, size: 32, offset: 416)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !169, file: !4, line: 413, baseType: !332, size: 32, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !169, file: !4, line: 415, baseType: !5, size: 32, offset: 480)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !169, file: !4, line: 415, baseType: !5, size: 32, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !169, file: !4, line: 417, baseType: !337, size: 64, offset: 576)
!337 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !169, file: !4, line: 419, baseType: !231, size: 32, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !169, file: !4, line: 420, baseType: !231, size: 32, offset: 672)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !169, file: !4, line: 422, baseType: !341, size: 32, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !169, file: !4, line: 423, baseType: !231, size: 32, offset: 736)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !169, file: !4, line: 424, baseType: !231, size: 32, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !169, file: !4, line: 426, baseType: !231, size: 32, offset: 800)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !169, file: !4, line: 428, baseType: !346, size: 32, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DITHER_MODE", file: !4, line: 224, baseType: !18)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !169, file: !4, line: 429, baseType: !231, size: 32, offset: 864)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !169, file: !4, line: 430, baseType: !193, size: 32, offset: 896)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !169, file: !4, line: 432, baseType: !231, size: 32, offset: 928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "enable_external_quant", scope: !169, file: !4, line: 433, baseType: !231, size: 32, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !169, file: !4, line: 434, baseType: !231, size: 32, offset: 992)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !169, file: !4, line: 442, baseType: !209, size: 32, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !169, file: !4, line: 443, baseType: !209, size: 32, offset: 1056)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !169, file: !4, line: 444, baseType: !193, size: 32, offset: 1088)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !169, file: !4, line: 445, baseType: !193, size: 32, offset: 1120)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !169, file: !4, line: 449, baseType: !193, size: 32, offset: 1152)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !169, file: !4, line: 461, baseType: !193, size: 32, offset: 1184)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !169, file: !4, line: 462, baseType: !202, size: 64, offset: 1216)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !169, file: !4, line: 472, baseType: !209, size: 32, offset: 1280)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !169, file: !4, line: 477, baseType: !193, size: 32, offset: 1312)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !169, file: !4, line: 478, baseType: !209, size: 32, offset: 1344)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !169, file: !4, line: 484, baseType: !193, size: 32, offset: 1376)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !169, file: !4, line: 485, baseType: !209, size: 32, offset: 1408)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !169, file: !4, line: 494, baseType: !365, size: 64, offset: 1472)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 2048, elements: !222)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !169, file: !4, line: 505, baseType: !368, size: 256, offset: 1536)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 256, elements: !378)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !372)
!372 = !{!373, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !371, file: !4, line: 88, baseType: !374, size: 1024)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 1024, elements: !222)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !207, line: 147, baseType: !376)
!376 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !371, file: !4, line: 94, baseType: !231, size: 32, offset: 1024)
!378 = !{!379}
!379 = !DISubrange(count: 4)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !169, file: !4, line: 508, baseType: !381, size: 256, offset: 1792)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 256, elements: !378)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !385)
!385 = !{!386, !391, !395}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !384, file: !4, line: 102, baseType: !387, size: 136)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 136, elements: !389)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !207, line: 135, baseType: !208)
!389 = !{!390}
!390 = !DISubrange(count: 17)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !384, file: !4, line: 104, baseType: !392, size: 2048, offset: 136)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 2048, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !384, file: !4, line: 110, baseType: !231, size: 32, offset: 2208)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !169, file: !4, line: 509, baseType: !381, size: 256, offset: 2048)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !169, file: !4, line: 516, baseType: !193, size: 32, offset: 2304)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !169, file: !4, line: 518, baseType: !399, size: 64, offset: 2368)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !401, file: !4, line: 120, baseType: !193, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !401, file: !4, line: 121, baseType: !193, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !401, file: !4, line: 122, baseType: !193, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !401, file: !4, line: 123, baseType: !193, size: 32, offset: 96)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !401, file: !4, line: 124, baseType: !193, size: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !401, file: !4, line: 129, baseType: !193, size: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !401, file: !4, line: 130, baseType: !193, size: 32, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !401, file: !4, line: 139, baseType: !209, size: 32, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !401, file: !4, line: 140, baseType: !209, size: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !401, file: !4, line: 147, baseType: !193, size: 32, offset: 288)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !401, file: !4, line: 154, baseType: !209, size: 32, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !401, file: !4, line: 155, baseType: !209, size: 32, offset: 352)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !401, file: !4, line: 160, baseType: !231, size: 32, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !401, file: !4, line: 164, baseType: !193, size: 32, offset: 416)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !401, file: !4, line: 165, baseType: !193, size: 32, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !401, file: !4, line: 166, baseType: !193, size: 32, offset: 480)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !401, file: !4, line: 167, baseType: !193, size: 32, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !401, file: !4, line: 168, baseType: !193, size: 32, offset: 544)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !401, file: !4, line: 169, baseType: !193, size: 32, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !401, file: !4, line: 175, baseType: !369, size: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !401, file: !4, line: 178, baseType: !192, size: 64, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !169, file: !4, line: 521, baseType: !231, size: 32, offset: 2432)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !169, file: !4, line: 522, baseType: !231, size: 32, offset: 2464)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !169, file: !4, line: 524, baseType: !427, size: 128, offset: 2496)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 128, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 16)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !169, file: !4, line: 525, baseType: !427, size: 128, offset: 2624)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !169, file: !4, line: 526, baseType: !427, size: 128, offset: 2752)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !169, file: !4, line: 528, baseType: !5, size: 32, offset: 2880)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !169, file: !4, line: 533, baseType: !231, size: 32, offset: 2912)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !169, file: !4, line: 535, baseType: !388, size: 8, offset: 2944)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !169, file: !4, line: 536, baseType: !375, size: 16, offset: 2960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !169, file: !4, line: 537, baseType: !375, size: 16, offset: 2976)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !169, file: !4, line: 538, baseType: !231, size: 32, offset: 3008)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !169, file: !4, line: 539, baseType: !388, size: 8, offset: 3040)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !169, file: !4, line: 541, baseType: !231, size: 32, offset: 3072)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !169, file: !4, line: 550, baseType: !193, size: 32, offset: 3104)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !169, file: !4, line: 551, baseType: !193, size: 32, offset: 3136)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !169, file: !4, line: 553, baseType: !193, size: 32, offset: 3168)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !169, file: !4, line: 555, baseType: !209, size: 32, offset: 3200)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !169, file: !4, line: 564, baseType: !205, size: 64, offset: 3264)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !169, file: !4, line: 571, baseType: !193, size: 32, offset: 3328)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !169, file: !4, line: 572, baseType: !447, size: 256, offset: 3392)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 256, elements: !378)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !169, file: !4, line: 575, baseType: !209, size: 32, offset: 3648)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !169, file: !4, line: 576, baseType: !209, size: 32, offset: 3680)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !169, file: !4, line: 578, baseType: !193, size: 32, offset: 3712)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !169, file: !4, line: 579, baseType: !452, size: 320, offset: 3744)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 320, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 10)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !169, file: !4, line: 583, baseType: !193, size: 32, offset: 4064)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !169, file: !4, line: 583, baseType: !193, size: 32, offset: 4096)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !169, file: !4, line: 583, baseType: !193, size: 32, offset: 4128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !169, file: !4, line: 583, baseType: !193, size: 32, offset: 4160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !169, file: !4, line: 589, baseType: !193, size: 32, offset: 4192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !169, file: !4, line: 594, baseType: !461, size: 64, offset: 4224)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !24, line: 136, size: 192, elements: !463)
!463 = !{!464, !465, !466}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_for_output_pass", scope: !462, file: !24, line: 137, baseType: !312, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output_pass", scope: !462, file: !24, line: 138, baseType: !312, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "is_dummy_pass", scope: !462, file: !24, line: 141, baseType: !231, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !169, file: !4, line: 595, baseType: !468, size: 64, offset: 4288)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !24, line: 157, size: 128, elements: !470)
!470 = !{!471, !476}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !469, file: !24, line: 158, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !167, !475}
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_BUF_MODE", file: !24, line: 22, baseType: !23)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "process_data", scope: !469, file: !24, line: 159, baseType: !477, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !167, !202, !480, !209}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !169, file: !4, line: 596, baseType: !482, size: 64, offset: 4352)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !24, line: 165, size: 320, elements: !484)
!484 = !{!485, !486, !490, !491, !497}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !483, file: !24, line: 166, baseType: !312, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "consume_data", scope: !483, file: !24, line: 167, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!193, !167}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "start_output_pass", scope: !483, file: !24, line: 168, baseType: !312, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "decompress_data", scope: !483, file: !24, line: 169, baseType: !492, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!193, !167, !495}
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPIMAGE", file: !4, line: 68, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "coef_arrays", scope: !483, file: !24, line: 172, baseType: !498, size: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !169, file: !4, line: 597, baseType: !500, size: 64, offset: 4416)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !24, line: 176, size: 128, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !501, file: !24, line: 177, baseType: !472, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "post_process_data", scope: !501, file: !24, line: 178, baseType: !505, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !167, !495, !480, !209, !202, !480, !209}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !169, file: !4, line: 598, baseType: !509, size: 64, offset: 4480)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !24, line: 145, size: 320, elements: !511)
!511 = !{!512, !513, !514, !515, !516, !517}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "consume_input", scope: !510, file: !24, line: 146, baseType: !487, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "reset_input_controller", scope: !510, file: !24, line: 147, baseType: !312, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "start_input_pass", scope: !510, file: !24, line: 148, baseType: !312, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input_pass", scope: !510, file: !24, line: 149, baseType: !312, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "has_multiple_scans", scope: !510, file: !24, line: 152, baseType: !231, size: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "eoi_reached", scope: !510, file: !24, line: 153, baseType: !231, size: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !169, file: !4, line: 599, baseType: !519, size: 64, offset: 4544)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !24, line: 188, size: 1408, elements: !521)
!521 = !{!522, !523, !524, !526, !527, !529, !530, !531, !532}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reset_marker_reader", scope: !520, file: !24, line: 189, baseType: !312, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "read_markers", scope: !520, file: !24, line: 194, baseType: !487, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "read_restart_marker", scope: !520, file: !24, line: 196, baseType: !525, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_marker_parser_method", file: !4, line: 781, baseType: !316)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "process_COM", scope: !520, file: !24, line: 198, baseType: !525, size: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "process_APPn", scope: !520, file: !24, line: 199, baseType: !528, size: 1024, offset: 256)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 1024, elements: !428)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOI", scope: !520, file: !24, line: 204, baseType: !231, size: 32, offset: 1280)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "saw_SOF", scope: !520, file: !24, line: 205, baseType: !231, size: 32, offset: 1312)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "next_restart_num", scope: !520, file: !24, line: 206, baseType: !193, size: 32, offset: 1344)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "discarded_bytes", scope: !520, file: !24, line: 207, baseType: !5, size: 32, offset: 1376)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !169, file: !4, line: 600, baseType: !534, size: 64, offset: 4608)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !24, line: 211, size: 128, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !535, file: !24, line: 212, baseType: !312, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mcu", scope: !535, file: !24, line: 213, baseType: !539, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!231, !167, !215}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !169, file: !4, line: 601, baseType: !543, size: 64, offset: 4672)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !24, line: 223, size: 704, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !544, file: !24, line: 224, baseType: !312, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_DCT", scope: !544, file: !24, line: 226, baseType: !548, size: 640, offset: 64)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 640, elements: !453)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "inverse_DCT_method_ptr", file: !24, line: 218, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !167, !399, !553, !202, !209}
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEFPTR", file: !4, line: 75, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !169, file: !4, line: 602, baseType: !556, size: 64, offset: 4736)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !24, line: 230, size: 192, elements: !558)
!558 = !{!559, !560, !561}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !557, file: !24, line: 231, baseType: !312, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !557, file: !24, line: 232, baseType: !505, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "need_context_rows", scope: !557, file: !24, line: 240, baseType: !231, size: 32, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !169, file: !4, line: 603, baseType: !563, size: 64, offset: 4800)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !24, line: 244, size: 128, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "start_pass", scope: !564, file: !24, line: 245, baseType: !312, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "color_convert", scope: !564, file: !24, line: 246, baseType: !568, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !167, !495, !209, !202, !193}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !169, file: !4, line: 604, baseType: !572, size: 64, offset: 4864)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "color_quantize", scope: !161, file: !24, line: 254, baseType: !574, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !167, !202, !202, !193}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "finish_pass", scope: !161, file: !24, line: 257, baseType: !312, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "new_color_map", scope: !161, file: !24, line: 258, baseType: !312, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sv_colormap", scope: !158, file: !1, line: 197, baseType: !202, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "desired", scope: !158, file: !1, line: 198, baseType: !193, size: 32, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "histogram", scope: !158, file: !1, line: 201, baseType: !582, size: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "hist3d", file: !1, line: 153, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "hist2d", file: !1, line: 152, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "hist1d", file: !1, line: 151, baseType: !587)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 512, elements: !589)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "histcell", file: !1, line: 147, baseType: !375)
!589 = !{!590}
!590 = !DISubrange(count: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "needs_zeroed", scope: !158, file: !1, line: 203, baseType: !231, size: 32, offset: 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "fserrors", scope: !158, file: !1, line: 206, baseType: !593, size: 64, offset: 512)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSERRPTR", file: !1, line: 188, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "FSERROR", file: !1, line: 181, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !207, line: 155, baseType: !221)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "on_odd_row", scope: !158, file: !1, line: 207, baseType: !231, size: 32, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "error_limiter", scope: !158, file: !1, line: 208, baseType: !599, size: 64, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "boxptr", file: !1, line: 269, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "box", file: !1, line: 267, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 258, size: 320, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !613}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "c0min", scope: !603, file: !1, line: 260, baseType: !193, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "c0max", scope: !603, file: !1, line: 260, baseType: !193, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "c1min", scope: !603, file: !1, line: 261, baseType: !193, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "c1max", scope: !603, file: !1, line: 261, baseType: !193, size: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "c2min", scope: !603, file: !1, line: 262, baseType: !193, size: 32, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "c2max", scope: !603, file: !1, line: 262, baseType: !193, size: 32, offset: 160)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !603, file: !1, line: 264, baseType: !612, size: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !207, line: 161, baseType: !254)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "colorcount", scope: !603, file: !1, line: 266, baseType: !254, size: 64, offset: 256)
!614 = !{i32 7, !"Dwarf Version", i32 5}
!615 = !{i32 2, !"Debug Info Version", i32 3}
!616 = !{i32 1, !"wchar_size", i32 4}
!617 = !{i32 8, !"PIC Level", i32 2}
!618 = !{i32 7, !"PIE Level", i32 2}
!619 = !{i32 7, !"uwtable", i32 2}
!620 = !{i32 7, !"frame-pointer", i32 2}
!621 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!622 = distinct !DISubprogram(name: "jinit_2pass_quantizer", scope: !1, file: !1, line: 1244, type: !313, scopeLine: 1245, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !623)
!623 = !{}
!624 = !DILocalVariable(name: "cinfo", arg: 1, scope: !622, file: !1, line: 1244, type: !167)
!625 = !DILocation(line: 1244, column: 41, scope: !622)
!626 = !DILocalVariable(name: "cquantize", scope: !622, file: !1, line: 1246, type: !155)
!627 = !DILocation(line: 1246, column: 20, scope: !622)
!628 = !DILocalVariable(name: "i", scope: !622, file: !1, line: 1247, type: !193)
!629 = !DILocation(line: 1247, column: 7, scope: !622)
!630 = !DILocation(line: 1250, column: 7, scope: !622)
!631 = !DILocation(line: 1250, column: 14, scope: !622)
!632 = !DILocation(line: 1250, column: 19, scope: !622)
!633 = !DILocation(line: 1250, column: 48, scope: !622)
!634 = !DILocation(line: 1250, column: 5, scope: !622)
!635 = !DILocation(line: 1249, column: 13, scope: !622)
!636 = !DILocation(line: 1252, column: 54, scope: !622)
!637 = !DILocation(line: 1252, column: 3, scope: !622)
!638 = !DILocation(line: 1252, column: 10, scope: !622)
!639 = !DILocation(line: 1252, column: 20, scope: !622)
!640 = !DILocation(line: 1253, column: 3, scope: !622)
!641 = !DILocation(line: 1253, column: 14, scope: !622)
!642 = !DILocation(line: 1253, column: 18, scope: !622)
!643 = !DILocation(line: 1253, column: 29, scope: !622)
!644 = !DILocation(line: 1254, column: 3, scope: !622)
!645 = !DILocation(line: 1254, column: 14, scope: !622)
!646 = !DILocation(line: 1254, column: 18, scope: !622)
!647 = !DILocation(line: 1254, column: 32, scope: !622)
!648 = !DILocation(line: 1255, column: 3, scope: !622)
!649 = !DILocation(line: 1255, column: 14, scope: !622)
!650 = !DILocation(line: 1255, column: 23, scope: !622)
!651 = !DILocation(line: 1256, column: 3, scope: !622)
!652 = !DILocation(line: 1256, column: 14, scope: !622)
!653 = !DILocation(line: 1256, column: 28, scope: !622)
!654 = !DILocation(line: 1259, column: 7, scope: !655)
!655 = distinct !DILexicalBlock(scope: !622, file: !1, line: 1259, column: 7)
!656 = !DILocation(line: 1259, column: 14, scope: !655)
!657 = !DILocation(line: 1259, column: 35, scope: !655)
!658 = !DILocation(line: 1260, column: 5, scope: !655)
!659 = !DILocation(line: 1263, column: 37, scope: !622)
!660 = !DILocation(line: 1263, column: 44, scope: !622)
!661 = !DILocation(line: 1263, column: 49, scope: !622)
!662 = !DILocation(line: 1264, column: 21, scope: !622)
!663 = !DILocation(line: 1263, column: 35, scope: !622)
!664 = !DILocation(line: 1263, column: 3, scope: !622)
!665 = !DILocation(line: 1263, column: 14, scope: !622)
!666 = !DILocation(line: 1263, column: 24, scope: !622)
!667 = !DILocation(line: 1265, column: 10, scope: !668)
!668 = distinct !DILexicalBlock(scope: !622, file: !1, line: 1265, column: 3)
!669 = !DILocation(line: 1265, column: 8, scope: !668)
!670 = !DILocation(line: 1265, column: 15, scope: !671)
!671 = distinct !DILexicalBlock(scope: !668, file: !1, line: 1265, column: 3)
!672 = !DILocation(line: 1265, column: 17, scope: !671)
!673 = !DILocation(line: 1265, column: 3, scope: !668)
!674 = !DILocation(line: 1266, column: 42, scope: !675)
!675 = distinct !DILexicalBlock(scope: !671, file: !1, line: 1265, column: 39)
!676 = !DILocation(line: 1266, column: 49, scope: !675)
!677 = !DILocation(line: 1266, column: 54, scope: !675)
!678 = !DILocation(line: 1267, column: 23, scope: !675)
