; ModuleID = 'cBench/consumer_jpeg_c/src/rdbmp.c'
source_filename = "cBench/consumer_jpeg_c/src/rdbmp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_compress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, double, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], [16 x i8], [16 x i8], [16 x i8], i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct._bmp_source_struct = type { %struct.cjpeg_source_struct, ptr, ptr, ptr, i32, i32, i32 }
%struct.cjpeg_source_struct = type { ptr, ptr, ptr, ptr, ptr, i32 }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.cdjpeg_progress_mgr = type { %struct.jpeg_progress_mgr, i32, i32, i32 }
%struct.jpeg_progress_mgr = type { ptr, i64, i64, i32, i32 }

; Function Attrs: noinline nounwind uwtable
define dso_local ptr @jinit_read_bmp(ptr noundef %0) #0 !dbg !587 {
  %2 = alloca ptr, align 8
  %3 = alloca ptr, align 8
  store ptr %0, ptr %2, align 8
    #dbg_declare(ptr %2, !591, !DIExpression(), !592)

!143 = !DIFile(filename: "cBench/consumer_jpeg_c/src/cderror.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "023c024f882773b78143e7b16d959dcc")
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!145 = !DIEnumerator(name: "JMSG_FIRSTADDONCODE", value: 1000)
!146 = !DIEnumerator(name: "JERR_BMP_BADCMAP", value: 1001)
!147 = !DIEnumerator(name: "JERR_BMP_BADDEPTH", value: 1002)
!148 = !DIEnumerator(name: "JERR_BMP_BADHEADER", value: 1003)
!149 = !DIEnumerator(name: "JERR_BMP_BADPLANES", value: 1004)
!150 = !DIEnumerator(name: "JERR_BMP_COLORSPACE", value: 1005)
!151 = !DIEnumerator(name: "JERR_BMP_COMPRESSED", value: 1006)
!152 = !DIEnumerator(name: "JERR_BMP_NOT", value: 1007)
!153 = !DIEnumerator(name: "JTRC_BMP", value: 1008)
!154 = !DIEnumerator(name: "JTRC_BMP_MAPPED", value: 1009)
!155 = !DIEnumerator(name: "JTRC_BMP_OS2", value: 1010)
!156 = !DIEnumerator(name: "JTRC_BMP_OS2_MAPPED", value: 1011)
!157 = !DIEnumerator(name: "JERR_GIF_BUG", value: 1012)
!158 = !DIEnumerator(name: "JERR_GIF_CODESIZE", value: 1013)
!159 = !DIEnumerator(name: "JERR_GIF_COLORSPACE", value: 1014)
!160 = !DIEnumerator(name: "JERR_GIF_IMAGENOTFOUND", value: 1015)
!161 = !DIEnumerator(name: "JERR_GIF_NOT", value: 1016)
!162 = !DIEnumerator(name: "JTRC_GIF", value: 1017)
!163 = !DIEnumerator(name: "JTRC_GIF_BADVERSION", value: 1018)
!164 = !DIEnumerator(name: "JTRC_GIF_EXTENSION", value: 1019)
!165 = !DIEnumerator(name: "JTRC_GIF_NONSQUARE", value: 1020)
!166 = !DIEnumerator(name: "JWRN_GIF_BADDATA", value: 1021)
!167 = !DIEnumerator(name: "JWRN_GIF_CHAR", value: 1022)
!168 = !DIEnumerator(name: "JWRN_GIF_ENDCODE", value: 1023)
!169 = !DIEnumerator(name: "JWRN_GIF_NOMOREDATA", value: 1024)
!170 = !DIEnumerator(name: "JERR_PPM_COLORSPACE", value: 1025)
!171 = !DIEnumerator(name: "JERR_PPM_NONNUMERIC", value: 1026)
!172 = !DIEnumerator(name: "JERR_PPM_NOT", value: 1027)
!173 = !DIEnumerator(name: "JTRC_PGM", value: 1028)
!174 = !DIEnumerator(name: "JTRC_PGM_TEXT", value: 1029)
!175 = !DIEnumerator(name: "JTRC_PPM", value: 1030)
!176 = !DIEnumerator(name: "JTRC_PPM_TEXT", value: 1031)
!177 = !DIEnumerator(name: "JERR_TGA_BADCMAP", value: 1032)
!178 = !DIEnumerator(name: "JERR_TGA_BADPARMS", value: 1033)
!179 = !DIEnumerator(name: "JERR_TGA_COLORSPACE", value: 1034)
!180 = !DIEnumerator(name: "JTRC_TGA", value: 1035)
!181 = !DIEnumerator(name: "JTRC_TGA_GRAY", value: 1036)
!182 = !DIEnumerator(name: "JTRC_TGA_MAPPED", value: 1037)
!183 = !DIEnumerator(name: "JERR_BAD_CMAP_FILE", value: 1038)
!184 = !DIEnumerator(name: "JERR_TOO_MANY_COLORS", value: 1039)
!185 = !DIEnumerator(name: "JERR_UNGETC_FAILED", value: 1040)
!186 = !DIEnumerator(name: "JERR_UNKNOWN_FORMAT", value: 1041)
!187 = !DIEnumerator(name: "JERR_UNSUPPORTED_FORMAT", value: 1042)
!188 = !DIEnumerator(name: "JMSG_LASTADDONCODE", value: 1043)
!189 = !{!190, !214, !229, !500, !227, !5, !228, !570, !395, !244, !571, !241, !289}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmp_source_ptr", file: !1, line: 50, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_bmp_source_struct", file: !1, line: 52, size: 704, elements: !193)
!193 = !{!194, !564, !565, !566, !567, !568, !569}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !192, file: !1, line: 53, baseType: !195, size: 384)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_source_struct", file: !196, line: 26, size: 384, elements: !197)
!196 = !DIFile(filename: "cBench/consumer_jpeg_c/src/cdjpeg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "bced6b83fac9f9ba4577dcff987736ac")
!197 = !{!198, !502, !506, !507, !562, !563}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "start_input", scope: !195, file: !196, line: 27, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !202, !500}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_compress_ptr", file: !4, line: 249, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !4, line: 255, size: 3968, elements: !205)
!205 = !{!206, !333, !334, !335, !336, !337, !354, !355, !356, !357, !359, !361, !362, !363, !364, !399, !403, !419, !420, !424, !425, !426, !427, !440, !441, !442, !443, !444, !445, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !462, !463, !464, !465, !469, !470, !471, !472, !473, !476, !479, !482, !485, !488, !491, !494, !497}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !204, file: !4, line: 256, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !209)
!209 = !{!210, !301, !302, !303, !309, !310, !311, !322, !323, !324, !329, !330, !331, !332}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !208, file: !4, line: 620, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !214}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !217)
!217 = !{!218, !219, !290, !299, !300}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !216, file: !4, line: 241, baseType: !207, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !216, file: !4, line: 241, baseType: !220, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !222)
!222 = !{!223, !232, !233, !245, !259, !267, !274, !275, !279, !283, !287, !288}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !221, file: !4, line: 733, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !214, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!228 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !230, line: 18, baseType: !231)
!230 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!231 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !221, file: !4, line: 735, baseType: !224, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !221, file: !4, line: 737, baseType: !234, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !214, !228, !244, !244}
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !242, line: 59, baseType: !243)
!242 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!243 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !242, line: 171, baseType: !5)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !221, file: !4, line: 740, baseType: !246, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!249, !214, !228, !244, !244}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !254)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 1024, elements: !257)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !242, line: 99, baseType: !256)
!256 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!257 = !{!258}
!258 = !DISubrange(count: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !221, file: !4, line: 743, baseType: !260, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!263, !214, !228, !266, !244, !244, !244}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !242, line: 227, baseType: !228)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !221, file: !4, line: 749, baseType: !268, size: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!271, !214, !228, !266, !244, !244, !244}
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !221, file: !4, line: 755, baseType: !211, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !221, file: !4, line: 756, baseType: !276, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!237, !214, !263, !244, !244, !266}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !221, file: !4, line: 761, baseType: !280, size: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!249, !214, !271, !244, !244, !266}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !221, file: !4, line: 766, baseType: !284, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !214, !228}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !221, file: !4, line: 767, baseType: !211, size: 64, offset: 640)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !221, file: !4, line: 774, baseType: !289, size: 64, offset: 704)
!289 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !216, file: !4, line: 241, baseType: !291, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !293)
!293 = !{!294, !295, !296, !297, !298}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !292, file: !4, line: 677, baseType: !211, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !292, file: !4, line: 679, baseType: !289, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !292, file: !4, line: 680, baseType: !289, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !292, file: !4, line: 681, baseType: !228, size: 32, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !292, file: !4, line: 682, baseType: !228, size: 32, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !216, file: !4, line: 241, baseType: !266, size: 32, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !216, file: !4, line: 241, baseType: !228, size: 32, offset: 224)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !208, file: !4, line: 622, baseType: !284, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !208, file: !4, line: 624, baseType: !211, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !208, file: !4, line: 626, baseType: !304, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !214, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !208, file: !4, line: 629, baseType: !211, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !208, file: !4, line: 634, baseType: !228, size: 32, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !208, file: !4, line: 639, baseType: !312, size: 640, offset: 352)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !208, file: !4, line: 636, size: 640, elements: !313)
!313 = !{!314, !318}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !312, file: !4, line: 637, baseType: !315, size: 256)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 256, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 8)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !312, file: !4, line: 638, baseType: !319, size: 640)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 640, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 80)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !208, file: !4, line: 643, baseType: !228, size: 32, offset: 992)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !208, file: !4, line: 651, baseType: !289, size: 64, offset: 1024)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !208, file: !4, line: 663, baseType: !325, size: 64, offset: 1088)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !208, file: !4, line: 664, baseType: !228, size: 32, offset: 1152)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !208, file: !4, line: 668, baseType: !325, size: 64, offset: 1216)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !208, file: !4, line: 669, baseType: !228, size: 32, offset: 1280)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !208, file: !4, line: 670, baseType: !228, size: 32, offset: 1312)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !204, file: !4, line: 256, baseType: !220, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !204, file: !4, line: 256, baseType: !291, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !204, file: !4, line: 256, baseType: !266, size: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !204, file: !4, line: 256, baseType: !228, size: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !204, file: !4, line: 259, baseType: !338, size: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !4, line: 688, size: 320, elements: !340)
!340 = !{!341, !344, !345, !349, !353}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !339, file: !4, line: 689, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !242, line: 110, baseType: !243)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !339, file: !4, line: 690, baseType: !229, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !339, file: !4, line: 692, baseType: !346, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !202}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !339, file: !4, line: 693, baseType: !350, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!266, !202}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !339, file: !4, line: 694, baseType: !346, size: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !204, file: !4, line: 266, baseType: !244, size: 32, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !204, file: !4, line: 267, baseType: !244, size: 32, offset: 352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "input_components", scope: !204, file: !4, line: 268, baseType: !228, size: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "in_color_space", scope: !204, file: !4, line: 269, baseType: !358, size: 32, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "input_gamma", scope: !204, file: !4, line: 271, baseType: !360, size: 64, offset: 448)
!360 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !204, file: !4, line: 281, baseType: !228, size: 32, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !204, file: !4, line: 283, baseType: !228, size: 32, offset: 544)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !204, file: !4, line: 284, baseType: !358, size: 32, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !204, file: !4, line: 286, baseType: !365, size: 64, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !398}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !367, file: !4, line: 120, baseType: !228, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !367, file: !4, line: 121, baseType: !228, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !367, file: !4, line: 122, baseType: !228, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !367, file: !4, line: 123, baseType: !228, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !367, file: !4, line: 124, baseType: !228, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !367, file: !4, line: 129, baseType: !228, size: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !367, file: !4, line: 130, baseType: !228, size: 32, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !367, file: !4, line: 139, baseType: !244, size: 32, offset: 224)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !367, file: !4, line: 140, baseType: !244, size: 32, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !367, file: !4, line: 147, baseType: !228, size: 32, offset: 288)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !367, file: !4, line: 154, baseType: !244, size: 32, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !367, file: !4, line: 155, baseType: !244, size: 32, offset: 352)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !367, file: !4, line: 160, baseType: !266, size: 32, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !367, file: !4, line: 164, baseType: !228, size: 32, offset: 416)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !367, file: !4, line: 165, baseType: !228, size: 32, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !367, file: !4, line: 166, baseType: !228, size: 32, offset: 480)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !367, file: !4, line: 167, baseType: !228, size: 32, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !367, file: !4, line: 168, baseType: !228, size: 32, offset: 544)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !367, file: !4, line: 169, baseType: !228, size: 32, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !367, file: !4, line: 175, baseType: !389, size: 64, offset: 640)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !392)
!392 = !{!393, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !391, file: !4, line: 88, baseType: !394, size: 1024)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 1024, elements: !257)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !242, line: 147, baseType: !396)
!396 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !391, file: !4, line: 94, baseType: !266, size: 32, offset: 1024)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !367, file: !4, line: 178, baseType: !227, size: 64, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !204, file: !4, line: 289, baseType: !400, size: 256, offset: 704)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 256, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 4)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !204, file: !4, line: 292, baseType: !404, size: 256, offset: 960)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 256, elements: !401)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !408)
!408 = !{!409, !414, !418}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !407, file: !4, line: 102, baseType: !410, size: 136)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 136, elements: !412)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !242, line: 135, baseType: !243)
!412 = !{!413}
!413 = !DISubrange(count: 17)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !407, file: !4, line: 104, baseType: !415, size: 2048, offset: 136)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 2048, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !407, file: !4, line: 110, baseType: !266, size: 32, offset: 2208)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !204, file: !4, line: 293, baseType: !404, size: 256, offset: 1216)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !204, file: !4, line: 296, baseType: !421, size: 128, offset: 1472)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 128, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 16)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !204, file: !4, line: 297, baseType: !421, size: 128, offset: 1600)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !204, file: !4, line: 298, baseType: !421, size: 128, offset: 1728)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "num_scans", scope: !204, file: !4, line: 300, baseType: !228, size: 32, offset: 1856)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "scan_info", scope: !204, file: !4, line: 301, baseType: !428, size: 64, offset: 1920)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_scan_info", file: !4, line: 189, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 184, size: 288, elements: !432)
!432 = !{!433, !434, !436, !437, !438, !439}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !431, file: !4, line: 185, baseType: !228, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !431, file: !4, line: 186, baseType: !435, size: 128, offset: 32)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 128, elements: !401)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !431, file: !4, line: 187, baseType: !228, size: 32, offset: 160)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !431, file: !4, line: 187, baseType: !228, size: 32, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !431, file: !4, line: 188, baseType: !228, size: 32, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !431, file: !4, line: 188, baseType: !228, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_in", scope: !204, file: !4, line: 307, baseType: !266, size: 32, offset: 1984)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !204, file: !4, line: 308, baseType: !266, size: 32, offset: 2016)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_coding", scope: !204, file: !4, line: 309, baseType: !266, size: 32, offset: 2048)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !204, file: !4, line: 310, baseType: !266, size: 32, offset: 2080)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "smoothing_factor", scope: !204, file: !4, line: 311, baseType: !228, size: 32, offset: 2112)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !204, file: !4, line: 312, baseType: !446, size: 32, offset: 2144)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !204, file: !4, line: 319, baseType: !5, size: 32, offset: 2176)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "restart_in_rows", scope: !204, file: !4, line: 320, baseType: !228, size: 32, offset: 2208)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "write_JFIF_header", scope: !204, file: !4, line: 324, baseType: !266, size: 32, offset: 2240)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !204, file: !4, line: 329, baseType: !411, size: 8, offset: 2272)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !204, file: !4, line: 330, baseType: !395, size: 16, offset: 2288)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !204, file: !4, line: 331, baseType: !395, size: 16, offset: 2304)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "write_Adobe_marker", scope: !204, file: !4, line: 332, baseType: !266, size: 32, offset: 2336)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "next_scanline", scope: !204, file: !4, line: 339, baseType: !244, size: 32, offset: 2368)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !204, file: !4, line: 348, baseType: !266, size: 32, offset: 2400)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !204, file: !4, line: 349, baseType: !228, size: 32, offset: 2432)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !204, file: !4, line: 350, baseType: !228, size: 32, offset: 2464)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !204, file: !4, line: 352, baseType: !244, size: 32, offset: 2496)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !204, file: !4, line: 363, baseType: !228, size: 32, offset: 2528)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !204, file: !4, line: 364, baseType: !461, size: 256, offset: 2560)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 256, elements: !401)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !204, file: !4, line: 367, baseType: !244, size: 32, offset: 2816)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !204, file: !4, line: 368, baseType: !244, size: 32, offset: 2848)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !204, file: !4, line: 370, baseType: !228, size: 32, offset: 2880)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !204, file: !4, line: 371, baseType: !466, size: 320, offset: 2912)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 320, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 10)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !204, file: !4, line: 375, baseType: !228, size: 32, offset: 3232)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !204, file: !4, line: 375, baseType: !228, size: 32, offset: 3264)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !204, file: !4, line: 375, baseType: !228, size: 32, offset: 3296)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !204, file: !4, line: 375, baseType: !228, size: 32, offset: 3328)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !204, file: !4, line: 380, baseType: !474, size: 64, offset: 3392)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_comp_master", file: !4, line: 380, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !204, file: !4, line: 381, baseType: !477, size: 64, offset: 3456)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_main_controller", file: !4, line: 381, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "prep", scope: !204, file: !4, line: 382, baseType: !480, size: 64, offset: 3520)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_prep_controller", file: !4, line: 382, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !204, file: !4, line: 383, baseType: !483, size: 64, offset: 3584)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_coef_controller", file: !4, line: 383, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !204, file: !4, line: 384, baseType: !486, size: 64, offset: 3648)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_writer", file: !4, line: 384, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !204, file: !4, line: 385, baseType: !489, size: 64, offset: 3712)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_converter", file: !4, line: 385, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !204, file: !4, line: 386, baseType: !492, size: 64, offset: 3776)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_downsampler", file: !4, line: 386, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !204, file: !4, line: 387, baseType: !495, size: 64, offset: 3840)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_forward_dct", file: !4, line: 387, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !204, file: !4, line: 388, baseType: !498, size: 64, offset: 3904)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_encoder", file: !4, line: 388, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_source_ptr", file: !196, line: 24, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "get_pixel_rows", scope: !195, file: !196, line: 29, baseType: !503, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!244, !202, !500}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input", scope: !195, file: !196, line: 31, baseType: !199, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "input_file", scope: !195, file: !196, line: 34, baseType: !508, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !510, line: 7, baseType: !511)
!510 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !512, line: 49, size: 1728, elements: !513)
!512 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !529, !531, !532, !533, !536, !537, !539, !543, !546, !548, !551, !554, !555, !556, !557, !558}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !511, file: !512, line: 51, baseType: !228, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !511, file: !512, line: 54, baseType: !307, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !511, file: !512, line: 55, baseType: !307, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !511, file: !512, line: 56, baseType: !307, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !511, file: !512, line: 57, baseType: !307, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !511, file: !512, line: 58, baseType: !307, size: 64, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !511, file: !512, line: 59, baseType: !307, size: 64, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !511, file: !512, line: 60, baseType: !307, size: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !511, file: !512, line: 61, baseType: !307, size: 64, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !511, file: !512, line: 64, baseType: !307, size: 64, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !511, file: !512, line: 65, baseType: !307, size: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !511, file: !512, line: 66, baseType: !307, size: 64, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !511, file: !512, line: 68, baseType: !527, size: 64, offset: 768)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !512, line: 36, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !511, file: !512, line: 70, baseType: !530, size: 64, offset: 832)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !511, file: !512, line: 72, baseType: !228, size: 32, offset: 896)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !511, file: !512, line: 73, baseType: !228, size: 32, offset: 928)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !511, file: !512, line: 74, baseType: !534, size: 64, offset: 960)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !535, line: 152, baseType: !289)
!535 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !511, file: !512, line: 77, baseType: !396, size: 16, offset: 1024)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !511, file: !512, line: 78, baseType: !538, size: 8, offset: 1040)
!538 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !511, file: !512, line: 79, baseType: !540, size: 8, offset: 1048)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 8, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 1)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !511, file: !512, line: 81, baseType: !544, size: 64, offset: 1088)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !512, line: 43, baseType: null)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !511, file: !512, line: 89, baseType: !547, size: 64, offset: 1152)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !535, line: 153, baseType: !289)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !511, file: !512, line: 91, baseType: !549, size: 64, offset: 1216)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !512, line: 37, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !511, file: !512, line: 92, baseType: !552, size: 64, offset: 1280)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !512, line: 38, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !511, file: !512, line: 93, baseType: !530, size: 64, offset: 1344)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !511, file: !512, line: 94, baseType: !227, size: 64, offset: 1408)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !511, file: !512, line: 95, baseType: !229, size: 64, offset: 1472)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !511, file: !512, line: 96, baseType: !228, size: 32, offset: 1536)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !511, file: !512, line: 98, baseType: !559, size: 160, offset: 1568)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 160, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 20)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !195, file: !196, line: 36, baseType: !237, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_height", scope: !195, file: !196, line: 37, baseType: !244, size: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "cinfo", scope: !192, file: !1, line: 55, baseType: !202, size: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !192, file: !1, line: 57, baseType: !237, size: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "whole_image", scope: !192, file: !1, line: 59, baseType: !263, size: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "source_row", scope: !192, file: !1, line: 60, baseType: !244, size: 32, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "row_width", scope: !192, file: !1, line: 61, baseType: !244, size: 32, offset: 608)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !192, file: !1, line: 63, baseType: !228, size: 32, offset: 640)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !242, line: 161, baseType: !289)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "cd_progress_ptr", file: !196, line: 89, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cdjpeg_progress_mgr", file: !196, line: 81, size: 384, elements: !574)
!574 = !{!575, !576, !577, !578}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !573, file: !196, line: 82, baseType: !292, size: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "completed_extra_passes", scope: !573, file: !196, line: 83, baseType: !228, size: 32, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "total_extra_passes", scope: !573, file: !196, line: 84, baseType: !228, size: 32, offset: 288)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "percent_done", scope: !573, file: !196, line: 86, baseType: !228, size: 32, offset: 320)
!579 = !{i32 7, !"Dwarf Version", i32 5}
!580 = !{i32 2, !"Debug Info Version", i32 3}
!581 = !{i32 1, !"wchar_size", i32 4}
!582 = !{i32 8, !"PIC Level", i32 2}
!583 = !{i32 7, !"PIE Level", i32 2}
!584 = !{i32 7, !"uwtable", i32 2}
!585 = !{i32 7, !"frame-pointer", i32 2}
!586 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!587 = distinct !DISubprogram(name: "jinit_read_bmp", scope: !1, file: !1, line: 423, type: !588, scopeLine: 424, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !590)
!588 = !DISubroutineType(types: !589)
!589 = !{!500, !202}
!590 = !{}
!591 = !DILocalVariable(name: "cinfo", arg: 1, scope: !587, file: !1, line: 423, type: !202)
!592 = !DILocation(line: 423, column: 32, scope: !587)
!593 = !DILocalVariable(name: "source", scope: !587, file: !1, line: 425, type: !190)
!594 = !DILocation(line: 425, column: 18, scope: !587)
!595 = !DILocation(line: 429, column: 9, scope: !587)
!596 = !DILocation(line: 429, column: 16, scope: !587)
!597 = !DILocation(line: 429, column: 21, scope: !587)
!598 = !DILocation(line: 429, column: 50, scope: !587)
!599 = !DILocation(line: 429, column: 7, scope: !587)
!600 = !DILocation(line: 428, column: 10, scope: !587)
!601 = !DILocation(line: 431, column: 19, scope: !587)
!602 = !DILocation(line: 431, column: 3, scope: !587)
!603 = !DILocation(line: 431, column: 11, scope: !587)
!604 = !DILocation(line: 431, column: 17, scope: !587)
!605 = !DILocation(line: 433, column: 3, scope: !587)
!606 = !DILocation(line: 433, column: 11, scope: !587)
!607 = !DILocation(line: 433, column: 15, scope: !587)
!608 = !DILocation(line: 433, column: 27, scope: !587)
!609 = !DILocation(line: 434, column: 3, scope: !587)
!610 = !DILocation(line: 434, column: 11, scope: !587)
!611 = !DILocation(line: 434, column: 15, scope: !587)
!612 = !DILocation(line: 434, column: 28, scope: !587)
!613 = !DILocation(line: 436, column: 29, scope: !587)
!614 = !DILocation(line: 436, column: 3, scope: !587)
!615 = distinct !DISubprogram(name: "start_input_bmp", scope: !1, file: !1, line: 241, type: !200, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !590)
!616 = !DILocalVariable(name: "cinfo", arg: 1, scope: !615, file: !1, line: 241, type: !202)
!617 = !DILocation(line: 241, column: 33, scope: !615)
!618 = !DILocalVariable(name: "sinfo", arg: 2, scope: !615, file: !1, line: 241, type: !500)
!619 = !DILocation(line: 241, column: 57, scope: !615)
!620 = !DILocalVariable(name: "source", scope: !615, file: !1, line: 243, type: !190)
!621 = !DILocation(line: 243, column: 18, scope: !615)
!622 = !DILocation(line: 243, column: 44, scope: !615)
!623 = !DILocalVariable(name: "bmpfileheader", scope: !615, file: !1, line: 244, type: !624)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 112, elements: !626)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "U_CHAR", file: !1, line: 32, baseType: !243)
!626 = !{!627}
!627 = !DISubrange(count: 14)
!628 = !DILocation(line: 244, column: 10, scope: !615)
!629 = !DILocalVariable(name: "bmpinfoheader", scope: !615, file: !1, line: 245, type: !630)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 512, elements: !257)
!631 = !DILocation(line: 245, column: 10, scope: !615)
!632 = !DILocalVariable(name: "bfOffBits", scope: !615, file: !1, line: 252, type: !570)
!633 = !DILocation(line: 252, column: 9, scope: !615)
!634 = !DILocalVariable(name: "headerSize", scope: !615, file: !1, line: 253, type: !570)
!635 = !DILocation(line: 253, column: 9, scope: !615)
!636 = !DILocalVariable(name: "biWidth", scope: !615, file: !1, line: 254, type: !570)
!637 = !DILocation(line: 254, column: 9, scope: !615)
