; ModuleID = 'cBench/consumer_jpeg_c/src/rdppm.c'
source_filename = "cBench/consumer_jpeg_c/src/rdppm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_compress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, double, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], [16 x i8], [16 x i8], [16 x i8], i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.ppm_source_struct = type { %struct.cjpeg_source_struct, ptr, ptr, i64, ptr }
%struct.cjpeg_source_struct = type { ptr, ptr, ptr, ptr, ptr, i32 }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }

; Function Attrs: noinline nounwind uwtable
define dso_local ptr @jinit_read_ppm(ptr noundef %0) #0 !dbg !580 {
  %2 = alloca ptr, align 8
  %3 = alloca ptr, align 8
  store ptr %0, ptr %2, align 8
    #dbg_declare(ptr %2, !584, !DIExpression(), !585)
    #dbg_declare(ptr %3, !586, !DIExpression(), !587)
  %4 = load ptr, ptr %2, align 8, !dbg !588
  %5 = getelementptr inbounds nuw %struct.jpeg_compress_struct, ptr %4, i32 0, i32 1, !dbg !589

!138 = !DIEnumerator(name: "JERR_XMS_READ", value: 70)
!139 = !DIEnumerator(name: "JERR_XMS_WRITE", value: 71)
!140 = !DIEnumerator(name: "JMSG_COPYRIGHT", value: 72)
!141 = !DIEnumerator(name: "JMSG_VERSION", value: 73)
!142 = !DIEnumerator(name: "JTRC_16BIT_TABLES", value: 74)
!143 = !DIEnumerator(name: "JTRC_ADOBE", value: 75)
!144 = !DIEnumerator(name: "JTRC_APP0", value: 76)
!145 = !DIEnumerator(name: "JTRC_APP14", value: 77)
!146 = !DIEnumerator(name: "JTRC_DAC", value: 78)
!147 = !DIEnumerator(name: "JTRC_DHT", value: 79)
!148 = !DIEnumerator(name: "JTRC_DQT", value: 80)
!149 = !DIEnumerator(name: "JTRC_DRI", value: 81)
!150 = !DIEnumerator(name: "JTRC_EMS_CLOSE", value: 82)
!151 = !DIEnumerator(name: "JTRC_EMS_OPEN", value: 83)
!152 = !DIEnumerator(name: "JTRC_EOI", value: 84)
!153 = !DIEnumerator(name: "JTRC_HUFFBITS", value: 85)
!154 = !DIEnumerator(name: "JTRC_JFIF", value: 86)
!155 = !DIEnumerator(name: "JTRC_JFIF_BADTHUMBNAILSIZE", value: 87)
!156 = !DIEnumerator(name: "JTRC_JFIF_MINOR", value: 88)
!157 = !DIEnumerator(name: "JTRC_JFIF_THUMBNAIL", value: 89)
!158 = !DIEnumerator(name: "JTRC_MISC_MARKER", value: 90)
!159 = !DIEnumerator(name: "JTRC_PARMLESS_MARKER", value: 91)
!160 = !DIEnumerator(name: "JTRC_QUANTVALS", value: 92)
!161 = !DIEnumerator(name: "JTRC_QUANT_3_NCOLORS", value: 93)
!162 = !DIEnumerator(name: "JTRC_QUANT_NCOLORS", value: 94)
!163 = !DIEnumerator(name: "JTRC_QUANT_SELECTED", value: 95)
!164 = !DIEnumerator(name: "JTRC_RECOVERY_ACTION", value: 96)
!165 = !DIEnumerator(name: "JTRC_RST", value: 97)
!166 = !DIEnumerator(name: "JTRC_SMOOTH_NOTIMPL", value: 98)
!167 = !DIEnumerator(name: "JTRC_SOF", value: 99)
!168 = !DIEnumerator(name: "JTRC_SOF_COMPONENT", value: 100)
!169 = !DIEnumerator(name: "JTRC_SOI", value: 101)
!170 = !DIEnumerator(name: "JTRC_SOS", value: 102)
!171 = !DIEnumerator(name: "JTRC_SOS_COMPONENT", value: 103)
!172 = !DIEnumerator(name: "JTRC_SOS_PARAMS", value: 104)
!173 = !DIEnumerator(name: "JTRC_TFILE_CLOSE", value: 105)
!174 = !DIEnumerator(name: "JTRC_TFILE_OPEN", value: 106)
!175 = !DIEnumerator(name: "JTRC_UNKNOWN_IDS", value: 107)
!176 = !DIEnumerator(name: "JTRC_XMS_CLOSE", value: 108)
!177 = !DIEnumerator(name: "JTRC_XMS_OPEN", value: 109)
!178 = !DIEnumerator(name: "JWRN_ADOBE_XFORM", value: 110)
!179 = !DIEnumerator(name: "JWRN_BOGUS_PROGRESSION", value: 111)
!180 = !DIEnumerator(name: "JWRN_EXTRANEOUS_DATA", value: 112)
!181 = !DIEnumerator(name: "JWRN_HIT_MARKER", value: 113)
!182 = !DIEnumerator(name: "JWRN_HUFF_BAD_CODE", value: 114)
!183 = !DIEnumerator(name: "JWRN_JFIF_MAJOR", value: 115)
!184 = !DIEnumerator(name: "JWRN_JPEG_EOF", value: 116)
!185 = !DIEnumerator(name: "JWRN_MUST_RESYNC", value: 117)
!186 = !DIEnumerator(name: "JWRN_NOT_SEQUENTIAL", value: 118)
!187 = !DIEnumerator(name: "JWRN_TOO_MUCH_DATA", value: 119)
!188 = !DIEnumerator(name: "JMSG_LASTMSGCODE", value: 120)
!189 = !{!190, !215, !230, !501, !245, !566, !240, !241, !290, !571, !242, !228, !229}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ppm_source_ptr", file: !1, line: 80, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ppm_source_struct", file: !1, line: 78, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 71, size: 640, elements: !194)
!194 = !{!195, !565, !568, !569, !570}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !193, file: !1, line: 72, baseType: !196, size: 384)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_source_struct", file: !197, line: 26, size: 384, elements: !198)
!197 = !DIFile(filename: "cBench/consumer_jpeg_c/src/cdjpeg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "bced6b83fac9f9ba4577dcff987736ac")
!198 = !{!199, !503, !507, !508, !563, !564}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "start_input", scope: !196, file: !197, line: 27, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !203, !501}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_compress_ptr", file: !4, line: 249, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !4, line: 255, size: 3968, elements: !206)
!206 = !{!207, !334, !335, !336, !337, !338, !355, !356, !357, !358, !360, !362, !363, !364, !365, !400, !404, !420, !421, !425, !426, !427, !428, !441, !442, !443, !444, !445, !446, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !463, !464, !465, !466, !470, !471, !472, !473, !474, !477, !480, !483, !486, !489, !492, !495, !498}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !205, file: !4, line: 256, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !4, line: 618, size: 1344, elements: !210)
!210 = !{!211, !302, !303, !304, !310, !311, !312, !323, !324, !325, !330, !331, !332, !333}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !209, file: !4, line: 620, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !4, line: 248, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !4, line: 240, size: 256, elements: !218)
!218 = !{!219, !220, !291, !300, !301}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !217, file: !4, line: 241, baseType: !208, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !217, file: !4, line: 241, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !4, line: 731, size: 768, elements: !223)
!223 = !{!224, !233, !234, !246, !260, !268, !275, !276, !280, !284, !288, !289}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !222, file: !4, line: 733, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !215, !229, !230}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!229 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !231, line: 18, baseType: !232)
!231 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!232 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !222, file: !4, line: 735, baseType: !225, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !222, file: !4, line: 737, baseType: !235, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!238, !215, !229, !245, !245}
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !4, line: 67, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !4, line: 66, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !243, line: 59, baseType: !244)
!243 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!244 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !243, line: 171, baseType: !5)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !222, file: !4, line: 740, baseType: !247, size: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !215, !229, !245, !245}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !4, line: 72, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !4, line: 71, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !4, line: 70, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 1024, elements: !258)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !243, line: 99, baseType: !257)
!257 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!258 = !{!259}
!259 = !DISubrange(count: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !222, file: !4, line: 743, baseType: !261, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !215, !229, !267, !245, !245, !245}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !4, line: 727, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !4, line: 727, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !243, line: 227, baseType: !229)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !222, file: !4, line: 749, baseType: !269, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!272, !215, !229, !267, !245, !245, !245}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !4, line: 728, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !4, line: 728, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !222, file: !4, line: 755, baseType: !212, size: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !222, file: !4, line: 756, baseType: !277, size: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!238, !215, !264, !245, !245, !267}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !222, file: !4, line: 761, baseType: !281, size: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!250, !215, !272, !245, !245, !267}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !222, file: !4, line: 766, baseType: !285, size: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !215, !229}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !222, file: !4, line: 767, baseType: !212, size: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !222, file: !4, line: 774, baseType: !290, size: 64, offset: 704)
!290 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !217, file: !4, line: 241, baseType: !292, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !4, line: 676, size: 256, elements: !294)
!294 = !{!295, !296, !297, !298, !299}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !293, file: !4, line: 677, baseType: !212, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !293, file: !4, line: 679, baseType: !290, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !293, file: !4, line: 680, baseType: !290, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !293, file: !4, line: 681, baseType: !229, size: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !293, file: !4, line: 682, baseType: !229, size: 32, offset: 224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !217, file: !4, line: 241, baseType: !267, size: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !217, file: !4, line: 241, baseType: !229, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !209, file: !4, line: 622, baseType: !285, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !209, file: !4, line: 624, baseType: !212, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !209, file: !4, line: 626, baseType: !305, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !215, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !209, file: !4, line: 629, baseType: !212, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !209, file: !4, line: 634, baseType: !229, size: 32, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !209, file: !4, line: 639, baseType: !313, size: 640, offset: 352)
!313 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !209, file: !4, line: 636, size: 640, elements: !314)
!314 = !{!315, !319}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !313, file: !4, line: 637, baseType: !316, size: 256)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 256, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !313, file: !4, line: 638, baseType: !320, size: 640)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 640, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 80)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !209, file: !4, line: 643, baseType: !229, size: 32, offset: 992)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !209, file: !4, line: 651, baseType: !290, size: 64, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !209, file: !4, line: 663, baseType: !326, size: 64, offset: 1088)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !209, file: !4, line: 664, baseType: !229, size: 32, offset: 1152)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !209, file: !4, line: 668, baseType: !326, size: 64, offset: 1216)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !209, file: !4, line: 669, baseType: !229, size: 32, offset: 1280)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !209, file: !4, line: 670, baseType: !229, size: 32, offset: 1312)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !205, file: !4, line: 256, baseType: !221, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !205, file: !4, line: 256, baseType: !292, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !205, file: !4, line: 256, baseType: !267, size: 32, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !205, file: !4, line: 256, baseType: !229, size: 32, offset: 224)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !205, file: !4, line: 259, baseType: !339, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !4, line: 688, size: 320, elements: !341)
!341 = !{!342, !345, !346, !350, !354}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !340, file: !4, line: 689, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !243, line: 110, baseType: !244)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !340, file: !4, line: 690, baseType: !230, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !340, file: !4, line: 692, baseType: !347, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !203}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !340, file: !4, line: 693, baseType: !351, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!267, !203}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !340, file: !4, line: 694, baseType: !347, size: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !205, file: !4, line: 266, baseType: !245, size: 32, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !205, file: !4, line: 267, baseType: !245, size: 32, offset: 352)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "input_components", scope: !205, file: !4, line: 268, baseType: !229, size: 32, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "in_color_space", scope: !205, file: !4, line: 269, baseType: !359, size: 32, offset: 416)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !4, line: 201, baseType: !3)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "input_gamma", scope: !205, file: !4, line: 271, baseType: !361, size: 64, offset: 448)
!361 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !205, file: !4, line: 281, baseType: !229, size: 32, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !205, file: !4, line: 283, baseType: !229, size: 32, offset: 544)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !205, file: !4, line: 284, baseType: !359, size: 32, offset: 576)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !205, file: !4, line: 286, baseType: !366, size: 64, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !4, line: 179, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 116, size: 768, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !399}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !368, file: !4, line: 120, baseType: !229, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !368, file: !4, line: 121, baseType: !229, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !368, file: !4, line: 122, baseType: !229, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !368, file: !4, line: 123, baseType: !229, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !368, file: !4, line: 124, baseType: !229, size: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !368, file: !4, line: 129, baseType: !229, size: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !368, file: !4, line: 130, baseType: !229, size: 32, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !368, file: !4, line: 139, baseType: !245, size: 32, offset: 224)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !368, file: !4, line: 140, baseType: !245, size: 32, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !368, file: !4, line: 147, baseType: !229, size: 32, offset: 288)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !368, file: !4, line: 154, baseType: !245, size: 32, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !368, file: !4, line: 155, baseType: !245, size: 32, offset: 352)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !368, file: !4, line: 160, baseType: !267, size: 32, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !368, file: !4, line: 164, baseType: !229, size: 32, offset: 416)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !368, file: !4, line: 165, baseType: !229, size: 32, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !368, file: !4, line: 166, baseType: !229, size: 32, offset: 480)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !368, file: !4, line: 167, baseType: !229, size: 32, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !368, file: !4, line: 168, baseType: !229, size: 32, offset: 544)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !368, file: !4, line: 169, baseType: !229, size: 32, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !368, file: !4, line: 175, baseType: !390, size: 64, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !4, line: 95, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 83, size: 1056, elements: !393)
!393 = !{!394, !398}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !392, file: !4, line: 88, baseType: !395, size: 1024)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 1024, elements: !258)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !243, line: 147, baseType: !397)
!397 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !392, file: !4, line: 94, baseType: !267, size: 32, offset: 1024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !368, file: !4, line: 178, baseType: !228, size: 64, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !205, file: !4, line: 289, baseType: !401, size: 256, offset: 704)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 256, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 4)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !205, file: !4, line: 292, baseType: !405, size: 256, offset: 960)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 256, elements: !402)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !4, line: 111, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 100, size: 2240, elements: !409)
!409 = !{!410, !415, !419}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !408, file: !4, line: 102, baseType: !411, size: 136)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 136, elements: !413)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !243, line: 135, baseType: !244)
!413 = !{!414}
!414 = !DISubrange(count: 17)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !408, file: !4, line: 104, baseType: !416, size: 2048, offset: 136)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 2048, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !408, file: !4, line: 110, baseType: !267, size: 32, offset: 2208)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !205, file: !4, line: 293, baseType: !405, size: 256, offset: 1216)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !205, file: !4, line: 296, baseType: !422, size: 128, offset: 1472)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 128, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 16)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !205, file: !4, line: 297, baseType: !422, size: 128, offset: 1600)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !205, file: !4, line: 298, baseType: !422, size: 128, offset: 1728)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "num_scans", scope: !205, file: !4, line: 300, baseType: !229, size: 32, offset: 1856)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scan_info", scope: !205, file: !4, line: 301, baseType: !429, size: 64, offset: 1920)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_scan_info", file: !4, line: 189, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 184, size: 288, elements: !433)
!433 = !{!434, !435, !437, !438, !439, !440}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !432, file: !4, line: 185, baseType: !229, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !432, file: !4, line: 186, baseType: !436, size: 128, offset: 32)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 128, elements: !402)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !432, file: !4, line: 187, baseType: !229, size: 32, offset: 160)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !432, file: !4, line: 187, baseType: !229, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !432, file: !4, line: 188, baseType: !229, size: 32, offset: 224)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !432, file: !4, line: 188, baseType: !229, size: 32, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_in", scope: !205, file: !4, line: 307, baseType: !267, size: 32, offset: 1984)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !205, file: !4, line: 308, baseType: !267, size: 32, offset: 2016)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_coding", scope: !205, file: !4, line: 309, baseType: !267, size: 32, offset: 2048)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !205, file: !4, line: 310, baseType: !267, size: 32, offset: 2080)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "smoothing_factor", scope: !205, file: !4, line: 311, baseType: !229, size: 32, offset: 2112)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !205, file: !4, line: 312, baseType: !447, size: 32, offset: 2144)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !4, line: 209, baseType: !13)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !205, file: !4, line: 319, baseType: !5, size: 32, offset: 2176)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "restart_in_rows", scope: !205, file: !4, line: 320, baseType: !229, size: 32, offset: 2208)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "write_JFIF_header", scope: !205, file: !4, line: 324, baseType: !267, size: 32, offset: 2240)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !205, file: !4, line: 329, baseType: !412, size: 8, offset: 2272)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !205, file: !4, line: 330, baseType: !396, size: 16, offset: 2288)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !205, file: !4, line: 331, baseType: !396, size: 16, offset: 2304)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "write_Adobe_marker", scope: !205, file: !4, line: 332, baseType: !267, size: 32, offset: 2336)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next_scanline", scope: !205, file: !4, line: 339, baseType: !245, size: 32, offset: 2368)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !205, file: !4, line: 348, baseType: !267, size: 32, offset: 2400)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !205, file: !4, line: 349, baseType: !229, size: 32, offset: 2432)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !205, file: !4, line: 350, baseType: !229, size: 32, offset: 2464)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !205, file: !4, line: 352, baseType: !245, size: 32, offset: 2496)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !205, file: !4, line: 363, baseType: !229, size: 32, offset: 2528)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !205, file: !4, line: 364, baseType: !462, size: 256, offset: 2560)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 256, elements: !402)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !205, file: !4, line: 367, baseType: !245, size: 32, offset: 2816)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !205, file: !4, line: 368, baseType: !245, size: 32, offset: 2848)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !205, file: !4, line: 370, baseType: !229, size: 32, offset: 2880)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !205, file: !4, line: 371, baseType: !467, size: 320, offset: 2912)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 320, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 10)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !205, file: !4, line: 375, baseType: !229, size: 32, offset: 3232)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !205, file: !4, line: 375, baseType: !229, size: 32, offset: 3264)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !205, file: !4, line: 375, baseType: !229, size: 32, offset: 3296)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !205, file: !4, line: 375, baseType: !229, size: 32, offset: 3328)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !205, file: !4, line: 380, baseType: !475, size: 64, offset: 3392)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_comp_master", file: !4, line: 380, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !205, file: !4, line: 381, baseType: !478, size: 64, offset: 3456)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_main_controller", file: !4, line: 381, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "prep", scope: !205, file: !4, line: 382, baseType: !481, size: 64, offset: 3520)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_prep_controller", file: !4, line: 382, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !205, file: !4, line: 383, baseType: !484, size: 64, offset: 3584)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_coef_controller", file: !4, line: 383, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !205, file: !4, line: 384, baseType: !487, size: 64, offset: 3648)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_writer", file: !4, line: 384, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !205, file: !4, line: 385, baseType: !490, size: 64, offset: 3712)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_converter", file: !4, line: 385, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !205, file: !4, line: 386, baseType: !493, size: 64, offset: 3776)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_downsampler", file: !4, line: 386, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !205, file: !4, line: 387, baseType: !496, size: 64, offset: 3840)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_forward_dct", file: !4, line: 387, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !205, file: !4, line: 388, baseType: !499, size: 64, offset: 3904)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_encoder", file: !4, line: 388, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_source_ptr", file: !197, line: 24, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "get_pixel_rows", scope: !196, file: !197, line: 29, baseType: !504, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!245, !203, !501}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input", scope: !196, file: !197, line: 31, baseType: !200, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "input_file", scope: !196, file: !197, line: 34, baseType: !509, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !511, line: 7, baseType: !512)
!511 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !513, line: 49, size: 1728, elements: !514)
!513 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !530, !532, !533, !534, !537, !538, !540, !544, !547, !549, !552, !555, !556, !557, !558, !559}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !512, file: !513, line: 51, baseType: !229, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !512, file: !513, line: 54, baseType: !308, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !512, file: !513, line: 55, baseType: !308, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !512, file: !513, line: 56, baseType: !308, size: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !512, file: !513, line: 57, baseType: !308, size: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !512, file: !513, line: 58, baseType: !308, size: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !512, file: !513, line: 59, baseType: !308, size: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !512, file: !513, line: 60, baseType: !308, size: 64, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !512, file: !513, line: 61, baseType: !308, size: 64, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !512, file: !513, line: 64, baseType: !308, size: 64, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !512, file: !513, line: 65, baseType: !308, size: 64, offset: 640)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !512, file: !513, line: 66, baseType: !308, size: 64, offset: 704)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !512, file: !513, line: 68, baseType: !528, size: 64, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !513, line: 36, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !512, file: !513, line: 70, baseType: !531, size: 64, offset: 832)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !512, file: !513, line: 72, baseType: !229, size: 32, offset: 896)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !512, file: !513, line: 73, baseType: !229, size: 32, offset: 928)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !512, file: !513, line: 74, baseType: !535, size: 64, offset: 960)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !536, line: 152, baseType: !290)
!536 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !512, file: !513, line: 77, baseType: !397, size: 16, offset: 1024)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !512, file: !513, line: 78, baseType: !539, size: 8, offset: 1040)
!539 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !512, file: !513, line: 79, baseType: !541, size: 8, offset: 1048)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 8, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 1)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !512, file: !513, line: 81, baseType: !545, size: 64, offset: 1088)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !513, line: 43, baseType: null)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !512, file: !513, line: 89, baseType: !548, size: 64, offset: 1152)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !536, line: 153, baseType: !290)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !512, file: !513, line: 91, baseType: !550, size: 64, offset: 1216)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !513, line: 37, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !512, file: !513, line: 92, baseType: !553, size: 64, offset: 1280)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !513, line: 38, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !512, file: !513, line: 93, baseType: !531, size: 64, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !512, file: !513, line: 94, baseType: !228, size: 64, offset: 1408)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !512, file: !513, line: 95, baseType: !230, size: 64, offset: 1472)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !512, file: !513, line: 96, baseType: !229, size: 32, offset: 1536)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !512, file: !513, line: 98, baseType: !560, size: 160, offset: 1568)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 160, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 20)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !196, file: !197, line: 36, baseType: !238, size: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_height", scope: !196, file: !197, line: 37, baseType: !245, size: 32, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "iobuffer", scope: !193, file: !1, line: 74, baseType: !566, size: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "U_CHAR", file: !1, line: 42, baseType: !244)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pixrow", scope: !193, file: !1, line: 75, baseType: !240, size: 64, offset: 448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_width", scope: !193, file: !1, line: 76, baseType: !230, size: 64, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rescale", scope: !193, file: !1, line: 77, baseType: !241, size: 64, offset: 576)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !243, line: 161, baseType: !290)
!572 = !{i32 7, !"Dwarf Version", i32 5}
!573 = !{i32 2, !"Debug Info Version", i32 3}
!574 = !{i32 1, !"wchar_size", i32 4}
!575 = !{i32 8, !"PIC Level", i32 2}
!576 = !{i32 7, !"PIE Level", i32 2}
!577 = !{i32 7, !"uwtable", i32 2}
!578 = !{i32 7, !"frame-pointer", i32 2}
!579 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!580 = distinct !DISubprogram(name: "jinit_read_ppm", scope: !1, file: !1, line: 435, type: !581, scopeLine: 436, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !583)
!581 = !DISubroutineType(types: !582)
!582 = !{!501, !203}
!583 = !{}
!584 = !DILocalVariable(name: "cinfo", arg: 1, scope: !580, file: !1, line: 435, type: !203)
!585 = !DILocation(line: 435, column: 32, scope: !580)
!586 = !DILocalVariable(name: "source", scope: !580, file: !1, line: 437, type: !190)
!587 = !DILocation(line: 437, column: 18, scope: !580)
!588 = !DILocation(line: 441, column: 9, scope: !580)
!589 = !DILocation(line: 441, column: 16, scope: !580)
!590 = !DILocation(line: 441, column: 21, scope: !580)
!591 = !DILocation(line: 441, column: 50, scope: !580)
!592 = !DILocation(line: 441, column: 7, scope: !580)
!593 = !DILocation(line: 440, column: 10, scope: !580)
!594 = !DILocation(line: 444, column: 3, scope: !580)
!595 = !DILocation(line: 444, column: 11, scope: !580)
!596 = !DILocation(line: 444, column: 15, scope: !580)
!597 = !DILocation(line: 444, column: 27, scope: !580)
!598 = !DILocation(line: 445, column: 3, scope: !580)
!599 = !DILocation(line: 445, column: 11, scope: !580)
!600 = !DILocation(line: 445, column: 15, scope: !580)
!601 = !DILocation(line: 445, column: 28, scope: !580)
!602 = !DILocation(line: 447, column: 29, scope: !580)
!603 = !DILocation(line: 447, column: 3, scope: !580)
!604 = distinct !DISubprogram(name: "start_input_ppm", scope: !1, file: !1, line: 296, type: !201, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !583)
!605 = !DILocalVariable(name: "cinfo", arg: 1, scope: !604, file: !1, line: 296, type: !203)
!606 = !DILocation(line: 296, column: 33, scope: !604)
!607 = !DILocalVariable(name: "sinfo", arg: 2, scope: !604, file: !1, line: 296, type: !501)
!608 = !DILocation(line: 296, column: 57, scope: !604)
!609 = !DILocalVariable(name: "source", scope: !604, file: !1, line: 298, type: !190)
!610 = !DILocation(line: 298, column: 18, scope: !604)
!611 = !DILocation(line: 298, column: 44, scope: !604)
!612 = !DILocalVariable(name: "c", scope: !604, file: !1, line: 299, type: !229)
!613 = !DILocation(line: 299, column: 7, scope: !604)
!614 = !DILocalVariable(name: "w", scope: !604, file: !1, line: 300, type: !5)
!615 = !DILocation(line: 300, column: 16, scope: !604)
!616 = !DILocalVariable(name: "h", scope: !604, file: !1, line: 300, type: !5)
!617 = !DILocation(line: 300, column: 19, scope: !604)
!618 = !DILocalVariable(name: "maxval", scope: !604, file: !1, line: 300, type: !5)
!619 = !DILocation(line: 300, column: 22, scope: !604)
!620 = !DILocalVariable(name: "need_iobuffer", scope: !604, file: !1, line: 301, type: !267)
!621 = !DILocation(line: 301, column: 11, scope: !604)
!622 = !DILocalVariable(name: "use_raw_buffer", scope: !604, file: !1, line: 301, type: !267)
!623 = !DILocation(line: 301, column: 26, scope: !604)
!624 = !DILocalVariable(name: "need_rescale", scope: !604, file: !1, line: 301, type: !267)
!625 = !DILocation(line: 301, column: 42, scope: !604)
!626 = !DILocation(line: 303, column: 12, scope: !627)
!627 = distinct !DILexicalBlock(scope: !604, file: !1, line: 303, column: 7)
!628 = !DILocation(line: 303, column: 20, scope: !627)
!629 = !DILocation(line: 303, column: 24, scope: !627)
