; ModuleID = 'cBench/consumer_jpeg_c/src/rdswitch.c'
source_filename = "cBench/consumer_jpeg_c/src/rdswitch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_scan_info = type { i32, [4 x i32], i32, i32, i32, i32 }
%struct.jpeg_compress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, double, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], [16 x i8], [16 x i8], [16 x i8], i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct.jpeg_component_info = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1, !dbg !0
@stderr = external global ptr, align 8
@.str.1 = private unnamed_addr constant [26 x i8] c"Can't open table file %s\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [28 x i8] c"Too many tables in file %s\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [31 x i8] c"Invalid table data in file %s\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [29 x i8] c"Non-numeric data in file %s\0A\00", align 1, !dbg !22

!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 28)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 31)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 116, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 29)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 36)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 35)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !2, line: 199, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 44)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 38)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !2, line: 279, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 5)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 45)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(scope: null, file: !2, line: 313, type: !59, isLocal: true, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 9)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(scope: null, file: !2, line: 318, type: !29, isLocal: true, isDefinition: true)
!64 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !65, retainedTypes: !96, globals: !238, splitDebugInlining: false, nameTableKind: None)
!65 = !{!66, !76, !81}
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 194, baseType: !68, size: 32, elements: !69)
!67 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jpeglib.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "2a2b23235fe587b10147d741e3371e67")
!68 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!69 = !{!70, !71, !72, !73, !74, !75}
!70 = !DIEnumerator(name: "JCS_UNKNOWN", value: 0)
!71 = !DIEnumerator(name: "JCS_GRAYSCALE", value: 1)
!72 = !DIEnumerator(name: "JCS_RGB", value: 2)
!73 = !DIEnumerator(name: "JCS_YCbCr", value: 3)
!74 = !DIEnumerator(name: "JCS_CMYK", value: 4)
!75 = !DIEnumerator(name: "JCS_YCCK", value: 5)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 205, baseType: !68, size: 32, elements: !77)
!77 = !{!78, !79, !80}
!78 = !DIEnumerator(name: "JDCT_ISLOW", value: 0)
!79 = !DIEnumerator(name: "JDCT_IFAST", value: 1)
!80 = !DIEnumerator(name: "JDCT_FLOAT", value: 2)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 46, baseType: !68, size: 32, elements: !83)
!82 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!84 = !DIEnumerator(name: "_ISupper", value: 256)
!85 = !DIEnumerator(name: "_ISlower", value: 512)
!86 = !DIEnumerator(name: "_ISalpha", value: 1024)
!87 = !DIEnumerator(name: "_ISdigit", value: 2048)
!88 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!89 = !DIEnumerator(name: "_ISspace", value: 8192)
!90 = !DIEnumerator(name: "_ISprint", value: 16384)
!91 = !DIEnumerator(name: "_ISgraph", value: 32768)
!92 = !DIEnumerator(name: "_ISblank", value: 1)
!93 = !DIEnumerator(name: "_IScntrl", value: 2)
!94 = !DIEnumerator(name: "_ISpunct", value: 4)
!95 = !DIEnumerator(name: "_ISalnum", value: 8)
!96 = !{!97, !68, !98, !99, !112, !167, !235, !237}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_scan_info", file: !67, line: 189, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 184, size: 288, elements: !102)
!102 = !{!103, !104, !108, !109, !110, !111}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !101, file: !67, line: 185, baseType: !98, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !101, file: !67, line: 186, baseType: !105, size: 128, offset: 32)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 4)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !101, file: !67, line: 187, baseType: !98, size: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !101, file: !67, line: 187, baseType: !98, size: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !101, file: !67, line: 188, baseType: !98, size: 32, offset: 224)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !101, file: !67, line: 188, baseType: !98, size: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !67, line: 248, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !67, line: 240, size: 256, elements: !115)
!115 = !{!116, !159, !224, !233, !234}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !114, file: !67, line: 241, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !67, line: 618, size: 1344, elements: !119)
!119 = !{!120, !124, !128, !129, !134, !135, !136, !147, !148, !150, !155, !156, !157, !158}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !118, file: !67, line: 620, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !112}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !118, file: !67, line: 622, baseType: !125, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !112, !98}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !118, file: !67, line: 624, baseType: !121, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !118, file: !67, line: 626, baseType: !130, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !112, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !118, file: !67, line: 629, baseType: !121, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !118, file: !67, line: 634, baseType: !98, size: 32, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !118, file: !67, line: 639, baseType: !137, size: 640, offset: 352)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !67, line: 636, size: 640, elements: !138)
!138 = !{!139, !143}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !137, file: !67, line: 637, baseType: !140, size: 256)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 256, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 8)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !137, file: !67, line: 638, baseType: !144, size: 640)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 640, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 80)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !118, file: !67, line: 643, baseType: !98, size: 32, offset: 992)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !118, file: !67, line: 651, baseType: !149, size: 64, offset: 1024)
!149 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !118, file: !67, line: 663, baseType: !151, size: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !118, file: !67, line: 664, baseType: !98, size: 32, offset: 1152)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !118, file: !67, line: 668, baseType: !151, size: 64, offset: 1216)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !118, file: !67, line: 669, baseType: !98, size: 32, offset: 1280)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !118, file: !67, line: 670, baseType: !98, size: 32, offset: 1312)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !114, file: !67, line: 241, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !67, line: 731, size: 768, elements: !162)
!162 = !{!163, !170, !171, !183, !197, !205, !212, !213, !217, !221, !222, !223}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !161, file: !67, line: 733, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!97, !112, !98, !167}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !168, line: 18, baseType: !169)
!168 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!169 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !161, file: !67, line: 735, baseType: !164, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !161, file: !67, line: 737, baseType: !172, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !112, !98, !182, !182}
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !67, line: 67, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !67, line: 66, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !180, line: 59, baseType: !181)
!180 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !180, line: 171, baseType: !68)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !161, file: !67, line: 740, baseType: !184, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!187, !112, !98, !182, !182}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !67, line: 72, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !67, line: 71, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !67, line: 70, baseType: !192)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 1024, elements: !195)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !180, line: 99, baseType: !194)
!194 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!195 = !{!196}
!196 = !DISubrange(count: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !161, file: !67, line: 743, baseType: !198, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !112, !98, !204, !182, !182, !182}
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !67, line: 727, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !67, line: 727, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !180, line: 227, baseType: !98)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !161, file: !67, line: 749, baseType: !206, size: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !112, !98, !204, !182, !182, !182}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !67, line: 728, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !67, line: 728, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !161, file: !67, line: 755, baseType: !121, size: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !161, file: !67, line: 756, baseType: !214, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!175, !112, !201, !182, !182, !204}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !161, file: !67, line: 761, baseType: !218, size: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!187, !112, !209, !182, !182, !204}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !161, file: !67, line: 766, baseType: !125, size: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !161, file: !67, line: 767, baseType: !121, size: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !161, file: !67, line: 774, baseType: !149, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !114, file: !67, line: 241, baseType: !225, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !67, line: 676, size: 256, elements: !227)
!227 = !{!228, !229, !230, !231, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !226, file: !67, line: 677, baseType: !121, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !226, file: !67, line: 679, baseType: !149, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !226, file: !67, line: 680, baseType: !149, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !226, file: !67, line: 681, baseType: !98, size: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !226, file: !67, line: 682, baseType: !98, size: 32, offset: 224)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !114, file: !67, line: 241, baseType: !204, size: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !114, file: !67, line: 241, baseType: !98, size: 32, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!237 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!238 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62}
!239 = !{i32 7, !"Dwarf Version", i32 5}
!240 = !{i32 2, !"Debug Info Version", i32 3}
!241 = !{i32 1, !"wchar_size", i32 4}
!242 = !{i32 8, !"PIC Level", i32 2}
!243 = !{i32 7, !"PIE Level", i32 2}
!244 = !{i32 7, !"uwtable", i32 2}
!245 = !{i32 7, !"frame-pointer", i32 2}
!246 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!247 = distinct !DISubprogram(name: "read_quant_tables", scope: !2, file: !2, line: 73, type: !248, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !64, retainedNodes: !409)
!248 = !DISubroutineType(types: !249)
!249 = !{!204, !250, !133, !98, !204}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_compress_ptr", file: !67, line: 249, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !67, line: 255, size: 3968, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259, !276, !277, !278, !279, !281, !283, !284, !285, !286, !320, !322, !338, !339, !343, !344, !345, !346, !349, !350, !351, !352, !353, !354, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !371, !372, !373, !374, !378, !379, !380, !381, !382, !385, !388, !391, !394, !397, !400, !403, !406}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !252, file: !67, line: 256, baseType: !117, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !252, file: !67, line: 256, baseType: !160, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !252, file: !67, line: 256, baseType: !225, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !252, file: !67, line: 256, baseType: !204, size: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !252, file: !67, line: 256, baseType: !98, size: 32, offset: 224)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !252, file: !67, line: 259, baseType: !260, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !67, line: 688, size: 320, elements: !262)
!262 = !{!263, !266, !267, !271, !275}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !261, file: !67, line: 689, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !180, line: 110, baseType: !181)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !261, file: !67, line: 690, baseType: !167, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !261, file: !67, line: 692, baseType: !268, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !250}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !261, file: !67, line: 693, baseType: !272, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!204, !250}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !261, file: !67, line: 694, baseType: !268, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !252, file: !67, line: 266, baseType: !182, size: 32, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !252, file: !67, line: 267, baseType: !182, size: 32, offset: 352)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "input_components", scope: !252, file: !67, line: 268, baseType: !98, size: 32, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "in_color_space", scope: !252, file: !67, line: 269, baseType: !280, size: 32, offset: 416)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !67, line: 201, baseType: !66)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "input_gamma", scope: !252, file: !67, line: 271, baseType: !282, size: 64, offset: 448)
!282 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !252, file: !67, line: 281, baseType: !98, size: 32, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !252, file: !67, line: 283, baseType: !98, size: 32, offset: 544)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !252, file: !67, line: 284, baseType: !280, size: 32, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !252, file: !67, line: 286, baseType: !287, size: 64, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !67, line: 179, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 116, size: 768, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !319}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !289, file: !67, line: 120, baseType: !98, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !289, file: !67, line: 121, baseType: !98, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !289, file: !67, line: 122, baseType: !98, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !289, file: !67, line: 123, baseType: !98, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !289, file: !67, line: 124, baseType: !98, size: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !289, file: !67, line: 129, baseType: !98, size: 32, offset: 160)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !289, file: !67, line: 130, baseType: !98, size: 32, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !289, file: !67, line: 139, baseType: !182, size: 32, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !289, file: !67, line: 140, baseType: !182, size: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !289, file: !67, line: 147, baseType: !98, size: 32, offset: 288)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !289, file: !67, line: 154, baseType: !182, size: 32, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !289, file: !67, line: 155, baseType: !182, size: 32, offset: 352)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !289, file: !67, line: 160, baseType: !204, size: 32, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !289, file: !67, line: 164, baseType: !98, size: 32, offset: 416)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !289, file: !67, line: 165, baseType: !98, size: 32, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !289, file: !67, line: 166, baseType: !98, size: 32, offset: 480)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !289, file: !67, line: 167, baseType: !98, size: 32, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !289, file: !67, line: 168, baseType: !98, size: 32, offset: 544)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !289, file: !67, line: 169, baseType: !98, size: 32, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !289, file: !67, line: 175, baseType: !311, size: 64, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !67, line: 95, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 83, size: 1056, elements: !314)
!314 = !{!315, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !313, file: !67, line: 88, baseType: !316, size: 1024)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 1024, elements: !195)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !180, line: 147, baseType: !237)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !313, file: !67, line: 94, baseType: !204, size: 32, offset: 1024)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !289, file: !67, line: 178, baseType: !97, size: 64, offset: 704)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !252, file: !67, line: 289, baseType: !321, size: 256, offset: 704)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 256, elements: !106)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !252, file: !67, line: 292, baseType: !323, size: 256, offset: 960)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 256, elements: !106)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !67, line: 111, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 100, size: 2240, elements: !327)
!327 = !{!328, !333, !337}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !326, file: !67, line: 102, baseType: !329, size: 136)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 136, elements: !331)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !180, line: 135, baseType: !181)
!331 = !{!332}
!332 = !DISubrange(count: 17)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !326, file: !67, line: 104, baseType: !334, size: 2048, offset: 136)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 2048, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !326, file: !67, line: 110, baseType: !204, size: 32, offset: 2208)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !252, file: !67, line: 293, baseType: !323, size: 256, offset: 1216)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !252, file: !67, line: 296, baseType: !340, size: 128, offset: 1472)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 128, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 16)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !252, file: !67, line: 297, baseType: !340, size: 128, offset: 1600)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !252, file: !67, line: 298, baseType: !340, size: 128, offset: 1728)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "num_scans", scope: !252, file: !67, line: 300, baseType: !98, size: 32, offset: 1856)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "scan_info", scope: !252, file: !67, line: 301, baseType: !347, size: 64, offset: 1920)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_in", scope: !252, file: !67, line: 307, baseType: !204, size: 32, offset: 1984)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !252, file: !67, line: 308, baseType: !204, size: 32, offset: 2016)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_coding", scope: !252, file: !67, line: 309, baseType: !204, size: 32, offset: 2048)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !252, file: !67, line: 310, baseType: !204, size: 32, offset: 2080)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "smoothing_factor", scope: !252, file: !67, line: 311, baseType: !98, size: 32, offset: 2112)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !252, file: !67, line: 312, baseType: !355, size: 32, offset: 2144)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !67, line: 209, baseType: !76)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !252, file: !67, line: 319, baseType: !68, size: 32, offset: 2176)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "restart_in_rows", scope: !252, file: !67, line: 320, baseType: !98, size: 32, offset: 2208)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "write_JFIF_header", scope: !252, file: !67, line: 324, baseType: !204, size: 32, offset: 2240)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !252, file: !67, line: 329, baseType: !330, size: 8, offset: 2272)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !252, file: !67, line: 330, baseType: !317, size: 16, offset: 2288)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !252, file: !67, line: 331, baseType: !317, size: 16, offset: 2304)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "write_Adobe_marker", scope: !252, file: !67, line: 332, baseType: !204, size: 32, offset: 2336)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "next_scanline", scope: !252, file: !67, line: 339, baseType: !182, size: 32, offset: 2368)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !252, file: !67, line: 348, baseType: !204, size: 32, offset: 2400)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !252, file: !67, line: 349, baseType: !98, size: 32, offset: 2432)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !252, file: !67, line: 350, baseType: !98, size: 32, offset: 2464)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !252, file: !67, line: 352, baseType: !182, size: 32, offset: 2496)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !252, file: !67, line: 363, baseType: !98, size: 32, offset: 2528)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !252, file: !67, line: 364, baseType: !370, size: 256, offset: 2560)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 256, elements: !106)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !252, file: !67, line: 367, baseType: !182, size: 32, offset: 2816)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !252, file: !67, line: 368, baseType: !182, size: 32, offset: 2848)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !252, file: !67, line: 370, baseType: !98, size: 32, offset: 2880)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !252, file: !67, line: 371, baseType: !375, size: 320, offset: 2912)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 320, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 10)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !252, file: !67, line: 375, baseType: !98, size: 32, offset: 3232)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !252, file: !67, line: 375, baseType: !98, size: 32, offset: 3264)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !252, file: !67, line: 375, baseType: !98, size: 32, offset: 3296)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !252, file: !67, line: 375, baseType: !98, size: 32, offset: 3328)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !252, file: !67, line: 380, baseType: !383, size: 64, offset: 3392)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_comp_master", file: !67, line: 380, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !252, file: !67, line: 381, baseType: !386, size: 64, offset: 3456)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_main_controller", file: !67, line: 381, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prep", scope: !252, file: !67, line: 382, baseType: !389, size: 64, offset: 3520)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_prep_controller", file: !67, line: 382, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !252, file: !67, line: 383, baseType: !392, size: 64, offset: 3584)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_coef_controller", file: !67, line: 383, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !252, file: !67, line: 384, baseType: !395, size: 64, offset: 3648)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_writer", file: !67, line: 384, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !252, file: !67, line: 385, baseType: !398, size: 64, offset: 3712)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_converter", file: !67, line: 385, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !252, file: !67, line: 386, baseType: !401, size: 64, offset: 3776)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_downsampler", file: !67, line: 386, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !252, file: !67, line: 387, baseType: !404, size: 64, offset: 3840)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_forward_dct", file: !67, line: 387, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !252, file: !67, line: 388, baseType: !407, size: 64, offset: 3904)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_encoder", file: !67, line: 388, flags: DIFlagFwdDecl)
!409 = !{}
!410 = !DILocalVariable(name: "cinfo", arg: 1, scope: !247, file: !2, line: 73, type: !250)
!411 = !DILocation(line: 73, column: 35, scope: !247)
!412 = !DILocalVariable(name: "filename", arg: 2, scope: !247, file: !2, line: 73, type: !133)
!413 = !DILocation(line: 73, column: 49, scope: !247)
!414 = !DILocalVariable(name: "scale_factor", arg: 3, scope: !247, file: !2, line: 74, type: !98)
!415 = !DILocation(line: 74, column: 10, scope: !247)
!416 = !DILocalVariable(name: "force_baseline", arg: 4, scope: !247, file: !2, line: 74, type: !204)
!417 = !DILocation(line: 74, column: 32, scope: !247)
!418 = !DILocalVariable(name: "fp", scope: !247, file: !2, line: 85, type: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !421, line: 7, baseType: !422)
!421 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !423, line: 49, size: 1728, elements: !424)
!423 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !440, !442, !443, !444, !447, !448, !450, !454, !457, !459, !462, !465, !466, !467, !468, !469}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !422, file: !423, line: 51, baseType: !98, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !422, file: !423, line: 54, baseType: !133, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !422, file: !423, line: 55, baseType: !133, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !422, file: !423, line: 56, baseType: !133, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !422, file: !423, line: 57, baseType: !133, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !422, file: !423, line: 58, baseType: !133, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !422, file: !423, line: 59, baseType: !133, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !422, file: !423, line: 60, baseType: !133, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !422, file: !423, line: 61, baseType: !133, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !422, file: !423, line: 64, baseType: !133, size: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !422, file: !423, line: 65, baseType: !133, size: 64, offset: 640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !422, file: !423, line: 66, baseType: !133, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !422, file: !423, line: 68, baseType: !438, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !423, line: 36, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !422, file: !423, line: 70, baseType: !441, size: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !422, file: !423, line: 72, baseType: !98, size: 32, offset: 896)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !422, file: !423, line: 73, baseType: !98, size: 32, offset: 928)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !422, file: !423, line: 74, baseType: !445, size: 64, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !446, line: 152, baseType: !149)
!446 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !422, file: !423, line: 77, baseType: !237, size: 16, offset: 1024)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !422, file: !423, line: 78, baseType: !449, size: 8, offset: 1040)
!449 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !422, file: !423, line: 79, baseType: !451, size: 8, offset: 1048)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 1)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !422, file: !423, line: 81, baseType: !455, size: 64, offset: 1088)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !423, line: 43, baseType: null)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !422, file: !423, line: 89, baseType: !458, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !446, line: 153, baseType: !149)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !422, file: !423, line: 91, baseType: !460, size: 64, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !423, line: 37, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !422, file: !423, line: 92, baseType: !463, size: 64, offset: 1280)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !423, line: 38, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !422, file: !423, line: 93, baseType: !441, size: 64, offset: 1344)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !422, file: !423, line: 94, baseType: !97, size: 64, offset: 1408)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !422, file: !423, line: 95, baseType: !167, size: 64, offset: 1472)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !422, file: !423, line: 96, baseType: !98, size: 32, offset: 1536)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !422, file: !423, line: 98, baseType: !470, size: 160, offset: 1568)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 20)
!473 = !DILocation(line: 85, column: 10, scope: !247)
!474 = !DILocalVariable(name: "tblno", scope: !247, file: !2, line: 86, type: !98)
!475 = !DILocation(line: 86, column: 7, scope: !247)
!476 = !DILocalVariable(name: "i", scope: !247, file: !2, line: 86, type: !98)
!477 = !DILocation(line: 86, column: 14, scope: !247)
!478 = !DILocalVariable(name: "termchar", scope: !247, file: !2, line: 86, type: !98)
!479 = !DILocation(line: 86, column: 17, scope: !247)
!480 = !DILocalVariable(name: "val", scope: !247, file: !2, line: 87, type: !149)
!481 = !DILocation(line: 87, column: 8, scope: !247)
!482 = !DILocalVariable(name: "table", scope: !247, file: !2, line: 88, type: !483)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 2048, elements: !195)
!484 = !DILocation(line: 88, column: 16, scope: !247)
!485 = !DILocation(line: 90, column: 19, scope: !486)
!486 = distinct !DILexicalBlock(scope: !247, file: !2, line: 90, column: 7)
!487 = !DILocation(line: 90, column: 13, scope: !486)
!488 = !DILocation(line: 90, column: 11, scope: !486)
!489 = !DILocation(line: 90, column: 35, scope: !486)
!490 = !DILocation(line: 91, column: 13, scope: !491)
!491 = distinct !DILexicalBlock(scope: !486, file: !2, line: 90, column: 44)
!492 = !DILocation(line: 91, column: 51, scope: !491)
!493 = !DILocation(line: 91, column: 5, scope: !491)
!494 = !DILocation(line: 92, column: 5, scope: !491)
!495 = !DILocation(line: 94, column: 9, scope: !247)
!496 = !DILocation(line: 96, column: 3, scope: !247)
!497 = !DILocation(line: 96, column: 28, scope: !247)
!498 = !DILocation(line: 96, column: 10, scope: !247)
!499 = !DILocation(line: 97, column: 9, scope: !500)
!500 = distinct !DILexicalBlock(scope: !501, file: !2, line: 97, column: 9)
!501 = distinct !DILexicalBlock(scope: !247, file: !2, line: 96, column: 50)
!502 = !DILocation(line: 97, column: 15, scope: !500)
!503 = !DILocation(line: 98, column: 15, scope: !504)
!504 = distinct !DILexicalBlock(scope: !500, file: !2, line: 97, column: 34)
!505 = !DILocation(line: 98, column: 55, scope: !504)
!506 = !DILocation(line: 98, column: 7, scope: !504)
!507 = !DILocation(line: 99, column: 14, scope: !504)
!508 = !DILocation(line: 99, column: 7, scope: !504)
!509 = !DILocation(line: 100, column: 7, scope: !504)
!510 = !DILocation(line: 102, column: 31, scope: !501)
!511 = !DILocation(line: 102, column: 16, scope: !501)
!512 = !DILocation(line: 102, column: 5, scope: !501)
!513 = !DILocation(line: 102, column: 14, scope: !501)
!514 = !DILocation(line: 103, column: 12, scope: !515)
!515 = distinct !DILexicalBlock(scope: !501, file: !2, line: 103, column: 5)
!516 = !DILocation(line: 103, column: 10, scope: !515)
!517 = !DILocation(line: 103, column: 17, scope: !518)
!518 = distinct !DILexicalBlock(scope: !515, file: !2, line: 103, column: 5)
!519 = !DILocation(line: 103, column: 19, scope: !518)
!520 = !DILocation(line: 103, column: 5, scope: !515)
!521 = !DILocation(line: 104, column: 31, scope: !522)
!522 = distinct !DILexicalBlock(scope: !523, file: !2, line: 104, column: 11)
!523 = distinct !DILexicalBlock(scope: !518, file: !2, line: 103, column: 36)
!524 = !DILocation(line: 104, column: 13, scope: !522)
!525 = !DILocation(line: 104, column: 11, scope: !522)
!526 = !DILocation(line: 105, column: 10, scope: !527)
!527 = distinct !DILexicalBlock(scope: !522, file: !2, line: 104, column: 53)
!528 = !DILocation(line: 105, column: 53, scope: !527)
!529 = !DILocation(line: 105, column: 2, scope: !527)
!530 = !DILocation(line: 106, column: 9, scope: !527)
!531 = !DILocation(line: 106, column: 2, scope: !527)
!532 = !DILocation(line: 107, column: 2, scope: !527)
!533 = !DILocation(line: 109, column: 33, scope: !523)
