; ModuleID = 'cBench/consumer_jpeg_c/src/rdtarga.c'
source_filename = "cBench/consumer_jpeg_c/src/rdtarga.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jpeg_compress_struct = type { ptr, ptr, ptr, i32, i32, ptr, i32, i32, i32, i32, double, i32, i32, i32, ptr, [4 x ptr], [4 x ptr], [4 x ptr], [16 x i8], [16 x i8], [16 x i8], i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i16, i16, i32, i32, i32, i32, i32, i32, i32, [4 x ptr], i32, i32, i32, [10 x i32], i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.jpeg_memory_mgr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%struct._tga_source_struct = type { %struct.cjpeg_source_struct, ptr, ptr, ptr, i32, ptr, [4 x i8], i32, i32, i32, ptr }
%struct.cjpeg_source_struct = type { ptr, ptr, ptr, ptr, ptr, i32 }
%struct.jpeg_error_mgr = type { ptr, ptr, ptr, ptr, ptr, i32, %union.anon, i32, i64, ptr, i32, ptr, i32, i32 }
%union.anon = type { [8 x i32], [48 x i8] }
%struct.cdjpeg_progress_mgr = type { %struct.jpeg_progress_mgr, i32, i32, i32 }
%struct.jpeg_progress_mgr = type { ptr, i64, i64, i32, i32 }

@c5to8bits = internal constant [32 x i8] c"\00\08\10\19!)1:BJRZcks{\84\8C\94\9C\A5\AD\B5\BD\C5\CE\D6\DE\E6\EF\F7\FF", align 16, !dbg !0

; Function Attrs: noinline nounwind uwtable
define dso_local ptr @jinit_read_targa(ptr noundef %0) #0 !dbg !602 {

!145 = !DIFile(filename: "cBench/consumer_jpeg_c/src/cderror.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "023c024f882773b78143e7b16d959dcc")
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!147 = !DIEnumerator(name: "JMSG_FIRSTADDONCODE", value: 1000)
!148 = !DIEnumerator(name: "JERR_BMP_BADCMAP", value: 1001)
!149 = !DIEnumerator(name: "JERR_BMP_BADDEPTH", value: 1002)
!150 = !DIEnumerator(name: "JERR_BMP_BADHEADER", value: 1003)
!151 = !DIEnumerator(name: "JERR_BMP_BADPLANES", value: 1004)
!152 = !DIEnumerator(name: "JERR_BMP_COLORSPACE", value: 1005)
!153 = !DIEnumerator(name: "JERR_BMP_COMPRESSED", value: 1006)
!154 = !DIEnumerator(name: "JERR_BMP_NOT", value: 1007)
!155 = !DIEnumerator(name: "JTRC_BMP", value: 1008)
!156 = !DIEnumerator(name: "JTRC_BMP_MAPPED", value: 1009)
!157 = !DIEnumerator(name: "JTRC_BMP_OS2", value: 1010)
!158 = !DIEnumerator(name: "JTRC_BMP_OS2_MAPPED", value: 1011)
!159 = !DIEnumerator(name: "JERR_GIF_BUG", value: 1012)
!160 = !DIEnumerator(name: "JERR_GIF_CODESIZE", value: 1013)
!161 = !DIEnumerator(name: "JERR_GIF_COLORSPACE", value: 1014)
!162 = !DIEnumerator(name: "JERR_GIF_IMAGENOTFOUND", value: 1015)
!163 = !DIEnumerator(name: "JERR_GIF_NOT", value: 1016)
!164 = !DIEnumerator(name: "JTRC_GIF", value: 1017)
!165 = !DIEnumerator(name: "JTRC_GIF_BADVERSION", value: 1018)
!166 = !DIEnumerator(name: "JTRC_GIF_EXTENSION", value: 1019)
!167 = !DIEnumerator(name: "JTRC_GIF_NONSQUARE", value: 1020)
!168 = !DIEnumerator(name: "JWRN_GIF_BADDATA", value: 1021)
!169 = !DIEnumerator(name: "JWRN_GIF_CHAR", value: 1022)
!170 = !DIEnumerator(name: "JWRN_GIF_ENDCODE", value: 1023)
!171 = !DIEnumerator(name: "JWRN_GIF_NOMOREDATA", value: 1024)
!172 = !DIEnumerator(name: "JERR_PPM_COLORSPACE", value: 1025)
!173 = !DIEnumerator(name: "JERR_PPM_NONNUMERIC", value: 1026)
!174 = !DIEnumerator(name: "JERR_PPM_NOT", value: 1027)
!175 = !DIEnumerator(name: "JTRC_PGM", value: 1028)
!176 = !DIEnumerator(name: "JTRC_PGM_TEXT", value: 1029)
!177 = !DIEnumerator(name: "JTRC_PPM", value: 1030)
!178 = !DIEnumerator(name: "JTRC_PPM_TEXT", value: 1031)
!179 = !DIEnumerator(name: "JERR_TGA_BADCMAP", value: 1032)
!180 = !DIEnumerator(name: "JERR_TGA_BADPARMS", value: 1033)
!181 = !DIEnumerator(name: "JERR_TGA_COLORSPACE", value: 1034)
!182 = !DIEnumerator(name: "JTRC_TGA", value: 1035)
!183 = !DIEnumerator(name: "JTRC_TGA_GRAY", value: 1036)
!184 = !DIEnumerator(name: "JTRC_TGA_MAPPED", value: 1037)
!185 = !DIEnumerator(name: "JERR_BAD_CMAP_FILE", value: 1038)
!186 = !DIEnumerator(name: "JERR_TOO_MANY_COLORS", value: 1039)
!187 = !DIEnumerator(name: "JERR_UNGETC_FAILED", value: 1040)
!188 = !DIEnumerator(name: "JERR_UNKNOWN_FORMAT", value: 1041)
!189 = !DIEnumerator(name: "JERR_UNSUPPORTED_FORMAT", value: 1042)
!190 = !DIEnumerator(name: "JMSG_LASTADDONCODE", value: 1043)
!191 = !{!192, !216, !231, !502, !229, !230, !7, !246, !581, !576, !243, !291}
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "tga_source_ptr", file: !3, line: 46, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tga_source_struct", file: !3, line: 48, size: 896, elements: !195)
!195 = !{!196, !566, !567, !568, !569, !570, !574, !577, !578, !579, !580}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !194, file: !3, line: 49, baseType: !197, size: 384)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_source_struct", file: !198, line: 26, size: 384, elements: !199)
!198 = !DIFile(filename: "cBench/consumer_jpeg_c/src/cdjpeg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "bced6b83fac9f9ba4577dcff987736ac")
!199 = !{!200, !504, !508, !509, !564, !565}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "start_input", scope: !197, file: !198, line: 27, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !204, !502}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_compress_ptr", file: !6, line: 249, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_compress_struct", file: !6, line: 255, size: 3968, elements: !207)
!207 = !{!208, !335, !336, !337, !338, !339, !356, !357, !358, !359, !361, !363, !364, !365, !366, !401, !405, !421, !422, !426, !427, !428, !429, !442, !443, !444, !445, !446, !447, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !464, !465, !466, !467, !471, !472, !473, !474, !475, !478, !481, !484, !487, !490, !493, !496, !499}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !206, file: !6, line: 256, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_error_mgr", file: !6, line: 618, size: 1344, elements: !211)
!211 = !{!212, !303, !304, !305, !311, !312, !313, !324, !325, !326, !331, !332, !333, !334}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !210, file: !6, line: 620, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !216}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "j_common_ptr", file: !6, line: 248, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_common_struct", file: !6, line: 240, size: 256, elements: !219)
!219 = !{!220, !221, !292, !301, !302}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !218, file: !6, line: 241, baseType: !209, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !218, file: !6, line: 241, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_memory_mgr", file: !6, line: 731, size: 768, elements: !224)
!224 = !{!225, !234, !235, !247, !261, !269, !276, !277, !281, !285, !289, !290}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !223, file: !6, line: 733, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !216, !230, !231}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!230 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !232, line: 18, baseType: !233)
!232 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!233 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !223, file: !6, line: 735, baseType: !226, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !223, file: !6, line: 737, baseType: !236, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !216, !230, !246, !246}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPARRAY", file: !6, line: 67, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPROW", file: !6, line: 66, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "JSAMPLE", file: !244, line: 59, baseType: !245)
!244 = !DIFile(filename: "cBench/consumer_jpeg_c/src/jmorecfg.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "56a0eda58fafa6bdd5498f702a998c09")
!245 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "JDIMENSION", file: !244, line: 171, baseType: !7)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !223, file: !6, line: 740, baseType: !248, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!251, !216, !230, !246, !246}
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKARRAY", file: !6, line: 72, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCKROW", file: !6, line: 71, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "JBLOCK", file: !6, line: 70, baseType: !256)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 1024, elements: !259)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "JCOEF", file: !244, line: 99, baseType: !258)
!258 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!259 = !{!260}
!260 = !DISubrange(count: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !223, file: !6, line: 743, baseType: !262, size: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!265, !216, !230, !268, !246, !246, !246}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_sarray_ptr", file: !6, line: 727, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !6, line: 727, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !244, line: 227, baseType: !230)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !223, file: !6, line: 749, baseType: !270, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !216, !230, !268, !246, !246, !246}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvirt_barray_ptr", file: !6, line: 728, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !6, line: 728, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !223, file: !6, line: 755, baseType: !213, size: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !223, file: !6, line: 756, baseType: !278, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!239, !216, !265, !246, !246, !268}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !223, file: !6, line: 761, baseType: !282, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!251, !216, !273, !246, !246, !268}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !223, file: !6, line: 766, baseType: !286, size: 64, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !216, !230}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !223, file: !6, line: 767, baseType: !213, size: 64, offset: 640)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !223, file: !6, line: 774, baseType: !291, size: 64, offset: 704)
!291 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !218, file: !6, line: 241, baseType: !293, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_progress_mgr", file: !6, line: 676, size: 256, elements: !295)
!295 = !{!296, !297, !298, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !294, file: !6, line: 677, baseType: !213, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !294, file: !6, line: 679, baseType: !291, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !294, file: !6, line: 680, baseType: !291, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !294, file: !6, line: 681, baseType: !230, size: 32, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !294, file: !6, line: 682, baseType: !230, size: 32, offset: 224)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !218, file: !6, line: 241, baseType: !268, size: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !218, file: !6, line: 241, baseType: !230, size: 32, offset: 224)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !210, file: !6, line: 622, baseType: !286, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !210, file: !6, line: 624, baseType: !213, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !210, file: !6, line: 626, baseType: !306, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !216, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !210, file: !6, line: 629, baseType: !213, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !210, file: !6, line: 634, baseType: !230, size: 32, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "msg_parm", scope: !210, file: !6, line: 639, baseType: !314, size: 640, offset: 352)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !210, file: !6, line: 636, size: 640, elements: !315)
!315 = !{!316, !320}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !314, file: !6, line: 637, baseType: !317, size: 256)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 256, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 8)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !314, file: !6, line: 638, baseType: !321, size: 640)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 640, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 80)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !210, file: !6, line: 643, baseType: !230, size: 32, offset: 992)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !210, file: !6, line: 651, baseType: !291, size: 64, offset: 1024)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !210, file: !6, line: 663, baseType: !327, size: 64, offset: 1088)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !210, file: !6, line: 664, baseType: !230, size: 32, offset: 1152)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !210, file: !6, line: 668, baseType: !327, size: 64, offset: 1216)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !210, file: !6, line: 669, baseType: !230, size: 32, offset: 1280)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !210, file: !6, line: 670, baseType: !230, size: 32, offset: 1312)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !206, file: !6, line: 256, baseType: !222, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !206, file: !6, line: 256, baseType: !293, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !206, file: !6, line: 256, baseType: !268, size: 32, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !206, file: !6, line: 256, baseType: !230, size: 32, offset: 224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !206, file: !6, line: 259, baseType: !340, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_destination_mgr", file: !6, line: 688, size: 320, elements: !342)
!342 = !{!343, !346, !347, !351, !355}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next_output_byte", scope: !341, file: !6, line: 689, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "JOCTET", file: !244, line: 110, baseType: !245)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "free_in_buffer", scope: !341, file: !6, line: 690, baseType: !231, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "init_destination", scope: !341, file: !6, line: 692, baseType: !348, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !204}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "empty_output_buffer", scope: !341, file: !6, line: 693, baseType: !352, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!268, !204}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "term_destination", scope: !341, file: !6, line: 694, baseType: !348, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !206, file: !6, line: 266, baseType: !246, size: 32, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !206, file: !6, line: 267, baseType: !246, size: 32, offset: 352)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "input_components", scope: !206, file: !6, line: 268, baseType: !230, size: 32, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "in_color_space", scope: !206, file: !6, line: 269, baseType: !360, size: 32, offset: 416)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_COLOR_SPACE", file: !6, line: 201, baseType: !5)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "input_gamma", scope: !206, file: !6, line: 271, baseType: !362, size: 64, offset: 448)
!362 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !206, file: !6, line: 281, baseType: !230, size: 32, offset: 512)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !206, file: !6, line: 283, baseType: !230, size: 32, offset: 544)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !206, file: !6, line: 284, baseType: !360, size: 32, offset: 576)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !206, file: !6, line: 286, baseType: !367, size: 64, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_component_info", file: !6, line: 179, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 116, size: 768, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !400}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !369, file: !6, line: 120, baseType: !230, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !369, file: !6, line: 121, baseType: !230, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !369, file: !6, line: 122, baseType: !230, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !369, file: !6, line: 123, baseType: !230, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !369, file: !6, line: 124, baseType: !230, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !369, file: !6, line: 129, baseType: !230, size: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !369, file: !6, line: 130, baseType: !230, size: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !369, file: !6, line: 139, baseType: !246, size: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !369, file: !6, line: 140, baseType: !246, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !369, file: !6, line: 147, baseType: !230, size: 32, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !369, file: !6, line: 154, baseType: !246, size: 32, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !369, file: !6, line: 155, baseType: !246, size: 32, offset: 352)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !369, file: !6, line: 160, baseType: !268, size: 32, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !369, file: !6, line: 164, baseType: !230, size: 32, offset: 416)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !369, file: !6, line: 165, baseType: !230, size: 32, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !369, file: !6, line: 166, baseType: !230, size: 32, offset: 480)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !369, file: !6, line: 167, baseType: !230, size: 32, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !369, file: !6, line: 168, baseType: !230, size: 32, offset: 544)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !369, file: !6, line: 169, baseType: !230, size: 32, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !369, file: !6, line: 175, baseType: !391, size: 64, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "JQUANT_TBL", file: !6, line: 95, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 83, size: 1056, elements: !394)
!394 = !{!395, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !393, file: !6, line: 88, baseType: !396, size: 1024)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 1024, elements: !259)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !244, line: 147, baseType: !398)
!398 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !393, file: !6, line: 94, baseType: !268, size: 32, offset: 1024)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !369, file: !6, line: 178, baseType: !229, size: 64, offset: 704)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !206, file: !6, line: 289, baseType: !402, size: 256, offset: 704)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 256, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 4)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !206, file: !6, line: 292, baseType: !406, size: 256, offset: 960)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 256, elements: !403)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "JHUFF_TBL", file: !6, line: 111, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 100, size: 2240, elements: !410)
!410 = !{!411, !416, !420}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !409, file: !6, line: 102, baseType: !412, size: 136)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 136, elements: !414)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !244, line: 135, baseType: !245)
!414 = !{!415}
!415 = !DISubrange(count: 17)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !409, file: !6, line: 104, baseType: !417, size: 2048, offset: 136)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 2048, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !409, file: !6, line: 110, baseType: !268, size: 32, offset: 2208)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !206, file: !6, line: 293, baseType: !406, size: 256, offset: 1216)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !206, file: !6, line: 296, baseType: !423, size: 128, offset: 1472)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 128, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 16)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !206, file: !6, line: 297, baseType: !423, size: 128, offset: 1600)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !206, file: !6, line: 298, baseType: !423, size: 128, offset: 1728)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "num_scans", scope: !206, file: !6, line: 300, baseType: !230, size: 32, offset: 1856)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scan_info", scope: !206, file: !6, line: 301, baseType: !430, size: 64, offset: 1920)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_scan_info", file: !6, line: 189, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 184, size: 288, elements: !434)
!434 = !{!435, !436, !438, !439, !440, !441}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !433, file: !6, line: 185, baseType: !230, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !433, file: !6, line: 186, baseType: !437, size: 128, offset: 32)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 128, elements: !403)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !433, file: !6, line: 187, baseType: !230, size: 32, offset: 160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !433, file: !6, line: 187, baseType: !230, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !433, file: !6, line: 188, baseType: !230, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !433, file: !6, line: 188, baseType: !230, size: 32, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_in", scope: !206, file: !6, line: 307, baseType: !268, size: 32, offset: 1984)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !206, file: !6, line: 308, baseType: !268, size: 32, offset: 2016)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_coding", scope: !206, file: !6, line: 309, baseType: !268, size: 32, offset: 2048)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !206, file: !6, line: 310, baseType: !268, size: 32, offset: 2080)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "smoothing_factor", scope: !206, file: !6, line: 311, baseType: !230, size: 32, offset: 2112)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !206, file: !6, line: 312, baseType: !448, size: 32, offset: 2144)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "J_DCT_METHOD", file: !6, line: 209, baseType: !15)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !206, file: !6, line: 319, baseType: !7, size: 32, offset: 2176)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "restart_in_rows", scope: !206, file: !6, line: 320, baseType: !230, size: 32, offset: 2208)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "write_JFIF_header", scope: !206, file: !6, line: 324, baseType: !268, size: 32, offset: 2240)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !206, file: !6, line: 329, baseType: !413, size: 8, offset: 2272)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !206, file: !6, line: 330, baseType: !397, size: 16, offset: 2288)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !206, file: !6, line: 331, baseType: !397, size: 16, offset: 2304)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "write_Adobe_marker", scope: !206, file: !6, line: 332, baseType: !268, size: 32, offset: 2336)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "next_scanline", scope: !206, file: !6, line: 339, baseType: !246, size: 32, offset: 2368)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !206, file: !6, line: 348, baseType: !268, size: 32, offset: 2400)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !206, file: !6, line: 349, baseType: !230, size: 32, offset: 2432)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !206, file: !6, line: 350, baseType: !230, size: 32, offset: 2464)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !206, file: !6, line: 352, baseType: !246, size: 32, offset: 2496)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !206, file: !6, line: 363, baseType: !230, size: 32, offset: 2528)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !206, file: !6, line: 364, baseType: !463, size: 256, offset: 2560)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 256, elements: !403)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !206, file: !6, line: 367, baseType: !246, size: 32, offset: 2816)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !206, file: !6, line: 368, baseType: !246, size: 32, offset: 2848)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !206, file: !6, line: 370, baseType: !230, size: 32, offset: 2880)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !206, file: !6, line: 371, baseType: !468, size: 320, offset: 2912)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 320, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 10)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !206, file: !6, line: 375, baseType: !230, size: 32, offset: 3232)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !206, file: !6, line: 375, baseType: !230, size: 32, offset: 3264)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !206, file: !6, line: 375, baseType: !230, size: 32, offset: 3296)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !206, file: !6, line: 375, baseType: !230, size: 32, offset: 3328)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !206, file: !6, line: 380, baseType: !476, size: 64, offset: 3392)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_comp_master", file: !6, line: 380, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !206, file: !6, line: 381, baseType: !479, size: 64, offset: 3456)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_main_controller", file: !6, line: 381, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "prep", scope: !206, file: !6, line: 382, baseType: !482, size: 64, offset: 3520)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_prep_controller", file: !6, line: 382, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !206, file: !6, line: 383, baseType: !485, size: 64, offset: 3584)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_c_coef_controller", file: !6, line: 383, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !206, file: !6, line: 384, baseType: !488, size: 64, offset: 3648)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_writer", file: !6, line: 384, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !206, file: !6, line: 385, baseType: !491, size: 64, offset: 3712)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_converter", file: !6, line: 385, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !206, file: !6, line: 386, baseType: !494, size: 64, offset: 3776)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_downsampler", file: !6, line: 386, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !206, file: !6, line: 387, baseType: !497, size: 64, offset: 3840)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_forward_dct", file: !6, line: 387, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !206, file: !6, line: 388, baseType: !500, size: 64, offset: 3904)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_encoder", file: !6, line: 388, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_source_ptr", file: !198, line: 24, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "get_pixel_rows", scope: !197, file: !198, line: 29, baseType: !505, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!246, !204, !502}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "finish_input", scope: !197, file: !198, line: 31, baseType: !201, size: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "input_file", scope: !197, file: !198, line: 34, baseType: !510, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !512, line: 7, baseType: !513)
!512 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !514, line: 49, size: 1728, elements: !515)
!514 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !531, !533, !534, !535, !538, !539, !541, !545, !548, !550, !553, !556, !557, !558, !559, !560}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !513, file: !514, line: 51, baseType: !230, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !513, file: !514, line: 54, baseType: !309, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !513, file: !514, line: 55, baseType: !309, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !513, file: !514, line: 56, baseType: !309, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !513, file: !514, line: 57, baseType: !309, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !513, file: !514, line: 58, baseType: !309, size: 64, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !513, file: !514, line: 59, baseType: !309, size: 64, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !513, file: !514, line: 60, baseType: !309, size: 64, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !513, file: !514, line: 61, baseType: !309, size: 64, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !513, file: !514, line: 64, baseType: !309, size: 64, offset: 576)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !513, file: !514, line: 65, baseType: !309, size: 64, offset: 640)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !513, file: !514, line: 66, baseType: !309, size: 64, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !513, file: !514, line: 68, baseType: !529, size: 64, offset: 768)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !514, line: 36, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !513, file: !514, line: 70, baseType: !532, size: 64, offset: 832)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !513, file: !514, line: 72, baseType: !230, size: 32, offset: 896)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !513, file: !514, line: 73, baseType: !230, size: 32, offset: 928)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !513, file: !514, line: 74, baseType: !536, size: 64, offset: 960)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !537, line: 152, baseType: !291)
!537 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !513, file: !514, line: 77, baseType: !398, size: 16, offset: 1024)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !513, file: !514, line: 78, baseType: !540, size: 8, offset: 1040)
!540 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !513, file: !514, line: 79, baseType: !542, size: 8, offset: 1048)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 8, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 1)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !513, file: !514, line: 81, baseType: !546, size: 64, offset: 1088)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !514, line: 43, baseType: null)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !513, file: !514, line: 89, baseType: !549, size: 64, offset: 1152)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !537, line: 153, baseType: !291)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !513, file: !514, line: 91, baseType: !551, size: 64, offset: 1216)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !514, line: 37, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !513, file: !514, line: 92, baseType: !554, size: 64, offset: 1280)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !514, line: 38, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !513, file: !514, line: 93, baseType: !532, size: 64, offset: 1344)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !513, file: !514, line: 94, baseType: !229, size: 64, offset: 1408)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !513, file: !514, line: 95, baseType: !231, size: 64, offset: 1472)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !513, file: !514, line: 96, baseType: !230, size: 32, offset: 1536)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !513, file: !514, line: 98, baseType: !561, size: 160, offset: 1568)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 160, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 20)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !197, file: !198, line: 36, baseType: !239, size: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_height", scope: !197, file: !198, line: 37, baseType: !246, size: 32, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cinfo", scope: !194, file: !3, line: 51, baseType: !204, size: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !194, file: !3, line: 53, baseType: !239, size: 64, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "whole_image", scope: !194, file: !3, line: 55, baseType: !265, size: 64, offset: 512)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "current_row", scope: !194, file: !3, line: 56, baseType: !246, size: 32, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "read_pixel", scope: !194, file: !3, line: 59, baseType: !571, size: 64, offset: 640)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !192}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tga_pixel", scope: !194, file: !3, line: 62, baseType: !575, size: 32, offset: 704)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 32, elements: !403)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "U_CHAR", file: !3, line: 28, baseType: !245)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_size", scope: !194, file: !3, line: 64, baseType: !230, size: 32, offset: 736)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "block_count", scope: !194, file: !3, line: 67, baseType: !230, size: 32, offset: 768)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dup_pixel_count", scope: !194, file: !3, line: 68, baseType: !230, size: 32, offset: 800)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "get_pixel_rows", scope: !194, file: !3, line: 71, baseType: !505, size: 64, offset: 832)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "cd_progress_ptr", file: !198, line: 89, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cdjpeg_progress_mgr", file: !198, line: 81, size: 384, elements: !584)
!584 = !{!585, !586, !587, !588}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !583, file: !198, line: 82, baseType: !294, size: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "completed_extra_passes", scope: !583, file: !198, line: 83, baseType: !230, size: 32, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "total_extra_passes", scope: !583, file: !198, line: 84, baseType: !230, size: 32, offset: 288)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "percent_done", scope: !583, file: !198, line: 86, baseType: !230, size: 32, offset: 320)
!589 = !{!0}
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 256, elements: !592)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!592 = !{!593}
!593 = !DISubrange(count: 32)
!594 = !{i32 7, !"Dwarf Version", i32 5}
!595 = !{i32 2, !"Debug Info Version", i32 3}
!596 = !{i32 1, !"wchar_size", i32 4}
!597 = !{i32 8, !"PIC Level", i32 2}
!598 = !{i32 7, !"PIE Level", i32 2}
!599 = !{i32 7, !"uwtable", i32 2}
!600 = !{i32 7, !"frame-pointer", i32 2}
!601 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!602 = distinct !DISubprogram(name: "jinit_read_targa", scope: !3, file: !3, line: 484, type: !603, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !605)
!603 = !DISubroutineType(types: !604)
!604 = !{!502, !204}
!605 = !{}
!606 = !DILocalVariable(name: "cinfo", arg: 1, scope: !602, file: !3, line: 484, type: !204)
!607 = !DILocation(line: 484, column: 34, scope: !602)
!608 = !DILocalVariable(name: "source", scope: !602, file: !3, line: 486, type: !192)
!609 = !DILocation(line: 486, column: 18, scope: !602)
!610 = !DILocation(line: 490, column: 9, scope: !602)
!611 = !DILocation(line: 490, column: 16, scope: !602)
!612 = !DILocation(line: 490, column: 21, scope: !602)
!613 = !DILocation(line: 490, column: 50, scope: !602)
!614 = !DILocation(line: 490, column: 7, scope: !602)
!615 = !DILocation(line: 489, column: 10, scope: !602)
!616 = !DILocation(line: 492, column: 19, scope: !602)
!617 = !DILocation(line: 492, column: 3, scope: !602)
!618 = !DILocation(line: 492, column: 11, scope: !602)
!619 = !DILocation(line: 492, column: 17, scope: !602)
!620 = !DILocation(line: 494, column: 3, scope: !602)
!621 = !DILocation(line: 494, column: 11, scope: !602)
!622 = !DILocation(line: 494, column: 15, scope: !602)
!623 = !DILocation(line: 494, column: 27, scope: !602)
!624 = !DILocation(line: 495, column: 3, scope: !602)
!625 = !DILocation(line: 495, column: 11, scope: !602)
!626 = !DILocation(line: 495, column: 15, scope: !602)
!627 = !DILocation(line: 495, column: 28, scope: !602)
!628 = !DILocation(line: 497, column: 29, scope: !602)
!629 = !DILocation(line: 497, column: 3, scope: !602)
!630 = distinct !DISubprogram(name: "start_input_tga", scope: !3, file: !3, line: 333, type: !202, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !605)
!631 = !DILocalVariable(name: "cinfo", arg: 1, scope: !630, file: !3, line: 333, type: !204)
!632 = !DILocation(line: 333, column: 33, scope: !630)
!633 = !DILocalVariable(name: "sinfo", arg: 2, scope: !630, file: !3, line: 333, type: !502)
!634 = !DILocation(line: 333, column: 57, scope: !630)
!635 = !DILocalVariable(name: "source", scope: !630, file: !3, line: 335, type: !192)
!636 = !DILocation(line: 335, column: 18, scope: !630)
!637 = !DILocation(line: 335, column: 44, scope: !630)
!638 = !DILocalVariable(name: "targaheader", scope: !630, file: !3, line: 336, type: !639)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 144, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 18)
!642 = !DILocation(line: 336, column: 10, scope: !630)
!643 = !DILocalVariable(name: "idlen", scope: !630, file: !3, line: 337, type: !230)
!644 = !DILocation(line: 337, column: 7, scope: !630)
!645 = !DILocalVariable(name: "cmaptype", scope: !630, file: !3, line: 337, type: !230)
!646 = !DILocation(line: 337, column: 14, scope: !630)
!647 = !DILocalVariable(name: "subtype", scope: !630, file: !3, line: 337, type: !230)
!648 = !DILocation(line: 337, column: 24, scope: !630)
!649 = !DILocalVariable(name: "flags", scope: !630, file: !3, line: 337, type: !230)
!650 = !DILocation(line: 337, column: 33, scope: !630)
