; ModuleID = 'cBench/consumer_tiff2bw/src/tif_getimage.c'
source_filename = "cBench/consumer_tiff2bw/src/tif_getimage.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.tiff = type { ptr, i32, i32, i32, i32, i32, %struct.TIFFDirectory, %struct.TIFFHeader, ptr, ptr, ptr, i32, i16, i32, i32, i32, i16, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, i32, ptr, i32, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, ptr }
%struct.TIFFDirectory = type { [3 x i64], i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i32, i16, i16, double, double, float, float, i16, i16, float, float, [2 x i16], [3 x ptr], [2 x i16], i16, ptr, double, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, ptr, i16, ptr, ptr, [2 x i16], i16, ptr, ptr, ptr, [3 x ptr], i16, i16, [2 x i16], i32, ptr, ptr, i32, ptr, i32, ptr, i32, ptr, i32, i32, ptr, ptr, float, ptr, ptr }
%struct.TIFFHeader = type { i16, i16, i32 }
%struct._TIFFRGBAImage = type { ptr, i32, i32, i32, i32, i32, i16, i16, i16, i16, ptr, ptr, ptr, ptr, %union.anon, ptr, ptr, ptr, ptr, i32, i32 }
%union.anon = type { ptr }
%struct.TIFFYCbCrToRGB = type { ptr, ptr, ptr, ptr, ptr, [3 x float] }

@.str = private unnamed_addr constant [49 x i8] c"Sorry, can not handle images with %d-bit samples\00", align 1, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tif_getimage.c", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "523b6052b484a808297dda7baaf95bbb")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 49)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 77, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 22)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "photoTag", scope: !14, file: !2, line: 43, type: !207, isLocal: true, isDefinition: true)
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !15, retainedTypes: !33, globals: !72, splitDebugInlining: false, nameTableKind: None)
!15 = !{!16}
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 120, baseType: !18, size: 32, elements: !19)
!17 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tiff.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "481b1fc81ef74ff952bf85d3f2d42aca")
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!20 = !DIEnumerator(name: "TIFF_NOTYPE", value: 0)
!21 = !DIEnumerator(name: "TIFF_BYTE", value: 1)
!22 = !DIEnumerator(name: "TIFF_ASCII", value: 2)
!23 = !DIEnumerator(name: "TIFF_SHORT", value: 3)
!24 = !DIEnumerator(name: "TIFF_LONG", value: 4)
!25 = !DIEnumerator(name: "TIFF_RATIONAL", value: 5)
!26 = !DIEnumerator(name: "TIFF_SBYTE", value: 6)
!27 = !DIEnumerator(name: "TIFF_UNDEFINED", value: 7)
!28 = !DIEnumerator(name: "TIFF_SSHORT", value: 8)
!29 = !DIEnumerator(name: "TIFF_SLONG", value: 9)
!30 = !DIEnumerator(name: "TIFF_SRATIONAL", value: 10)
!31 = !DIEnumerator(name: "TIFF_FLOAT", value: 11)
!32 = !DIEnumerator(name: "TIFF_DOUBLE", value: 12)
!33 = !{!34, !37, !38, !44, !46, !47, !49, !50, !51, !35, !52, !68, !58, !61, !45}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !17, line: 62, baseType: !36)
!36 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !40, line: 33, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !42, line: 31, baseType: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!43 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !17, line: 65, baseType: !45)
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFRGBValue", file: !48, line: 112, baseType: !43)
!48 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tiffio.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "881752c035a7937b11611441903a05b9")
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !17, line: 66, baseType: !18)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFYCbCrToRGB", file: !48, line: 140, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 133, size: 448, elements: !55)
!55 = !{!56, !57, !59, !60, !62, !63}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "clamptab", scope: !54, file: !48, line: 134, baseType: !46, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Cr_r_tab", scope: !54, file: !48, line: 135, baseType: !58, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Cb_b_tab", scope: !54, file: !48, line: 136, baseType: !58, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Cr_g_tab", scope: !54, file: !48, line: 137, baseType: !61, size: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Cb_g_tab", scope: !54, file: !48, line: 138, baseType: !61, size: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "coeffs", scope: !54, file: !48, line: 139, baseType: !64, size: 96, offset: 320)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 96, elements: !66)
!65 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!66 = !{!67}
!67 = !DISubrange(count: 3)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "tidata_t", file: !69, line: 56, baseType: !70)
!69 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tiffiop.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "6324af1ca1eb1b70648c0ebf381681c1")
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "tidataval_t", file: !69, line: 55, baseType: !43)
!72 = !{!0, !7, !73, !78, !83, !88, !93, !98, !103, !105, !110, !115, !120, !125, !130, !135, !137, !142, !144, !149, !154, !156, !158, !160, !12, !165, !170, !175, !180, !185, !190, !195, !200, !205}
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(scope: null, file: !2, line: 87, type: !75, isLocal: true, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 60)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 14)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(scope: null, file: !2, line: 95, type: !85, isLocal: true, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 46)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(scope: null, file: !2, line: 96, type: !90, isLocal: true, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 20)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(scope: null, file: !2, line: 102, type: !95, isLocal: true, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 43)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(scope: null, file: !2, line: 103, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 15)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !3, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 7)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(scope: null, file: !2, line: 123, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 33)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(scope: null, file: !2, line: 124, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 12)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 41)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !2, line: 136, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 47)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 142, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 39)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !2, line: 205, type: !122, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !2, line: 243, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 32)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !139, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 23)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(scope: null, file: !2, line: 366, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 496, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 62)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1910, type: !127, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1918, type: !75, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1968, type: !3, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1977, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 71)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 445, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 25)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 30)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !2, line: 415, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 27)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !2, line: 577, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 26)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1768, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 24)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1626, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 42)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1574, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 31)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1703, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 35)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1525, type: !122, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 208, elements: !183)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!209 = !{i32 7, !"Dwarf Version", i32 5}
!210 = !{i32 2, !"Debug Info Version", i32 3}
!211 = !{i32 1, !"wchar_size", i32 4}
!212 = !{i32 8, !"PIC Level", i32 2}
!213 = !{i32 7, !"PIE Level", i32 2}
!214 = !{i32 7, !"uwtable", i32 2}
!215 = !{i32 7, !"frame-pointer", i32 2}
!216 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!217 = distinct !DISubprogram(name: "TIFFRGBAImageOK", scope: !2, file: !2, line: 52, type: !218, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !536)
!218 = !DISubroutineType(types: !219)
!219 = !{!45, !220, !225}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !48, line: 48, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !69, line: 70, size: 7040, elements: !223)
!223 = !{!224, !226, !227, !228, !229, !231, !232, !322, !329, !330, !333, !337, !338, !340, !341, !342, !343, !344, !345, !346, !348, !350, !355, !361, !362, !363, !364, !369, !370, !371, !372, !373, !374, !379, !384, !385, !390, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !413, !418, !419, !424, !425, !430, !435, !440, !445, !464, !465, !477, !479}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tif_name", scope: !222, file: !69, line: 71, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fd", scope: !222, file: !69, line: 72, baseType: !45, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mode", scope: !222, file: !69, line: 73, baseType: !45, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tif_flags", scope: !222, file: !69, line: 74, baseType: !51, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tif_diroff", scope: !222, file: !69, line: 90, baseType: !230, size: 32, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "toff_t", file: !48, line: 75, baseType: !44)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nextdiroff", scope: !222, file: !69, line: 91, baseType: !230, size: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dir", scope: !222, file: !69, line: 92, baseType: !233, size: 3776, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDirectory", file: !234, line: 121, baseType: !235)
!234 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tif_dir.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "467bfe3104f8edda1690c4215d0ca70c")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 36, size: 3776, elements: !236)
!236 = !{!237, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !262, !263, !264, !265, !266, !267, !268, !269, !273, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !290, !291, !292, !293, !294, !295, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "td_fieldsset", scope: !235, file: !234, line: 39, baseType: !238, size: 192)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 192, elements: !66)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_long", file: !40, line: 36, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_long", file: !42, line: 34, baseType: !241)
!241 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagewidth", scope: !235, file: !234, line: 41, baseType: !51, size: 32, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagelength", scope: !235, file: !234, line: 41, baseType: !51, size: 32, offset: 224)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagedepth", scope: !235, file: !234, line: 41, baseType: !51, size: 32, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilewidth", scope: !235, file: !234, line: 42, baseType: !51, size: 32, offset: 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilelength", scope: !235, file: !234, line: 42, baseType: !51, size: 32, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "td_tiledepth", scope: !235, file: !234, line: 42, baseType: !51, size: 32, offset: 352)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "td_subfiletype", scope: !235, file: !234, line: 43, baseType: !51, size: 32, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "td_bitspersample", scope: !235, file: !234, line: 44, baseType: !35, size: 16, offset: 416)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleformat", scope: !235, file: !234, line: 45, baseType: !35, size: 16, offset: 432)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "td_compression", scope: !235, file: !234, line: 46, baseType: !35, size: 16, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "td_photometric", scope: !235, file: !234, line: 47, baseType: !35, size: 16, offset: 464)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "td_threshholding", scope: !235, file: !234, line: 48, baseType: !35, size: 16, offset: 480)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "td_fillorder", scope: !235, file: !234, line: 49, baseType: !35, size: 16, offset: 496)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "td_orientation", scope: !235, file: !234, line: 50, baseType: !35, size: 16, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "td_samplesperpixel", scope: !235, file: !234, line: 51, baseType: !35, size: 16, offset: 528)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "td_rowsperstrip", scope: !235, file: !234, line: 52, baseType: !51, size: 32, offset: 544)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "td_minsamplevalue", scope: !235, file: !234, line: 53, baseType: !35, size: 16, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "td_maxsamplevalue", scope: !235, file: !234, line: 53, baseType: !35, size: 16, offset: 592)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "td_sminsamplevalue", scope: !235, file: !234, line: 54, baseType: !261, size: 64, offset: 640)
!261 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "td_smaxsamplevalue", scope: !235, file: !234, line: 54, baseType: !261, size: 64, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "td_xresolution", scope: !235, file: !234, line: 55, baseType: !65, size: 32, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "td_yresolution", scope: !235, file: !234, line: 55, baseType: !65, size: 32, offset: 800)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "td_resolutionunit", scope: !235, file: !234, line: 56, baseType: !35, size: 16, offset: 832)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "td_planarconfig", scope: !235, file: !234, line: 57, baseType: !35, size: 16, offset: 848)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "td_xposition", scope: !235, file: !234, line: 58, baseType: !65, size: 32, offset: 864)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "td_yposition", scope: !235, file: !234, line: 58, baseType: !65, size: 32, offset: 896)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "td_pagenumber", scope: !235, file: !234, line: 59, baseType: !270, size: 32, offset: 928)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 2)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "td_colormap", scope: !235, file: !234, line: 60, baseType: !274, size: 192, offset: 960)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 192, elements: !66)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "td_halftonehints", scope: !235, file: !234, line: 61, baseType: !270, size: 32, offset: 1152)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "td_extrasamples", scope: !235, file: !234, line: 62, baseType: !35, size: 16, offset: 1184)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleinfo", scope: !235, file: !234, line: 63, baseType: !34, size: 64, offset: 1216)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "td_stonits", scope: !235, file: !234, line: 64, baseType: !261, size: 64, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "td_documentname", scope: !235, file: !234, line: 65, baseType: !225, size: 64, offset: 1344)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "td_artist", scope: !235, file: !234, line: 66, baseType: !225, size: 64, offset: 1408)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "td_datetime", scope: !235, file: !234, line: 67, baseType: !225, size: 64, offset: 1472)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "td_hostcomputer", scope: !235, file: !234, line: 68, baseType: !225, size: 64, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagedescription", scope: !235, file: !234, line: 69, baseType: !225, size: 64, offset: 1600)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "td_make", scope: !235, file: !234, line: 70, baseType: !225, size: 64, offset: 1664)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "td_model", scope: !235, file: !234, line: 71, baseType: !225, size: 64, offset: 1728)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "td_software", scope: !235, file: !234, line: 72, baseType: !225, size: 64, offset: 1792)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "td_pagename", scope: !235, file: !234, line: 73, baseType: !225, size: 64, offset: 1856)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripsperimage", scope: !235, file: !234, line: 74, baseType: !289, size: 32, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "tstrip_t", file: !48, line: 71, baseType: !51)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "td_nstrips", scope: !235, file: !234, line: 75, baseType: !289, size: 32, offset: 1952)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripoffset", scope: !235, file: !234, line: 76, baseType: !50, size: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecount", scope: !235, file: !234, line: 77, baseType: !50, size: 64, offset: 2048)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "td_nsubifd", scope: !235, file: !234, line: 79, baseType: !35, size: 16, offset: 2112)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "td_subifd", scope: !235, file: !234, line: 80, baseType: !50, size: 64, offset: 2176)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrcoeffs", scope: !235, file: !234, line: 83, baseType: !296, size: 64, offset: 2240)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrsubsampling", scope: !235, file: !234, line: 84, baseType: !270, size: 32, offset: 2304)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrpositioning", scope: !235, file: !234, line: 85, baseType: !35, size: 16, offset: 2336)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "td_whitepoint", scope: !235, file: !234, line: 88, baseType: !296, size: 64, offset: 2368)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "td_primarychromas", scope: !235, file: !234, line: 89, baseType: !296, size: 64, offset: 2432)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "td_refblackwhite", scope: !235, file: !234, line: 90, baseType: !296, size: 64, offset: 2496)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "td_transferfunction", scope: !235, file: !234, line: 91, baseType: !274, size: 192, offset: 2560)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "td_inkset", scope: !235, file: !234, line: 94, baseType: !35, size: 16, offset: 2752)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "td_ninks", scope: !235, file: !234, line: 95, baseType: !35, size: 16, offset: 2768)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "td_dotrange", scope: !235, file: !234, line: 96, baseType: !270, size: 32, offset: 2784)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknameslen", scope: !235, file: !234, line: 97, baseType: !45, size: 32, offset: 2816)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknames", scope: !235, file: !234, line: 98, baseType: !225, size: 64, offset: 2880)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "td_targetprinter", scope: !235, file: !234, line: 99, baseType: !225, size: 64, offset: 2944)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "td_profileLength", scope: !235, file: !234, line: 102, baseType: !51, size: 32, offset: 3008)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "td_profileData", scope: !235, file: !234, line: 103, baseType: !37, size: 64, offset: 3072)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "td_photoshopLength", scope: !235, file: !234, line: 106, baseType: !51, size: 32, offset: 3136)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "td_photoshopData", scope: !235, file: !234, line: 107, baseType: !37, size: 64, offset: 3200)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "td_richtiffiptcLength", scope: !235, file: !234, line: 110, baseType: !51, size: 32, offset: 3264)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "td_richtiffiptcData", scope: !235, file: !234, line: 111, baseType: !37, size: 64, offset: 3328)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagefullwidth", scope: !235, file: !234, line: 114, baseType: !51, size: 32, offset: 3392)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagefulllength", scope: !235, file: !234, line: 114, baseType: !51, size: 32, offset: 3424)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "td_textureformat", scope: !235, file: !234, line: 115, baseType: !225, size: 64, offset: 3456)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "td_wrapmodes", scope: !235, file: !234, line: 116, baseType: !225, size: 64, offset: 3520)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "td_fovcot", scope: !235, file: !234, line: 117, baseType: !65, size: 32, offset: 3584)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "td_matrixWorldToScreen", scope: !235, file: !234, line: 118, baseType: !296, size: 64, offset: 3648)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "td_matrixWorldToCamera", scope: !235, file: !234, line: 119, baseType: !296, size: 64, offset: 3712)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header", scope: !222, file: !69, line: 93, baseType: !323, size: 64, offset: 4032)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeader", file: !17, line: 85, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 81, size: 64, elements: !325)
!325 = !{!326, !327, !328}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !324, file: !17, line: 82, baseType: !35, size: 16)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !324, file: !17, line: 83, baseType: !35, size: 16, offset: 16)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !324, file: !17, line: 84, baseType: !51, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientdir", scope: !222, file: !69, line: 94, baseType: !68, size: 64, offset: 4096)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tif_typeshift", scope: !222, file: !69, line: 95, baseType: !331, size: 64, offset: 4160)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tif_typemask", scope: !222, file: !69, line: 96, baseType: !334, size: 64, offset: 4224)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!336 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tif_row", scope: !222, file: !69, line: 97, baseType: !51, size: 32, offset: 4288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curdir", scope: !222, file: !69, line: 98, baseType: !339, size: 16, offset: 4320)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "tdir_t", file: !48, line: 69, baseType: !35)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curstrip", scope: !222, file: !69, line: 99, baseType: !289, size: 32, offset: 4352)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curoff", scope: !222, file: !69, line: 100, baseType: !230, size: 32, offset: 4384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dataoff", scope: !222, file: !69, line: 101, baseType: !230, size: 32, offset: 4416)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nsubifd", scope: !222, file: !69, line: 103, baseType: !35, size: 16, offset: 4448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tif_subifdoff", scope: !222, file: !69, line: 104, baseType: !230, size: 32, offset: 4480)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tif_col", scope: !222, file: !69, line: 107, baseType: !51, size: 32, offset: 4512)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curtile", scope: !222, file: !69, line: 108, baseType: !347, size: 32, offset: 4544)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ttile_t", file: !48, line: 72, baseType: !51)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tilesize", scope: !222, file: !69, line: 109, baseType: !349, size: 32, offset: 4576)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsize_t", file: !48, line: 73, baseType: !44)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupdecode", scope: !222, file: !69, line: 111, baseType: !351, size: 64, offset: 4608)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFBoolMethod", file: !69, line: 59, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!45, !220}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tif_predecode", scope: !222, file: !69, line: 112, baseType: !356, size: 64, offset: 4672)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPreMethod", file: !69, line: 60, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!45, !220, !360}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsample_t", file: !48, line: 70, baseType: !35)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupencode", scope: !222, file: !69, line: 113, baseType: !351, size: 64, offset: 4736)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tif_preencode", scope: !222, file: !69, line: 114, baseType: !356, size: 64, offset: 4800)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postencode", scope: !222, file: !69, line: 115, baseType: !351, size: 64, offset: 4864)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decoderow", scope: !222, file: !69, line: 116, baseType: !365, size: 64, offset: 4928)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCodeMethod", file: !69, line: 61, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!45, !220, !68, !349, !360}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encoderow", scope: !222, file: !69, line: 117, baseType: !365, size: 64, offset: 4992)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestrip", scope: !222, file: !69, line: 118, baseType: !365, size: 64, offset: 5056)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestrip", scope: !222, file: !69, line: 119, baseType: !365, size: 64, offset: 5120)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodetile", scope: !222, file: !69, line: 120, baseType: !365, size: 64, offset: 5184)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodetile", scope: !222, file: !69, line: 121, baseType: !365, size: 64, offset: 5248)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tif_close", scope: !222, file: !69, line: 122, baseType: !375, size: 64, offset: 5312)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVoidMethod", file: !69, line: 58, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !220}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seek", scope: !222, file: !69, line: 123, baseType: !380, size: 64, offset: 5376)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekMethod", file: !69, line: 62, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!45, !220, !51}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tif_cleanup", scope: !222, file: !69, line: 124, baseType: !375, size: 64, offset: 5440)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tif_defstripsize", scope: !222, file: !69, line: 125, baseType: !386, size: 64, offset: 5504)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFStripMethod", file: !69, line: 67, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!51, !220, !51}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tif_deftilesize", scope: !222, file: !69, line: 126, baseType: !391, size: 64, offset: 5568)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTileMethod", file: !69, line: 68, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !220, !50, !50}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tif_data", scope: !222, file: !69, line: 127, baseType: !68, size: 64, offset: 5632)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlinesize", scope: !222, file: !69, line: 129, baseType: !349, size: 32, offset: 5696)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlineskew", scope: !222, file: !69, line: 130, baseType: !349, size: 32, offset: 5728)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdata", scope: !222, file: !69, line: 131, baseType: !68, size: 64, offset: 5760)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdatasize", scope: !222, file: !69, line: 132, baseType: !349, size: 32, offset: 5824)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcp", scope: !222, file: !69, line: 133, baseType: !68, size: 64, offset: 5888)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcc", scope: !222, file: !69, line: 134, baseType: !349, size: 32, offset: 5952)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tif_base", scope: !222, file: !69, line: 136, baseType: !68, size: 64, offset: 6016)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tif_size", scope: !222, file: !69, line: 137, baseType: !230, size: 32, offset: 6080)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mapproc", scope: !222, file: !69, line: 138, baseType: !405, size: 64, offset: 6144)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFMapFileProc", file: !48, line: 206, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!45, !409, !410, !412}
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "thandle_t", file: !48, line: 88, baseType: !37)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "tdata_t", file: !48, line: 74, baseType: !37)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tif_unmapproc", scope: !222, file: !69, line: 139, baseType: !414, size: 64, offset: 6208)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFUnmapFileProc", file: !48, line: 207, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !409, !411, !230}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientdata", scope: !222, file: !69, line: 141, baseType: !409, size: 64, offset: 6272)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tif_readproc", scope: !222, file: !69, line: 142, baseType: !420, size: 64, offset: 6336)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFReadWriteProc", file: !48, line: 202, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!349, !409, !411, !349}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tif_writeproc", scope: !222, file: !69, line: 143, baseType: !420, size: 64, offset: 6400)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seekproc", scope: !222, file: !69, line: 144, baseType: !426, size: 64, offset: 6464)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekProc", file: !48, line: 203, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!230, !409, !230, !45}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tif_closeproc", scope: !222, file: !69, line: 145, baseType: !431, size: 64, offset: 6528)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCloseProc", file: !48, line: 204, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!45, !409}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tif_sizeproc", scope: !222, file: !69, line: 146, baseType: !436, size: 64, offset: 6592)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSizeProc", file: !48, line: 205, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!230, !409}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postdecode", scope: !222, file: !69, line: 148, baseType: !441, size: 64, offset: 6656)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPostMethod", file: !69, line: 63, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !220, !68, !349}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fieldinfo", scope: !222, file: !69, line: 150, baseType: !446, size: 64, offset: 6720)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldInfo", file: !234, line: 238, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 229, size: 192, elements: !450)
!450 = !{!451, !453, !455, !456, !458, !461, !462, !463}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "field_tag", scope: !449, file: !234, line: 230, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ttag_t", file: !48, line: 68, baseType: !51)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "field_readcount", scope: !449, file: !234, line: 231, baseType: !454, size: 16, offset: 32)
!454 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "field_writecount", scope: !449, file: !234, line: 232, baseType: !454, size: 16, offset: 48)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !449, file: !234, line: 233, baseType: !457, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDataType", file: !17, line: 134, baseType: !16)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "field_bit", scope: !449, file: !234, line: 234, baseType: !459, size: 16, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !40, line: 34, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !42, line: 32, baseType: !36)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "field_oktochange", scope: !449, file: !234, line: 235, baseType: !39, size: 8, offset: 112)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "field_passcount", scope: !449, file: !234, line: 236, baseType: !39, size: 8, offset: 120)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !449, file: !234, line: 237, baseType: !225, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfields", scope: !222, file: !69, line: 151, baseType: !45, size: 32, offset: 6784)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tif_vsetfield", scope: !222, file: !69, line: 152, baseType: !466, size: 64, offset: 6848)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVSetMethod", file: !69, line: 64, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!45, !220, !452, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !472)
!472 = !{!473, !474, !475, !476}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !471, file: !2, baseType: !18, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !471, file: !2, baseType: !18, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !471, file: !2, baseType: !37, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !471, file: !2, baseType: !37, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tif_vgetfield", scope: !222, file: !69, line: 153, baseType: !478, size: 64, offset: 6912)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVGetMethod", file: !69, line: 65, baseType: !467)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tif_printdir", scope: !222, file: !69, line: 154, baseType: !480, size: 64, offset: 6976)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPrintMethod", file: !69, line: 66, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !220, !484, !336}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !486, line: 7, baseType: !487)
!486 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !488, line: 49, size: 1728, elements: !489)
!488 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !505, !507, !508, !509, !511, !512, !514, !518, !521, !523, !526, !529, !530, !531, !534, !535}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !487, file: !488, line: 51, baseType: !45, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !487, file: !488, line: 54, baseType: !225, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !487, file: !488, line: 55, baseType: !225, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !487, file: !488, line: 56, baseType: !225, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !487, file: !488, line: 57, baseType: !225, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !487, file: !488, line: 58, baseType: !225, size: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !487, file: !488, line: 59, baseType: !225, size: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !487, file: !488, line: 60, baseType: !225, size: 64, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !487, file: !488, line: 61, baseType: !225, size: 64, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !487, file: !488, line: 64, baseType: !225, size: 64, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !487, file: !488, line: 65, baseType: !225, size: 64, offset: 640)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !487, file: !488, line: 66, baseType: !225, size: 64, offset: 704)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !487, file: !488, line: 68, baseType: !503, size: 64, offset: 768)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !488, line: 36, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !487, file: !488, line: 70, baseType: !506, size: 64, offset: 832)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !487, file: !488, line: 72, baseType: !45, size: 32, offset: 896)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !487, file: !488, line: 73, baseType: !45, size: 32, offset: 928)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !487, file: !488, line: 74, baseType: !510, size: 64, offset: 960)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !42, line: 152, baseType: !336)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !487, file: !488, line: 77, baseType: !36, size: 16, offset: 1024)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !487, file: !488, line: 78, baseType: !513, size: 8, offset: 1040)
!513 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !487, file: !488, line: 79, baseType: !515, size: 8, offset: 1048)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 1)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !487, file: !488, line: 81, baseType: !519, size: 64, offset: 1088)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !488, line: 43, baseType: null)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !487, file: !488, line: 89, baseType: !522, size: 64, offset: 1152)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !42, line: 153, baseType: !336)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !487, file: !488, line: 91, baseType: !524, size: 64, offset: 1216)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !488, line: 37, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !487, file: !488, line: 92, baseType: !527, size: 64, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !488, line: 38, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !487, file: !488, line: 93, baseType: !506, size: 64, offset: 1344)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !487, file: !488, line: 94, baseType: !37, size: 64, offset: 1408)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !487, file: !488, line: 95, baseType: !532, size: 64, offset: 1472)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !533, line: 18, baseType: !241)
!533 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !487, file: !488, line: 96, baseType: !45, size: 32, offset: 1536)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !487, file: !488, line: 98, baseType: !90, size: 160, offset: 1568)
!536 = !{}
!537 = !DILocalVariable(name: "tif", arg: 1, scope: !217, file: !2, line: 52, type: !220)
!538 = !DILocation(line: 52, column: 23, scope: !217)
!539 = !DILocalVariable(name: "emsg", arg: 2, scope: !217, file: !2, line: 52, type: !225)
!540 = !DILocation(line: 52, column: 33, scope: !217)
!541 = !DILocalVariable(name: "td", scope: !217, file: !2, line: 54, type: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!543 = !DILocation(line: 54, column: 20, scope: !217)
!544 = !DILocation(line: 54, column: 26, scope: !217)
!545 = !DILocation(line: 54, column: 31, scope: !217)
!546 = !DILocalVariable(name: "photometric", scope: !217, file: !2, line: 55, type: !35)
!547 = !DILocation(line: 55, column: 12, scope: !217)
!548 = !DILocalVariable(name: "colorchannels", scope: !217, file: !2, line: 56, type: !45)
!549 = !DILocation(line: 56, column: 9, scope: !217)
!550 = !DILocation(line: 58, column: 13, scope: !217)
!551 = !DILocation(line: 58, column: 17, scope: !217)
!552 = !DILocation(line: 58, column: 5, scope: !217)
!553 = !DILocation(line: 61, column: 2, scope: !554)
!554 = distinct !DILexicalBlock(scope: !217, file: !2, line: 58, column: 35)
!555 = !DILocation(line: 63, column: 10, scope: !554)
!556 = !DILocation(line: 64, column: 6, scope: !554)
!557 = !DILocation(line: 64, column: 10, scope: !554)
!558 = !DILocation(line: 63, column: 2, scope: !554)
!559 = !DILocation(line: 65, column: 2, scope: !554)
!560 = !DILocation(line: 67, column: 21, scope: !217)
!561 = !DILocation(line: 67, column: 25, scope: !217)
!562 = !DILocation(line: 67, column: 46, scope: !217)
!563 = !DILocation(line: 67, column: 50, scope: !217)
!564 = !DILocation(line: 67, column: 44, scope: !217)
!565 = !DILocation(line: 67, column: 19, scope: !217)
!566 = !DILocation(line: 68, column: 23, scope: !567)
!567 = distinct !DILexicalBlock(scope: !217, file: !2, line: 68, column: 9)
!568 = !DILocation(line: 68, column: 10, scope: !567)
!569 = !DILocation(line: 68, column: 9, scope: !567)
!570 = !DILocation(line: 69, column: 10, scope: !571)
!571 = distinct !DILexicalBlock(scope: !567, file: !2, line: 68, column: 64)
!572 = !DILocation(line: 69, column: 2, scope: !571)
!573 = !DILocation(line: 71, column: 18, scope: !574)
!574 = distinct !DILexicalBlock(scope: !571, file: !2, line: 69, column: 25)
!575 = !DILocation(line: 72, column: 6, scope: !574)
!576 = !DILocation(line: 74, column: 18, scope: !574)
!577 = !DILocation(line: 75, column: 6, scope: !574)
!578 = !DILocation(line: 77, column: 14, scope: !574)
!579 = !DILocation(line: 77, column: 6, scope: !574)
!580 = !DILocation(line: 78, column: 6, scope: !574)
!581 = !DILocation(line: 80, column: 5, scope: !571)
!582 = !DILocation(line: 81, column: 13, scope: !217)
!583 = !DILocation(line: 81, column: 5, scope: !217)
!584 = !DILocation(line: 85, column: 6, scope: !585)
!585 = distinct !DILexicalBlock(scope: !586, file: !2, line: 85, column: 6)
!586 = distinct !DILexicalBlock(scope: !217, file: !2, line: 81, column: 26)
!587 = !DILocation(line: 85, column: 10, scope: !585)
!588 = !DILocation(line: 85, column: 26, scope: !585)
!589 = !DILocation(line: 85, column: 49, scope: !585)
!590 = !DILocation(line: 85, column: 52, scope: !585)
!591 = !DILocation(line: 85, column: 56, scope: !585)
!592 = !DILocation(line: 85, column: 75, scope: !585)
!593 = !DILocation(line: 86, column: 14, scope: !594)
!594 = distinct !DILexicalBlock(scope: !585, file: !2, line: 85, column: 81)
!595 = !DILocation(line: 88, column: 13, scope: !594)
!596 = !DILocation(line: 89, column: 20, scope: !594)
!597 = !DILocation(line: 89, column: 24, scope: !594)
!598 = !DILocation(line: 86, column: 6, scope: !594)
!599 = !DILocation(line: 90, column: 6, scope: !594)
!600 = !DILocation(line: 92, column: 2, scope: !586)
!601 = !DILocation(line: 94, column: 6, scope: !602)
!602 = distinct !DILexicalBlock(scope: !586, file: !2, line: 94, column: 6)
!603 = !DILocation(line: 94, column: 10, scope: !602)
!604 = !DILocation(line: 94, column: 26, scope: !602)
!605 = !DILocation(line: 95, column: 14, scope: !606)
!606 = distinct !DILexicalBlock(scope: !602, file: !2, line: 94, column: 50)
!607 = !DILocation(line: 96, column: 26, scope: !606)
!608 = !DILocation(line: 96, column: 30, scope: !606)
!609 = !DILocation(line: 95, column: 6, scope: !606)
!610 = !DILocation(line: 97, column: 6, scope: !606)
!611 = !DILocation(line: 99, column: 2, scope: !586)
!612 = !DILocation(line: 101, column: 6, scope: !613)
!613 = distinct !DILexicalBlock(scope: !586, file: !2, line: 101, column: 6)
!614 = !DILocation(line: 101, column: 20, scope: !613)
!615 = !DILocation(line: 102, column: 14, scope: !616)
!616 = distinct !DILexicalBlock(scope: !613, file: !2, line: 101, column: 25)
!617 = !DILocation(line: 103, column: 21, scope: !616)
!618 = !DILocation(line: 102, column: 6, scope: !616)
!619 = !DILocation(line: 104, column: 6, scope: !616)
!620 = !DILocation(line: 106, column: 2, scope: !586)
!621 = !DILocation(line: 109, column: 6, scope: !622)
!622 = distinct !DILexicalBlock(scope: !586, file: !2, line: 109, column: 6)
!623 = !DILocation(line: 109, column: 10, scope: !622)
!624 = !DILocation(line: 109, column: 20, scope: !622)
!625 = !DILocation(line: 110, column: 14, scope: !626)
!626 = distinct !DILexicalBlock(scope: !622, file: !2, line: 109, column: 36)
!627 = !DILocation(line: 111, column: 13, scope: !626)
!628 = !DILocation(line: 111, column: 17, scope: !626)
!629 = !DILocation(line: 110, column: 6, scope: !626)
!630 = !DILocation(line: 112, column: 6, scope: !626)
!631 = !DILocation(line: 114, column: 6, scope: !632)
!632 = distinct !DILexicalBlock(scope: !586, file: !2, line: 114, column: 6)
!633 = !DILocation(line: 114, column: 10, scope: !632)
!634 = !DILocation(line: 114, column: 29, scope: !632)
!635 = !DILocation(line: 115, column: 14, scope: !636)
!636 = distinct !DILexicalBlock(scope: !632, file: !2, line: 114, column: 35)
!637 = !DILocation(line: 116, column: 20, scope: !636)
!638 = !DILocation(line: 116, column: 24, scope: !636)
!639 = !DILocation(line: 115, column: 6, scope: !636)
!640 = !DILocation(line: 117, column: 6, scope: !636)
!641 = !DILocation(line: 119, column: 2, scope: !586)
!642 = !DILocation(line: 122, column: 6, scope: !643)
!643 = distinct !DILexicalBlock(scope: !586, file: !2, line: 122, column: 6)
!644 = !DILocation(line: 122, column: 10, scope: !643)
!645 = !DILocation(line: 122, column: 25, scope: !643)
!646 = !DILocation(line: 123, column: 14, scope: !647)
!647 = distinct !DILexicalBlock(scope: !643, file: !2, line: 122, column: 48)
!648 = !DILocation(line: 123, column: 6, scope: !647)
!649 = !DILocation(line: 125, column: 6, scope: !647)
!650 = !DILocation(line: 127, column: 2, scope: !586)
!651 = !DILocation(line: 129, column: 6, scope: !652)
!652 = distinct !DILexicalBlock(scope: !586, file: !2, line: 129, column: 6)
!653 = !DILocation(line: 129, column: 10, scope: !652)
!654 = !DILocation(line: 129, column: 25, scope: !652)
!655 = !DILocation(line: 129, column: 47, scope: !652)
!656 = !DILocation(line: 130, column: 3, scope: !652)
!657 = !DILocation(line: 130, column: 7, scope: !652)
!658 = !DILocation(line: 130, column: 22, scope: !652)
!659 = !DILocation(line: 131, column: 14, scope: !660)
!660 = distinct !DILexicalBlock(scope: !652, file: !2, line: 130, column: 47)
!661 = !DILocation(line: 131, column: 6, scope: !660)
!662 = !DILocation(line: 133, column: 6, scope: !660)
!663 = !DILocation(line: 135, column: 6, scope: !664)
!664 = distinct !DILexicalBlock(scope: !586, file: !2, line: 135, column: 6)
!665 = !DILocation(line: 135, column: 10, scope: !664)
!666 = !DILocation(line: 135, column: 26, scope: !664)
!667 = !DILocation(line: 136, column: 14, scope: !668)
!668 = distinct !DILexicalBlock(scope: !664, file: !2, line: 135, column: 50)
!669 = !DILocation(line: 137, column: 26, scope: !668)
!670 = !DILocation(line: 137, column: 30, scope: !668)
!671 = !DILocation(line: 136, column: 6, scope: !668)
!672 = !DILocation(line: 138, column: 6, scope: !668)
!673 = !DILocation(line: 140, column: 2, scope: !586)
!674 = !DILocation(line: 142, column: 10, scope: !586)
!675 = !DILocation(line: 143, column: 16, scope: !586)
!676 = !DILocation(line: 142, column: 2, scope: !586)
!677 = !DILocation(line: 144, column: 2, scope: !586)
!678 = !DILocation(line: 146, column: 5, scope: !217)
!679 = !DILocation(line: 147, column: 1, scope: !217)
!680 = distinct !DISubprogram(name: "TIFFRGBAImageEnd", scope: !2, file: !2, line: 150, type: !681, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !536)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFRGBAImage", file: !48, line: 113, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TIFFRGBAImage", file: !48, line: 142, size: 960, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !704, !720, !721, !722, !723, !724, !725}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "tif", scope: !685, file: !48, line: 143, baseType: !220, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "stoponerr", scope: !685, file: !48, line: 144, baseType: !45, size: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "isContig", scope: !685, file: !48, line: 145, baseType: !45, size: 32, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !685, file: !48, line: 146, baseType: !45, size: 32, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !685, file: !48, line: 147, baseType: !51, size: 32, offset: 160)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !685, file: !48, line: 148, baseType: !51, size: 32, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "bitspersample", scope: !685, file: !48, line: 149, baseType: !35, size: 16, offset: 224)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "samplesperpixel", scope: !685, file: !48, line: 150, baseType: !35, size: 16, offset: 240)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !685, file: !48, line: 151, baseType: !35, size: 16, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "photometric", scope: !685, file: !48, line: 152, baseType: !35, size: 16, offset: 272)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "redcmap", scope: !685, file: !48, line: 153, baseType: !34, size: 64, offset: 320)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "greencmap", scope: !685, file: !48, line: 154, baseType: !34, size: 64, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bluecmap", scope: !685, file: !48, line: 155, baseType: !34, size: 64, offset: 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !685, file: !48, line: 157, baseType: !701, size: 64, offset: 512)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!45, !683, !50, !51, !51}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !685, file: !48, line: 162, baseType: !705, size: 64, offset: 576)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !685, file: !48, line: 158, size: 64, elements: !706)
!706 = !{!707, !709, !715}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !705, file: !48, line: 159, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "contig", scope: !705, file: !48, line: 160, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "tileContigRoutine", file: !48, line: 124, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !683, !50, !51, !51, !51, !51, !44, !44, !714}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "separate", scope: !705, file: !48, line: 161, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "tileSeparateRoutine", file: !48, line: 127, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !683, !50, !51, !51, !51, !51, !44, !44, !714, !714, !714, !714}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Map", scope: !685, file: !48, line: 163, baseType: !46, size: 64, offset: 640)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "BWmap", scope: !685, file: !48, line: 164, baseType: !49, size: 64, offset: 704)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "PALmap", scope: !685, file: !48, line: 165, baseType: !49, size: 64, offset: 768)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ycbcr", scope: !685, file: !48, line: 166, baseType: !52, size: 64, offset: 832)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "row_offset", scope: !685, file: !48, line: 168, baseType: !45, size: 32, offset: 896)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "col_offset", scope: !685, file: !48, line: 169, baseType: !45, size: 32, offset: 928)
!726 = !DILocalVariable(name: "img", arg: 1, scope: !680, file: !2, line: 150, type: !683)
!727 = !DILocation(line: 150, column: 33, scope: !680)
!728 = !DILocation(line: 152, column: 9, scope: !729)
!729 = distinct !DILexicalBlock(scope: !680, file: !2, line: 152, column: 9)
!730 = !DILocation(line: 152, column: 14, scope: !729)
!731 = !DILocation(line: 153, column: 12, scope: !729)
!732 = !DILocation(line: 153, column: 17, scope: !729)
!733 = !DILocation(line: 153, column: 2, scope: !729)
!734 = !DILocation(line: 153, column: 23, scope: !729)
!735 = !DILocation(line: 153, column: 28, scope: !729)
!736 = !DILocation(line: 153, column: 32, scope: !729)
!737 = !DILocation(line: 154, column: 9, scope: !738)
!738 = distinct !DILexicalBlock(scope: !680, file: !2, line: 154, column: 9)
!739 = !DILocation(line: 154, column: 14, scope: !738)
!740 = !DILocation(line: 155, column: 12, scope: !738)
!741 = !DILocation(line: 155, column: 17, scope: !738)
!742 = !DILocation(line: 155, column: 2, scope: !738)
!743 = !DILocation(line: 155, column: 25, scope: !738)
!744 = !DILocation(line: 155, column: 30, scope: !738)
!745 = !DILocation(line: 155, column: 36, scope: !738)
!746 = !DILocation(line: 156, column: 9, scope: !747)
!747 = distinct !DILexicalBlock(scope: !680, file: !2, line: 156, column: 9)
!748 = !DILocation(line: 156, column: 14, scope: !747)
!749 = !DILocation(line: 157, column: 12, scope: !747)
!750 = !DILocation(line: 157, column: 17, scope: !747)
!751 = !DILocation(line: 157, column: 2, scope: !747)
!752 = !DILocation(line: 157, column: 26, scope: !747)
!753 = !DILocation(line: 157, column: 31, scope: !747)
!754 = !DILocation(line: 157, column: 38, scope: !747)
!755 = !DILocation(line: 158, column: 9, scope: !756)
!756 = distinct !DILexicalBlock(scope: !680, file: !2, line: 158, column: 9)
!757 = !DILocation(line: 158, column: 14, scope: !756)
!758 = !DILocation(line: 159, column: 12, scope: !756)
!759 = !DILocation(line: 159, column: 17, scope: !756)
!760 = !DILocation(line: 159, column: 2, scope: !756)
!761 = !DILocation(line: 159, column: 25, scope: !756)
!762 = !DILocation(line: 159, column: 30, scope: !756)
!763 = !DILocation(line: 159, column: 36, scope: !756)
!764 = !DILocation(line: 161, column: 9, scope: !765)
!765 = distinct !DILexicalBlock(scope: !680, file: !2, line: 161, column: 9)
!766 = !DILocation(line: 161, column: 14, scope: !765)
!767 = !DILocation(line: 162, column: 20, scope: !768)
!768 = distinct !DILexicalBlock(scope: !765, file: !2, line: 161, column: 24)
!769 = !DILocation(line: 162, column: 25, scope: !768)
!770 = !DILocation(line: 162, column: 9, scope: !768)
!771 = !DILocation(line: 163, column: 20, scope: !768)
!772 = !DILocation(line: 163, column: 25, scope: !768)
!773 = !DILocation(line: 163, column: 9, scope: !768)
!774 = !DILocation(line: 164, column: 20, scope: !768)
!775 = !DILocation(line: 164, column: 25, scope: !768)
!776 = !DILocation(line: 164, column: 9, scope: !768)
!777 = !DILocation(line: 165, column: 5, scope: !768)
!778 = !DILocation(line: 166, column: 1, scope: !680)
!779 = distinct !DISubprogram(name: "TIFFRGBAImageBegin", scope: !2, file: !2, line: 180, type: !780, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !536)
!780 = !DISubroutineType(types: !781)
!781 = !{!45, !683, !220, !45, !225}
!782 = !DILocalVariable(name: "img", arg: 1, scope: !779, file: !2, line: 180, type: !683)
!783 = !DILocation(line: 180, column: 35, scope: !779)
!784 = !DILocalVariable(name: "tif", arg: 2, scope: !779, file: !2, line: 180, type: !220)
!785 = !DILocation(line: 180, column: 46, scope: !779)
!786 = !DILocalVariable(name: "stop", arg: 3, scope: !779, file: !2, line: 180, type: !45)
!787 = !DILocation(line: 180, column: 55, scope: !779)
!788 = !DILocalVariable(name: "emsg", arg: 4, scope: !779, file: !2, line: 180, type: !225)
