; ModuleID = 'cBench/consumer_tiff2bw/src/tif_aux.c'
source_filename = "cBench/consumer_tiff2bw/src/tif_aux.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.tiff = type { ptr, i32, i32, i32, i32, i32, %struct.TIFFDirectory, %struct.TIFFHeader, ptr, ptr, ptr, i32, i16, i32, i32, i32, i16, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, i32, ptr, i32, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, ptr }
%struct.TIFFDirectory = type { [3 x i64], i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i32, i16, i16, double, double, float, float, i16, i16, float, float, [2 x i16], [3 x ptr], [2 x i16], i16, ptr, double, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, ptr, i16, ptr, ptr, [2 x i16], i16, ptr, ptr, ptr, [3 x ptr], i16, i16, [2 x i16], i32, ptr, ptr, i32, ptr, i32, ptr, i32, ptr, i32, i32, ptr, ptr, float, ptr, ptr }
%struct.TIFFHeader = type { i16, i16, i32 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @TIFFVGetFieldDefaulted(ptr noundef %0, i32 noundef %1, ptr noundef %2) #0 !dbg !35 {
  %4 = alloca i32, align 4
  %5 = alloca ptr, align 8
  %6 = alloca i32, align 4
  %7 = alloca ptr, align 8
  %8 = alloca ptr, align 8
  store ptr %0, ptr %5, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1, producer: "clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !20, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tif_aux.c", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "fef19fe23a65dfc6cc85f6e39767b00c")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 120, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tiff.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "481b1fc81ef74ff952bf85d3f2d42aca")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!7 = !DIEnumerator(name: "TIFF_NOTYPE", value: 0)
!8 = !DIEnumerator(name: "TIFF_BYTE", value: 1)
!9 = !DIEnumerator(name: "TIFF_ASCII", value: 2)
!10 = !DIEnumerator(name: "TIFF_SHORT", value: 3)
!11 = !DIEnumerator(name: "TIFF_LONG", value: 4)
!12 = !DIEnumerator(name: "TIFF_RATIONAL", value: 5)
!13 = !DIEnumerator(name: "TIFF_SBYTE", value: 6)
!14 = !DIEnumerator(name: "TIFF_UNDEFINED", value: 7)
!15 = !DIEnumerator(name: "TIFF_SSHORT", value: 8)
!16 = !DIEnumerator(name: "TIFF_SLONG", value: 9)
!17 = !DIEnumerator(name: "TIFF_SRATIONAL", value: 10)
!18 = !DIEnumerator(name: "TIFF_FLOAT", value: 11)
!19 = !DIEnumerator(name: "TIFF_DOUBLE", value: 12)
!20 = !{!21, !23, !26, !24, !22}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !4, line: 62, baseType: !25)
!25 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!26 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!27 = !{i32 7, !"Dwarf Version", i32 5}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{i32 1, !"wchar_size", i32 4}
!30 = !{i32 8, !"PIC Level", i32 2}
!31 = !{i32 7, !"PIE Level", i32 2}
!32 = !{i32 7, !"uwtable", i32 2}
!33 = !{i32 7, !"frame-pointer", i32 2}
!34 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!35 = distinct !DISubprogram(name: "TIFFVGetFieldDefaulted", scope: !1, file: !1, line: 79, type: !36, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !371)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !39, !284, !364}
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !41, line: 48, baseType: !42)
!41 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tiffio.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "881752c035a7937b11611441903a05b9")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !43, line: 70, size: 7040, elements: !44)
!43 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tiffiop.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "6324af1ca1eb1b70648c0ebf381681c1")
!44 = !{!45, !48, !49, !50, !52, !55, !56, !150, !157, !162, !165, !169, !170, !172, !173, !174, !175, !176, !177, !178, !180, !182, !187, !193, !194, !195, !196, !201, !202, !203, !204, !205, !206, !211, !216, !217, !222, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !245, !250, !251, !256, !257, !262, !267, !272, !277, !298, !299, !302, !304}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tif_name", scope: !42, file: !43, line: 71, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fd", scope: !42, file: !43, line: 72, baseType: !38, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mode", scope: !42, file: !43, line: 73, baseType: !38, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tif_flags", scope: !42, file: !43, line: 74, baseType: !51, size: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !4, line: 66, baseType: !5)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tif_diroff", scope: !42, file: !43, line: 90, baseType: !53, size: 32, offset: 160)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "toff_t", file: !41, line: 75, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !4, line: 65, baseType: !38)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nextdiroff", scope: !42, file: !43, line: 91, baseType: !53, size: 32, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dir", scope: !42, file: !43, line: 92, baseType: !57, size: 3776, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDirectory", file: !58, line: 121, baseType: !59)
!58 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tif_dir.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "467bfe3104f8edda1690c4215d0ca70c")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 36, size: 3776, elements: !60)
!60 = !{!61, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !100, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !117, !118, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "td_fieldsset", scope: !59, file: !58, line: 39, baseType: !62, size: 192)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 192, elements: !68)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_long", file: !64, line: 36, baseType: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_long", file: !66, line: 34, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!67 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!68 = !{!69}
!69 = !DISubrange(count: 3)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagewidth", scope: !59, file: !58, line: 41, baseType: !51, size: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagelength", scope: !59, file: !58, line: 41, baseType: !51, size: 32, offset: 224)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagedepth", scope: !59, file: !58, line: 41, baseType: !51, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilewidth", scope: !59, file: !58, line: 42, baseType: !51, size: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilelength", scope: !59, file: !58, line: 42, baseType: !51, size: 32, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "td_tiledepth", scope: !59, file: !58, line: 42, baseType: !51, size: 32, offset: 352)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "td_subfiletype", scope: !59, file: !58, line: 43, baseType: !51, size: 32, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "td_bitspersample", scope: !59, file: !58, line: 44, baseType: !24, size: 16, offset: 416)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleformat", scope: !59, file: !58, line: 45, baseType: !24, size: 16, offset: 432)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "td_compression", scope: !59, file: !58, line: 46, baseType: !24, size: 16, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "td_photometric", scope: !59, file: !58, line: 47, baseType: !24, size: 16, offset: 464)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "td_threshholding", scope: !59, file: !58, line: 48, baseType: !24, size: 16, offset: 480)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "td_fillorder", scope: !59, file: !58, line: 49, baseType: !24, size: 16, offset: 496)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "td_orientation", scope: !59, file: !58, line: 50, baseType: !24, size: 16, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "td_samplesperpixel", scope: !59, file: !58, line: 51, baseType: !24, size: 16, offset: 528)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "td_rowsperstrip", scope: !59, file: !58, line: 52, baseType: !51, size: 32, offset: 544)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "td_minsamplevalue", scope: !59, file: !58, line: 53, baseType: !24, size: 16, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "td_maxsamplevalue", scope: !59, file: !58, line: 53, baseType: !24, size: 16, offset: 592)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "td_sminsamplevalue", scope: !59, file: !58, line: 54, baseType: !26, size: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "td_smaxsamplevalue", scope: !59, file: !58, line: 54, baseType: !26, size: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "td_xresolution", scope: !59, file: !58, line: 55, baseType: !22, size: 32, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "td_yresolution", scope: !59, file: !58, line: 55, baseType: !22, size: 32, offset: 800)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "td_resolutionunit", scope: !59, file: !58, line: 56, baseType: !24, size: 16, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "td_planarconfig", scope: !59, file: !58, line: 57, baseType: !24, size: 16, offset: 848)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "td_xposition", scope: !59, file: !58, line: 58, baseType: !22, size: 32, offset: 864)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "td_yposition", scope: !59, file: !58, line: 58, baseType: !22, size: 32, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "td_pagenumber", scope: !59, file: !58, line: 59, baseType: !97, size: 32, offset: 928)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 2)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "td_colormap", scope: !59, file: !58, line: 60, baseType: !101, size: 192, offset: 960)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 192, elements: !68)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "td_halftonehints", scope: !59, file: !58, line: 61, baseType: !97, size: 32, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "td_extrasamples", scope: !59, file: !58, line: 62, baseType: !24, size: 16, offset: 1184)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleinfo", scope: !59, file: !58, line: 63, baseType: !23, size: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "td_stonits", scope: !59, file: !58, line: 64, baseType: !26, size: 64, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "td_documentname", scope: !59, file: !58, line: 65, baseType: !46, size: 64, offset: 1344)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "td_artist", scope: !59, file: !58, line: 66, baseType: !46, size: 64, offset: 1408)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "td_datetime", scope: !59, file: !58, line: 67, baseType: !46, size: 64, offset: 1472)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "td_hostcomputer", scope: !59, file: !58, line: 68, baseType: !46, size: 64, offset: 1536)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagedescription", scope: !59, file: !58, line: 69, baseType: !46, size: 64, offset: 1600)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "td_make", scope: !59, file: !58, line: 70, baseType: !46, size: 64, offset: 1664)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "td_model", scope: !59, file: !58, line: 71, baseType: !46, size: 64, offset: 1728)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "td_software", scope: !59, file: !58, line: 72, baseType: !46, size: 64, offset: 1792)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "td_pagename", scope: !59, file: !58, line: 73, baseType: !46, size: 64, offset: 1856)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripsperimage", scope: !59, file: !58, line: 74, baseType: !116, size: 32, offset: 1920)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "tstrip_t", file: !41, line: 71, baseType: !51)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "td_nstrips", scope: !59, file: !58, line: 75, baseType: !116, size: 32, offset: 1952)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripoffset", scope: !59, file: !58, line: 76, baseType: !119, size: 64, offset: 1984)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecount", scope: !59, file: !58, line: 77, baseType: !119, size: 64, offset: 2048)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "td_nsubifd", scope: !59, file: !58, line: 79, baseType: !24, size: 16, offset: 2112)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "td_subifd", scope: !59, file: !58, line: 80, baseType: !119, size: 64, offset: 2176)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrcoeffs", scope: !59, file: !58, line: 83, baseType: !21, size: 64, offset: 2240)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrsubsampling", scope: !59, file: !58, line: 84, baseType: !97, size: 32, offset: 2304)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrpositioning", scope: !59, file: !58, line: 85, baseType: !24, size: 16, offset: 2336)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "td_whitepoint", scope: !59, file: !58, line: 88, baseType: !21, size: 64, offset: 2368)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "td_primarychromas", scope: !59, file: !58, line: 89, baseType: !21, size: 64, offset: 2432)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "td_refblackwhite", scope: !59, file: !58, line: 90, baseType: !21, size: 64, offset: 2496)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "td_transferfunction", scope: !59, file: !58, line: 91, baseType: !101, size: 192, offset: 2560)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "td_inkset", scope: !59, file: !58, line: 94, baseType: !24, size: 16, offset: 2752)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "td_ninks", scope: !59, file: !58, line: 95, baseType: !24, size: 16, offset: 2768)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "td_dotrange", scope: !59, file: !58, line: 96, baseType: !97, size: 32, offset: 2784)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknameslen", scope: !59, file: !58, line: 97, baseType: !38, size: 32, offset: 2816)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknames", scope: !59, file: !58, line: 98, baseType: !46, size: 64, offset: 2880)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "td_targetprinter", scope: !59, file: !58, line: 99, baseType: !46, size: 64, offset: 2944)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "td_profileLength", scope: !59, file: !58, line: 102, baseType: !51, size: 32, offset: 3008)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "td_profileData", scope: !59, file: !58, line: 103, baseType: !138, size: 64, offset: 3072)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "td_photoshopLength", scope: !59, file: !58, line: 106, baseType: !51, size: 32, offset: 3136)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "td_photoshopData", scope: !59, file: !58, line: 107, baseType: !138, size: 64, offset: 3200)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "td_richtiffiptcLength", scope: !59, file: !58, line: 110, baseType: !51, size: 32, offset: 3264)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "td_richtiffiptcData", scope: !59, file: !58, line: 111, baseType: !138, size: 64, offset: 3328)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagefullwidth", scope: !59, file: !58, line: 114, baseType: !51, size: 32, offset: 3392)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagefulllength", scope: !59, file: !58, line: 114, baseType: !51, size: 32, offset: 3424)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "td_textureformat", scope: !59, file: !58, line: 115, baseType: !46, size: 64, offset: 3456)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "td_wrapmodes", scope: !59, file: !58, line: 116, baseType: !46, size: 64, offset: 3520)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "td_fovcot", scope: !59, file: !58, line: 117, baseType: !22, size: 32, offset: 3584)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "td_matrixWorldToScreen", scope: !59, file: !58, line: 118, baseType: !21, size: 64, offset: 3648)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "td_matrixWorldToCamera", scope: !59, file: !58, line: 119, baseType: !21, size: 64, offset: 3712)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header", scope: !42, file: !43, line: 93, baseType: !151, size: 64, offset: 4032)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeader", file: !4, line: 85, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 81, size: 64, elements: !153)
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !152, file: !4, line: 82, baseType: !24, size: 16)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !152, file: !4, line: 83, baseType: !24, size: 16, offset: 16)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !152, file: !4, line: 84, baseType: !51, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientdir", scope: !42, file: !43, line: 94, baseType: !158, size: 64, offset: 4096)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "tidata_t", file: !43, line: 56, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "tidataval_t", file: !43, line: 55, baseType: !161)
!161 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tif_typeshift", scope: !42, file: !43, line: 95, baseType: !163, size: 64, offset: 4160)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tif_typemask", scope: !42, file: !43, line: 96, baseType: !166, size: 64, offset: 4224)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tif_row", scope: !42, file: !43, line: 97, baseType: !51, size: 32, offset: 4288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curdir", scope: !42, file: !43, line: 98, baseType: !171, size: 16, offset: 4320)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "tdir_t", file: !41, line: 69, baseType: !24)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curstrip", scope: !42, file: !43, line: 99, baseType: !116, size: 32, offset: 4352)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curoff", scope: !42, file: !43, line: 100, baseType: !53, size: 32, offset: 4384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dataoff", scope: !42, file: !43, line: 101, baseType: !53, size: 32, offset: 4416)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nsubifd", scope: !42, file: !43, line: 103, baseType: !24, size: 16, offset: 4448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tif_subifdoff", scope: !42, file: !43, line: 104, baseType: !53, size: 32, offset: 4480)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tif_col", scope: !42, file: !43, line: 107, baseType: !51, size: 32, offset: 4512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curtile", scope: !42, file: !43, line: 108, baseType: !179, size: 32, offset: 4544)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ttile_t", file: !41, line: 72, baseType: !51)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tilesize", scope: !42, file: !43, line: 109, baseType: !181, size: 32, offset: 4576)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsize_t", file: !41, line: 73, baseType: !54)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupdecode", scope: !42, file: !43, line: 111, baseType: !183, size: 64, offset: 4608)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFBoolMethod", file: !43, line: 59, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!38, !39}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tif_predecode", scope: !42, file: !43, line: 112, baseType: !188, size: 64, offset: 4672)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPreMethod", file: !43, line: 60, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!38, !39, !192}
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsample_t", file: !41, line: 70, baseType: !24)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupencode", scope: !42, file: !43, line: 113, baseType: !183, size: 64, offset: 4736)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tif_preencode", scope: !42, file: !43, line: 114, baseType: !188, size: 64, offset: 4800)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postencode", scope: !42, file: !43, line: 115, baseType: !183, size: 64, offset: 4864)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decoderow", scope: !42, file: !43, line: 116, baseType: !197, size: 64, offset: 4928)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCodeMethod", file: !43, line: 61, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!38, !39, !158, !181, !192}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encoderow", scope: !42, file: !43, line: 117, baseType: !197, size: 64, offset: 4992)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestrip", scope: !42, file: !43, line: 118, baseType: !197, size: 64, offset: 5056)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestrip", scope: !42, file: !43, line: 119, baseType: !197, size: 64, offset: 5120)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodetile", scope: !42, file: !43, line: 120, baseType: !197, size: 64, offset: 5184)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodetile", scope: !42, file: !43, line: 121, baseType: !197, size: 64, offset: 5248)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tif_close", scope: !42, file: !43, line: 122, baseType: !207, size: 64, offset: 5312)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVoidMethod", file: !43, line: 58, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !39}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seek", scope: !42, file: !43, line: 123, baseType: !212, size: 64, offset: 5376)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekMethod", file: !43, line: 62, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!38, !39, !51}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tif_cleanup", scope: !42, file: !43, line: 124, baseType: !207, size: 64, offset: 5440)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tif_defstripsize", scope: !42, file: !43, line: 125, baseType: !218, size: 64, offset: 5504)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFStripMethod", file: !43, line: 67, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!51, !39, !51}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tif_deftilesize", scope: !42, file: !43, line: 126, baseType: !223, size: 64, offset: 5568)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTileMethod", file: !43, line: 68, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !39, !119, !119}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tif_data", scope: !42, file: !43, line: 127, baseType: !158, size: 64, offset: 5632)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlinesize", scope: !42, file: !43, line: 129, baseType: !181, size: 32, offset: 5696)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlineskew", scope: !42, file: !43, line: 130, baseType: !181, size: 32, offset: 5728)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdata", scope: !42, file: !43, line: 131, baseType: !158, size: 64, offset: 5760)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdatasize", scope: !42, file: !43, line: 132, baseType: !181, size: 32, offset: 5824)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcp", scope: !42, file: !43, line: 133, baseType: !158, size: 64, offset: 5888)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcc", scope: !42, file: !43, line: 134, baseType: !181, size: 32, offset: 5952)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tif_base", scope: !42, file: !43, line: 136, baseType: !158, size: 64, offset: 6016)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tif_size", scope: !42, file: !43, line: 137, baseType: !53, size: 32, offset: 6080)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mapproc", scope: !42, file: !43, line: 138, baseType: !237, size: 64, offset: 6144)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFMapFileProc", file: !41, line: 206, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!38, !241, !242, !244}
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "thandle_t", file: !41, line: 88, baseType: !138)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "tdata_t", file: !41, line: 74, baseType: !138)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tif_unmapproc", scope: !42, file: !43, line: 139, baseType: !246, size: 64, offset: 6208)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFUnmapFileProc", file: !41, line: 207, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !241, !243, !53}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientdata", scope: !42, file: !43, line: 141, baseType: !241, size: 64, offset: 6272)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tif_readproc", scope: !42, file: !43, line: 142, baseType: !252, size: 64, offset: 6336)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFReadWriteProc", file: !41, line: 202, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!181, !241, !243, !181}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tif_writeproc", scope: !42, file: !43, line: 143, baseType: !252, size: 64, offset: 6400)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seekproc", scope: !42, file: !43, line: 144, baseType: !258, size: 64, offset: 6464)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekProc", file: !41, line: 203, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!53, !241, !53, !38}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tif_closeproc", scope: !42, file: !43, line: 145, baseType: !263, size: 64, offset: 6528)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCloseProc", file: !41, line: 204, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!38, !241}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tif_sizeproc", scope: !42, file: !43, line: 146, baseType: !268, size: 64, offset: 6592)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSizeProc", file: !41, line: 205, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!53, !241}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postdecode", scope: !42, file: !43, line: 148, baseType: !273, size: 64, offset: 6656)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPostMethod", file: !43, line: 63, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !39, !158, !181}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fieldinfo", scope: !42, file: !43, line: 150, baseType: !278, size: 64, offset: 6720)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldInfo", file: !58, line: 238, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 229, size: 192, elements: !282)
!282 = !{!283, !285, !287, !288, !290, !293, !296, !297}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "field_tag", scope: !281, file: !58, line: 230, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ttag_t", file: !41, line: 68, baseType: !51)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "field_readcount", scope: !281, file: !58, line: 231, baseType: !286, size: 16, offset: 32)
!286 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "field_writecount", scope: !281, file: !58, line: 232, baseType: !286, size: 16, offset: 48)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !281, file: !58, line: 233, baseType: !289, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDataType", file: !4, line: 134, baseType: !3)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "field_bit", scope: !281, file: !58, line: 234, baseType: !291, size: 16, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !64, line: 34, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !66, line: 32, baseType: !25)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "field_oktochange", scope: !281, file: !58, line: 235, baseType: !294, size: 8, offset: 112)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !64, line: 33, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !66, line: 31, baseType: !161)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "field_passcount", scope: !281, file: !58, line: 236, baseType: !294, size: 8, offset: 120)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !281, file: !58, line: 237, baseType: !46, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfields", scope: !42, file: !43, line: 151, baseType: !38, size: 32, offset: 6784)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tif_vsetfield", scope: !42, file: !43, line: 152, baseType: !300, size: 64, offset: 6848)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVSetMethod", file: !43, line: 64, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tif_vgetfield", scope: !42, file: !43, line: 153, baseType: !303, size: 64, offset: 6912)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVGetMethod", file: !43, line: 65, baseType: !301)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tif_printdir", scope: !42, file: !43, line: 154, baseType: !305, size: 64, offset: 6976)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPrintMethod", file: !43, line: 66, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !39, !309, !168}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !311, line: 7, baseType: !312)
!311 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !313, line: 49, size: 1728, elements: !314)
!313 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !330, !332, !333, !334, !336, !337, !339, !343, !346, !348, !351, !354, !355, !356, !359, !360}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !312, file: !313, line: 51, baseType: !38, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !312, file: !313, line: 54, baseType: !46, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !312, file: !313, line: 55, baseType: !46, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !312, file: !313, line: 56, baseType: !46, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !312, file: !313, line: 57, baseType: !46, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !312, file: !313, line: 58, baseType: !46, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !312, file: !313, line: 59, baseType: !46, size: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !312, file: !313, line: 60, baseType: !46, size: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !312, file: !313, line: 61, baseType: !46, size: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !312, file: !313, line: 64, baseType: !46, size: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !312, file: !313, line: 65, baseType: !46, size: 64, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !312, file: !313, line: 66, baseType: !46, size: 64, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !312, file: !313, line: 68, baseType: !328, size: 64, offset: 768)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !313, line: 36, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !312, file: !313, line: 70, baseType: !331, size: 64, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !312, file: !313, line: 72, baseType: !38, size: 32, offset: 896)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !312, file: !313, line: 73, baseType: !38, size: 32, offset: 928)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !312, file: !313, line: 74, baseType: !335, size: 64, offset: 960)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !66, line: 152, baseType: !168)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !312, file: !313, line: 77, baseType: !25, size: 16, offset: 1024)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !312, file: !313, line: 78, baseType: !338, size: 8, offset: 1040)
!338 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !312, file: !313, line: 79, baseType: !340, size: 8, offset: 1048)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 1)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !312, file: !313, line: 81, baseType: !344, size: 64, offset: 1088)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !313, line: 43, baseType: null)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !312, file: !313, line: 89, baseType: !347, size: 64, offset: 1152)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !66, line: 153, baseType: !168)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !312, file: !313, line: 91, baseType: !349, size: 64, offset: 1216)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !313, line: 37, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !312, file: !313, line: 92, baseType: !352, size: 64, offset: 1280)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !313, line: 38, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !312, file: !313, line: 93, baseType: !331, size: 64, offset: 1344)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !312, file: !313, line: 94, baseType: !138, size: 64, offset: 1408)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !312, file: !313, line: 95, baseType: !357, size: 64, offset: 1472)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !358, line: 18, baseType: !67)
!358 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !312, file: !313, line: 96, baseType: !38, size: 32, offset: 1536)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !312, file: !313, line: 98, baseType: !361, size: 160, offset: 1568)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 20)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !366)
!366 = !{!367, !368, !369, !370}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !365, file: !1, baseType: !5, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !365, file: !1, baseType: !5, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !365, file: !1, baseType: !138, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !365, file: !1, baseType: !138, size: 64, offset: 128)
!371 = !{}
!372 = !DILocalVariable(name: "tif", arg: 1, scope: !35, file: !1, line: 79, type: !39)
!373 = !DILocation(line: 79, column: 30, scope: !35)
!374 = !DILocalVariable(name: "tag", arg: 2, scope: !35, file: !1, line: 79, type: !284)
!375 = !DILocation(line: 79, column: 42, scope: !35)
!376 = !DILocalVariable(name: "ap", arg: 3, scope: !35, file: !1, line: 79, type: !364)
!377 = !DILocation(line: 79, column: 55, scope: !35)
!378 = !DILocalVariable(name: "td", scope: !35, file: !1, line: 81, type: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!380 = !DILocation(line: 81, column: 17, scope: !35)
!381 = !DILocation(line: 81, column: 23, scope: !35)
!382 = !DILocation(line: 81, column: 28, scope: !35)
!383 = !DILocation(line: 83, column: 20, scope: !384)
!384 = distinct !DILexicalBlock(scope: !35, file: !1, line: 83, column: 6)
!385 = !DILocation(line: 83, column: 25, scope: !384)
!386 = !DILocation(line: 83, column: 30, scope: !384)
!387 = !DILocation(line: 83, column: 6, scope: !384)
!388 = !DILocation(line: 84, column: 3, scope: !384)
!389 = !DILocation(line: 85, column: 10, scope: !35)
!390 = !DILocation(line: 85, column: 2, scope: !35)
!391 = !DILocation(line: 87, column: 27, scope: !392)
!392 = distinct !DILexicalBlock(scope: !35, file: !1, line: 85, column: 15)
!393 = !DILocation(line: 87, column: 31, scope: !392)
!394 = !DILocation(line: 87, column: 4, scope: !392)
!395 = !DILocation(line: 87, column: 25, scope: !392)
!396 = !DILocation(line: 88, column: 3, scope: !392)
!397 = !DILocation(line: 90, column: 27, scope: !392)
!398 = !DILocation(line: 90, column: 31, scope: !392)
!399 = !DILocation(line: 90, column: 4, scope: !392)
!400 = !DILocation(line: 90, column: 25, scope: !392)
!401 = !DILocation(line: 91, column: 3, scope: !392)
!402 = !DILocation(line: 93, column: 27, scope: !392)
!403 = !DILocation(line: 93, column: 31, scope: !392)
!404 = !DILocation(line: 93, column: 4, scope: !392)
!405 = !DILocation(line: 93, column: 25, scope: !392)
!406 = !DILocation(line: 94, column: 3, scope: !392)
!407 = !DILocation(line: 96, column: 27, scope: !392)
!408 = !DILocation(line: 96, column: 31, scope: !392)
!409 = !DILocation(line: 96, column: 4, scope: !392)
!410 = !DILocation(line: 96, column: 25, scope: !392)
!411 = !DILocation(line: 97, column: 3, scope: !392)
!412 = !DILocation(line: 99, column: 27, scope: !392)
!413 = !DILocation(line: 99, column: 31, scope: !392)
!414 = !DILocation(line: 99, column: 4, scope: !392)
!415 = !DILocation(line: 99, column: 25, scope: !392)
!416 = !DILocation(line: 100, column: 3, scope: !392)
!417 = !DILocation(line: 102, column: 27, scope: !392)
!418 = !DILocation(line: 102, column: 31, scope: !392)
!419 = !DILocation(line: 102, column: 4, scope: !392)
!420 = !DILocation(line: 102, column: 25, scope: !392)
!421 = !DILocation(line: 103, column: 3, scope: !392)
!422 = !DILocation(line: 105, column: 27, scope: !392)
!423 = !DILocation(line: 105, column: 31, scope: !392)
!424 = !DILocation(line: 105, column: 4, scope: !392)
!425 = !DILocation(line: 105, column: 25, scope: !392)
!426 = !DILocation(line: 106, column: 3, scope: !392)
!427 = !DILocation(line: 108, column: 27, scope: !392)
!428 = !DILocation(line: 108, column: 31, scope: !392)
!429 = !DILocation(line: 108, column: 4, scope: !392)
!430 = !DILocation(line: 108, column: 25, scope: !392)
!431 = !DILocation(line: 109, column: 3, scope: !392)
!432 = !DILocation(line: 111, column: 27, scope: !392)
!433 = !DILocation(line: 111, column: 31, scope: !392)
!434 = !DILocation(line: 111, column: 4, scope: !392)
!435 = !DILocation(line: 111, column: 25, scope: !392)
!436 = !DILocation(line: 112, column: 3, scope: !392)
!437 = !DILocation(line: 114, column: 27, scope: !392)
!438 = !DILocation(line: 114, column: 31, scope: !392)
!439 = !DILocation(line: 114, column: 4, scope: !392)
