; ModuleID = 'cBench/consumer_tiff2bw/src/tif_dirwrite.c'
source_filename = "cBench/consumer_tiff2bw/src/tif_dirwrite.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.tiff = type { ptr, i32, i32, i32, i32, i32, %struct.TIFFDirectory, %struct.TIFFHeader, ptr, ptr, ptr, i32, i16, i32, i32, i32, i16, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, i32, ptr, i32, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, ptr }
%struct.TIFFDirectory = type { [3 x i64], i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i32, i16, i16, double, double, float, float, i16, i16, float, float, [2 x i16], [3 x ptr], [2 x i16], i16, ptr, double, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, ptr, ptr, i16, ptr, ptr, [2 x i16], i16, ptr, ptr, ptr, [3 x ptr], i16, i16, [2 x i16], i32, ptr, ptr, i32, ptr, i32, ptr, i32, ptr, i32, i32, ptr, ptr, float, ptr, ptr }
%struct.TIFFHeader = type { i16, i16, i32 }
%struct.TIFFFieldInfo = type { i32, i16, i16, i32, i16, i8, i8, ptr }
%struct.TIFFDirEntry = type { i16, i16, i32, i32 }

@.str = private unnamed_addr constant [43 x i8] c"Error post-encoding before directory write\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [43 x i8] c"Error flushing data before directory write\00", align 1, !dbg !7

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tif_dirwrite.c", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "d4e4304231b6ab523ea7144fc7aa3af4")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 43)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 126, type: !3, isLocal: true, isDefinition: true)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !11, isLocal: true, isDefinition: true)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !12)
!12 = !{!13}
!13 = !DISubrange(count: 37)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(scope: null, file: !2, line: 342, type: !16, isLocal: true, isDefinition: true)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !17)
!17 = !{!18}
!18 = !DISubrange(count: 30)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(scope: null, file: !2, line: 346, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 33)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(scope: null, file: !2, line: 350, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 29)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !2, line: 940, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 34)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !2, line: 723, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 65)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "module", scope: !41, file: !2, line: 952, type: !438, isLocal: true, isDefinition: true)
!41 = distinct !DISubprogram(name: "TIFFLinkDirectory", scope: !2, file: !2, line: 950, type: !42, scopeLine: 951, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !399, retainedNodes: !437)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !45}
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFF", file: !47, line: 48, baseType: !48)
!47 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tiffio.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "881752c035a7937b11611441903a05b9")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tiff", file: !49, line: 70, size: 7040, elements: !50)
!49 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tiffiop.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "6324af1ca1eb1b70648c0ebf381681c1")
!50 = !{!51, !53, !54, !55, !59, !62, !63, !163, !170, !175, !178, !182, !183, !185, !186, !187, !188, !189, !190, !191, !193, !195, !198, !204, !205, !206, !207, !212, !213, !214, !215, !216, !217, !222, !227, !228, !233, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !256, !261, !262, !267, !268, !273, !278, !283, !288, !324, !325, !337, !339}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tif_name", scope: !48, file: !49, line: 71, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fd", scope: !48, file: !49, line: 72, baseType: !44, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mode", scope: !48, file: !49, line: 73, baseType: !44, size: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tif_flags", scope: !48, file: !49, line: 74, baseType: !56, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !57, line: 66, baseType: !58)
!57 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tiff.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "481b1fc81ef74ff952bf85d3f2d42aca")
!58 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tif_diroff", scope: !48, file: !49, line: 90, baseType: !60, size: 32, offset: 160)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "toff_t", file: !47, line: 75, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !57, line: 65, baseType: !44)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nextdiroff", scope: !48, file: !49, line: 91, baseType: !60, size: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dir", scope: !48, file: !49, line: 92, baseType: !64, size: 3776, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDirectory", file: !65, line: 121, baseType: !66)
!65 = !DIFile(filename: "cBench/consumer_tiff2bw/src/tif_dir.h", directory: "/n/eecs583b/home/adahad/hw0", checksumkind: CSK_MD5, checksum: "467bfe3104f8edda1690c4215d0ca70c")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 36, size: 3776, elements: !67)
!67 = !{!68, !77, !78, !79, !80, !81, !82, !83, !84, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !99, !100, !102, !103, !104, !105, !106, !107, !111, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !129, !130, !132, !133, !134, !135, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "td_fieldsset", scope: !66, file: !65, line: 39, baseType: !69, size: 192)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 192, elements: !75)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_long", file: !71, line: 36, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_long", file: !73, line: 34, baseType: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!74 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!75 = !{!76}
!76 = !DISubrange(count: 3)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagewidth", scope: !66, file: !65, line: 41, baseType: !56, size: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagelength", scope: !66, file: !65, line: 41, baseType: !56, size: 32, offset: 224)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagedepth", scope: !66, file: !65, line: 41, baseType: !56, size: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilewidth", scope: !66, file: !65, line: 42, baseType: !56, size: 32, offset: 288)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "td_tilelength", scope: !66, file: !65, line: 42, baseType: !56, size: 32, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "td_tiledepth", scope: !66, file: !65, line: 42, baseType: !56, size: 32, offset: 352)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "td_subfiletype", scope: !66, file: !65, line: 43, baseType: !56, size: 32, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "td_bitspersample", scope: !66, file: !65, line: 44, baseType: !85, size: 16, offset: 416)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !57, line: 62, baseType: !86)
!86 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleformat", scope: !66, file: !65, line: 45, baseType: !85, size: 16, offset: 432)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "td_compression", scope: !66, file: !65, line: 46, baseType: !85, size: 16, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "td_photometric", scope: !66, file: !65, line: 47, baseType: !85, size: 16, offset: 464)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "td_threshholding", scope: !66, file: !65, line: 48, baseType: !85, size: 16, offset: 480)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "td_fillorder", scope: !66, file: !65, line: 49, baseType: !85, size: 16, offset: 496)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "td_orientation", scope: !66, file: !65, line: 50, baseType: !85, size: 16, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "td_samplesperpixel", scope: !66, file: !65, line: 51, baseType: !85, size: 16, offset: 528)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "td_rowsperstrip", scope: !66, file: !65, line: 52, baseType: !56, size: 32, offset: 544)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "td_minsamplevalue", scope: !66, file: !65, line: 53, baseType: !85, size: 16, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "td_maxsamplevalue", scope: !66, file: !65, line: 53, baseType: !85, size: 16, offset: 592)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "td_sminsamplevalue", scope: !66, file: !65, line: 54, baseType: !98, size: 64, offset: 640)
!98 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "td_smaxsamplevalue", scope: !66, file: !65, line: 54, baseType: !98, size: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "td_xresolution", scope: !66, file: !65, line: 55, baseType: !101, size: 32, offset: 768)
!101 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "td_yresolution", scope: !66, file: !65, line: 55, baseType: !101, size: 32, offset: 800)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "td_resolutionunit", scope: !66, file: !65, line: 56, baseType: !85, size: 16, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "td_planarconfig", scope: !66, file: !65, line: 57, baseType: !85, size: 16, offset: 848)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "td_xposition", scope: !66, file: !65, line: 58, baseType: !101, size: 32, offset: 864)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "td_yposition", scope: !66, file: !65, line: 58, baseType: !101, size: 32, offset: 896)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "td_pagenumber", scope: !66, file: !65, line: 59, baseType: !108, size: 32, offset: 928)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 32, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 2)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "td_colormap", scope: !66, file: !65, line: 60, baseType: !112, size: 192, offset: 960)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 192, elements: !75)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "td_halftonehints", scope: !66, file: !65, line: 61, baseType: !108, size: 32, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "td_extrasamples", scope: !66, file: !65, line: 62, baseType: !85, size: 16, offset: 1184)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "td_sampleinfo", scope: !66, file: !65, line: 63, baseType: !113, size: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "td_stonits", scope: !66, file: !65, line: 64, baseType: !98, size: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "td_documentname", scope: !66, file: !65, line: 65, baseType: !52, size: 64, offset: 1344)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "td_artist", scope: !66, file: !65, line: 66, baseType: !52, size: 64, offset: 1408)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "td_datetime", scope: !66, file: !65, line: 67, baseType: !52, size: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "td_hostcomputer", scope: !66, file: !65, line: 68, baseType: !52, size: 64, offset: 1536)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagedescription", scope: !66, file: !65, line: 69, baseType: !52, size: 64, offset: 1600)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "td_make", scope: !66, file: !65, line: 70, baseType: !52, size: 64, offset: 1664)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "td_model", scope: !66, file: !65, line: 71, baseType: !52, size: 64, offset: 1728)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "td_software", scope: !66, file: !65, line: 72, baseType: !52, size: 64, offset: 1792)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "td_pagename", scope: !66, file: !65, line: 73, baseType: !52, size: 64, offset: 1856)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripsperimage", scope: !66, file: !65, line: 74, baseType: !128, size: 32, offset: 1920)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "tstrip_t", file: !47, line: 71, baseType: !56)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "td_nstrips", scope: !66, file: !65, line: 75, baseType: !128, size: 32, offset: 1952)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripoffset", scope: !66, file: !65, line: 76, baseType: !131, size: 64, offset: 1984)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "td_stripbytecount", scope: !66, file: !65, line: 77, baseType: !131, size: 64, offset: 2048)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "td_nsubifd", scope: !66, file: !65, line: 79, baseType: !85, size: 16, offset: 2112)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "td_subifd", scope: !66, file: !65, line: 80, baseType: !131, size: 64, offset: 2176)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrcoeffs", scope: !66, file: !65, line: 83, baseType: !136, size: 64, offset: 2240)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrsubsampling", scope: !66, file: !65, line: 84, baseType: !108, size: 32, offset: 2304)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "td_ycbcrpositioning", scope: !66, file: !65, line: 85, baseType: !85, size: 16, offset: 2336)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "td_whitepoint", scope: !66, file: !65, line: 88, baseType: !136, size: 64, offset: 2368)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "td_primarychromas", scope: !66, file: !65, line: 89, baseType: !136, size: 64, offset: 2432)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "td_refblackwhite", scope: !66, file: !65, line: 90, baseType: !136, size: 64, offset: 2496)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "td_transferfunction", scope: !66, file: !65, line: 91, baseType: !112, size: 192, offset: 2560)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "td_inkset", scope: !66, file: !65, line: 94, baseType: !85, size: 16, offset: 2752)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "td_ninks", scope: !66, file: !65, line: 95, baseType: !85, size: 16, offset: 2768)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "td_dotrange", scope: !66, file: !65, line: 96, baseType: !108, size: 32, offset: 2784)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknameslen", scope: !66, file: !65, line: 97, baseType: !44, size: 32, offset: 2816)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "td_inknames", scope: !66, file: !65, line: 98, baseType: !52, size: 64, offset: 2880)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "td_targetprinter", scope: !66, file: !65, line: 99, baseType: !52, size: 64, offset: 2944)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "td_profileLength", scope: !66, file: !65, line: 102, baseType: !56, size: 32, offset: 3008)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "td_profileData", scope: !66, file: !65, line: 103, baseType: !151, size: 64, offset: 3072)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "td_photoshopLength", scope: !66, file: !65, line: 106, baseType: !56, size: 32, offset: 3136)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "td_photoshopData", scope: !66, file: !65, line: 107, baseType: !151, size: 64, offset: 3200)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "td_richtiffiptcLength", scope: !66, file: !65, line: 110, baseType: !56, size: 32, offset: 3264)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "td_richtiffiptcData", scope: !66, file: !65, line: 111, baseType: !151, size: 64, offset: 3328)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagefullwidth", scope: !66, file: !65, line: 114, baseType: !56, size: 32, offset: 3392)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "td_imagefulllength", scope: !66, file: !65, line: 114, baseType: !56, size: 32, offset: 3424)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "td_textureformat", scope: !66, file: !65, line: 115, baseType: !52, size: 64, offset: 3456)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "td_wrapmodes", scope: !66, file: !65, line: 116, baseType: !52, size: 64, offset: 3520)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "td_fovcot", scope: !66, file: !65, line: 117, baseType: !101, size: 32, offset: 3584)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "td_matrixWorldToScreen", scope: !66, file: !65, line: 118, baseType: !136, size: 64, offset: 3648)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "td_matrixWorldToCamera", scope: !66, file: !65, line: 119, baseType: !136, size: 64, offset: 3712)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tif_header", scope: !48, file: !49, line: 93, baseType: !164, size: 64, offset: 4032)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFHeader", file: !57, line: 85, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 81, size: 64, elements: !166)
!166 = !{!167, !168, !169}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_magic", scope: !165, file: !57, line: 82, baseType: !85, size: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_version", scope: !165, file: !57, line: 83, baseType: !85, size: 16, offset: 16)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tiff_diroff", scope: !165, file: !57, line: 84, baseType: !56, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientdir", scope: !48, file: !49, line: 94, baseType: !171, size: 64, offset: 4096)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "tidata_t", file: !49, line: 56, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "tidataval_t", file: !49, line: 55, baseType: !174)
!174 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tif_typeshift", scope: !48, file: !49, line: 95, baseType: !176, size: 64, offset: 4160)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tif_typemask", scope: !48, file: !49, line: 96, baseType: !179, size: 64, offset: 4224)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tif_row", scope: !48, file: !49, line: 97, baseType: !56, size: 32, offset: 4288)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curdir", scope: !48, file: !49, line: 98, baseType: !184, size: 16, offset: 4320)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "tdir_t", file: !47, line: 69, baseType: !85)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curstrip", scope: !48, file: !49, line: 99, baseType: !128, size: 32, offset: 4352)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curoff", scope: !48, file: !49, line: 100, baseType: !60, size: 32, offset: 4384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tif_dataoff", scope: !48, file: !49, line: 101, baseType: !60, size: 32, offset: 4416)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nsubifd", scope: !48, file: !49, line: 103, baseType: !85, size: 16, offset: 4448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tif_subifdoff", scope: !48, file: !49, line: 104, baseType: !60, size: 32, offset: 4480)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tif_col", scope: !48, file: !49, line: 107, baseType: !56, size: 32, offset: 4512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tif_curtile", scope: !48, file: !49, line: 108, baseType: !192, size: 32, offset: 4544)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ttile_t", file: !47, line: 72, baseType: !56)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tif_tilesize", scope: !48, file: !49, line: 109, baseType: !194, size: 32, offset: 4576)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsize_t", file: !47, line: 73, baseType: !61)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupdecode", scope: !48, file: !49, line: 111, baseType: !196, size: 64, offset: 4608)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFBoolMethod", file: !49, line: 59, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tif_predecode", scope: !48, file: !49, line: 112, baseType: !199, size: 64, offset: 4672)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPreMethod", file: !49, line: 60, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!44, !45, !203}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "tsample_t", file: !47, line: 70, baseType: !85)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tif_setupencode", scope: !48, file: !49, line: 113, baseType: !196, size: 64, offset: 4736)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tif_preencode", scope: !48, file: !49, line: 114, baseType: !199, size: 64, offset: 4800)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postencode", scope: !48, file: !49, line: 115, baseType: !196, size: 64, offset: 4864)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decoderow", scope: !48, file: !49, line: 116, baseType: !208, size: 64, offset: 4928)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCodeMethod", file: !49, line: 61, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!44, !45, !171, !194, !203}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encoderow", scope: !48, file: !49, line: 117, baseType: !208, size: 64, offset: 4992)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodestrip", scope: !48, file: !49, line: 118, baseType: !208, size: 64, offset: 5056)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodestrip", scope: !48, file: !49, line: 119, baseType: !208, size: 64, offset: 5120)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tif_decodetile", scope: !48, file: !49, line: 120, baseType: !208, size: 64, offset: 5184)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tif_encodetile", scope: !48, file: !49, line: 121, baseType: !208, size: 64, offset: 5248)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tif_close", scope: !48, file: !49, line: 122, baseType: !218, size: 64, offset: 5312)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVoidMethod", file: !49, line: 58, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !45}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seek", scope: !48, file: !49, line: 123, baseType: !223, size: 64, offset: 5376)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekMethod", file: !49, line: 62, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!44, !45, !56}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tif_cleanup", scope: !48, file: !49, line: 124, baseType: !218, size: 64, offset: 5440)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tif_defstripsize", scope: !48, file: !49, line: 125, baseType: !229, size: 64, offset: 5504)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFStripMethod", file: !49, line: 67, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!56, !45, !56}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tif_deftilesize", scope: !48, file: !49, line: 126, baseType: !234, size: 64, offset: 5568)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFTileMethod", file: !49, line: 68, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !45, !131, !131}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tif_data", scope: !48, file: !49, line: 127, baseType: !171, size: 64, offset: 5632)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlinesize", scope: !48, file: !49, line: 129, baseType: !194, size: 32, offset: 5696)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tif_scanlineskew", scope: !48, file: !49, line: 130, baseType: !194, size: 32, offset: 5728)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdata", scope: !48, file: !49, line: 131, baseType: !171, size: 64, offset: 5760)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawdatasize", scope: !48, file: !49, line: 132, baseType: !194, size: 32, offset: 5824)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcp", scope: !48, file: !49, line: 133, baseType: !171, size: 64, offset: 5888)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tif_rawcc", scope: !48, file: !49, line: 134, baseType: !194, size: 32, offset: 5952)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tif_base", scope: !48, file: !49, line: 136, baseType: !171, size: 64, offset: 6016)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tif_size", scope: !48, file: !49, line: 137, baseType: !60, size: 32, offset: 6080)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tif_mapproc", scope: !48, file: !49, line: 138, baseType: !248, size: 64, offset: 6144)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFMapFileProc", file: !47, line: 206, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!44, !252, !253, !255}
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "thandle_t", file: !47, line: 88, baseType: !151)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "tdata_t", file: !47, line: 74, baseType: !151)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tif_unmapproc", scope: !48, file: !49, line: 139, baseType: !257, size: 64, offset: 6208)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFUnmapFileProc", file: !47, line: 207, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !252, !254, !60}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tif_clientdata", scope: !48, file: !49, line: 141, baseType: !252, size: 64, offset: 6272)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tif_readproc", scope: !48, file: !49, line: 142, baseType: !263, size: 64, offset: 6336)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFReadWriteProc", file: !47, line: 202, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!194, !252, !254, !194}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tif_writeproc", scope: !48, file: !49, line: 143, baseType: !263, size: 64, offset: 6400)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tif_seekproc", scope: !48, file: !49, line: 144, baseType: !269, size: 64, offset: 6464)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSeekProc", file: !47, line: 203, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!60, !252, !60, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tif_closeproc", scope: !48, file: !49, line: 145, baseType: !274, size: 64, offset: 6528)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFCloseProc", file: !47, line: 204, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!44, !252}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tif_sizeproc", scope: !48, file: !49, line: 146, baseType: !279, size: 64, offset: 6592)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFSizeProc", file: !47, line: 205, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!60, !252}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tif_postdecode", scope: !48, file: !49, line: 148, baseType: !284, size: 64, offset: 6656)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPostMethod", file: !49, line: 63, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !45, !171, !194}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tif_fieldinfo", scope: !48, file: !49, line: 150, baseType: !289, size: 64, offset: 6720)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFFieldInfo", file: !65, line: 238, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 229, size: 192, elements: !293)
!293 = !{!294, !296, !298, !299, !316, !319, !322, !323}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "field_tag", scope: !292, file: !65, line: 230, baseType: !295, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ttag_t", file: !47, line: 68, baseType: !56)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "field_readcount", scope: !292, file: !65, line: 231, baseType: !297, size: 16, offset: 32)
!297 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "field_writecount", scope: !292, file: !65, line: 232, baseType: !297, size: 16, offset: 48)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !292, file: !65, line: 233, baseType: !300, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDataType", file: !57, line: 134, baseType: !301)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 120, baseType: !58, size: 32, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!303 = !DIEnumerator(name: "TIFF_NOTYPE", value: 0)
!304 = !DIEnumerator(name: "TIFF_BYTE", value: 1)
!305 = !DIEnumerator(name: "TIFF_ASCII", value: 2)
!306 = !DIEnumerator(name: "TIFF_SHORT", value: 3)
!307 = !DIEnumerator(name: "TIFF_LONG", value: 4)
!308 = !DIEnumerator(name: "TIFF_RATIONAL", value: 5)
!309 = !DIEnumerator(name: "TIFF_SBYTE", value: 6)
!310 = !DIEnumerator(name: "TIFF_UNDEFINED", value: 7)
!311 = !DIEnumerator(name: "TIFF_SSHORT", value: 8)
!312 = !DIEnumerator(name: "TIFF_SLONG", value: 9)
!313 = !DIEnumerator(name: "TIFF_SRATIONAL", value: 10)
!314 = !DIEnumerator(name: "TIFF_FLOAT", value: 11)
!315 = !DIEnumerator(name: "TIFF_DOUBLE", value: 12)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "field_bit", scope: !292, file: !65, line: 234, baseType: !317, size: 16, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !71, line: 34, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !73, line: 32, baseType: !86)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "field_oktochange", scope: !292, file: !65, line: 235, baseType: !320, size: 8, offset: 112)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !71, line: 33, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !73, line: 31, baseType: !174)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "field_passcount", scope: !292, file: !65, line: 236, baseType: !320, size: 8, offset: 120)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "field_name", scope: !292, file: !65, line: 237, baseType: !52, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tif_nfields", scope: !48, file: !49, line: 151, baseType: !44, size: 32, offset: 6784)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tif_vsetfield", scope: !48, file: !49, line: 152, baseType: !326, size: 64, offset: 6848)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVSetMethod", file: !49, line: 64, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!44, !45, !295, !330}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !332)
!332 = !{!333, !334, !335, !336}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !331, file: !2, baseType: !58, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !331, file: !2, baseType: !58, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !331, file: !2, baseType: !151, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !331, file: !2, baseType: !151, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tif_vgetfield", scope: !48, file: !49, line: 153, baseType: !338, size: 64, offset: 6912)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFVGetMethod", file: !49, line: 65, baseType: !327)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tif_printdir", scope: !48, file: !49, line: 154, baseType: !340, size: 64, offset: 6976)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFPrintMethod", file: !49, line: 66, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !45, !344, !181}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !346, line: 7, baseType: !347)
!346 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !348, line: 49, size: 1728, elements: !349)
!348 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !365, !367, !368, !369, !371, !372, !374, !378, !381, !383, !386, !389, !390, !391, !394, !395}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !347, file: !348, line: 51, baseType: !44, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !347, file: !348, line: 54, baseType: !52, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !347, file: !348, line: 55, baseType: !52, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !347, file: !348, line: 56, baseType: !52, size: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !347, file: !348, line: 57, baseType: !52, size: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !347, file: !348, line: 58, baseType: !52, size: 64, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !347, file: !348, line: 59, baseType: !52, size: 64, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !347, file: !348, line: 60, baseType: !52, size: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !347, file: !348, line: 61, baseType: !52, size: 64, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !347, file: !348, line: 64, baseType: !52, size: 64, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !347, file: !348, line: 65, baseType: !52, size: 64, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !347, file: !348, line: 66, baseType: !52, size: 64, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !347, file: !348, line: 68, baseType: !363, size: 64, offset: 768)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !348, line: 36, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !347, file: !348, line: 70, baseType: !366, size: 64, offset: 832)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !347, file: !348, line: 72, baseType: !44, size: 32, offset: 896)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !347, file: !348, line: 73, baseType: !44, size: 32, offset: 928)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !347, file: !348, line: 74, baseType: !370, size: 64, offset: 960)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !73, line: 152, baseType: !181)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !347, file: !348, line: 77, baseType: !86, size: 16, offset: 1024)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !347, file: !348, line: 78, baseType: !373, size: 8, offset: 1040)
!373 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !347, file: !348, line: 79, baseType: !375, size: 8, offset: 1048)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 1)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !347, file: !348, line: 81, baseType: !379, size: 64, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !348, line: 43, baseType: null)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !347, file: !348, line: 89, baseType: !382, size: 64, offset: 1152)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !73, line: 153, baseType: !181)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !347, file: !348, line: 91, baseType: !384, size: 64, offset: 1216)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !348, line: 37, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !347, file: !348, line: 92, baseType: !387, size: 64, offset: 1280)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !348, line: 38, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !347, file: !348, line: 93, baseType: !366, size: 64, offset: 1344)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !347, file: !348, line: 94, baseType: !151, size: 64, offset: 1408)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !347, file: !348, line: 95, baseType: !392, size: 64, offset: 1472)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !393, line: 18, baseType: !74)
!393 = !DIFile(filename: "/usr/local/lib/clang/20/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !347, file: !348, line: 96, baseType: !44, size: 32, offset: 1536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !347, file: !348, line: 98, baseType: !396, size: 160, offset: 1568)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 20)
!399 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !400, retainedTypes: !401, globals: !419, splitDebugInlining: false, nameTableKind: None)
!400 = !{!301}
!401 = !{!70, !52, !151, !60, !402, !56, !85, !254, !194, !128, !317, !297, !181, !113, !131, !410, !44, !411, !412, !413, !414, !415, !416, !417, !61, !136, !101, !418}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIFFDirEntry", file: !57, line: 105, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 100, size: 96, elements: !405)
!405 = !{!406, !407, !408, !409}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tdir_tag", scope: !404, file: !57, line: 101, baseType: !85, size: 16)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tdir_type", scope: !404, file: !57, line: 102, baseType: !85, size: 16, offset: 16)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tdir_count", scope: !404, file: !57, line: 103, baseType: !56, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tdir_offset", scope: !404, file: !57, line: 104, baseType: !56, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !57, line: 60, baseType: !174)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8", file: !57, line: 56, baseType: !373)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16", file: !57, line: 61, baseType: !297)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!419 = !{!0, !7, !9, !14, !19, !24, !29, !34, !39, !420, !425, !430, !435}
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !2, line: 965, type: !422, isLocal: true, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 40)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !2, line: 989, type: !427, isLocal: true, isDefinition: true)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 26)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1003, type: !432, isLocal: true, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 31)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1011, type: !16, isLocal: true, isDefinition: true)
!437 = !{}
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 144, elements: !440)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!440 = !{!441}
!441 = !DISubrange(count: 18)
!442 = !{i32 7, !"Dwarf Version", i32 5}
!443 = !{i32 2, !"Debug Info Version", i32 3}
!444 = !{i32 1, !"wchar_size", i32 4}
!445 = !{i32 8, !"PIC Level", i32 2}
!446 = !{i32 7, !"PIE Level", i32 2}
!447 = !{i32 7, !"uwtable", i32 2}
!448 = !{i32 7, !"frame-pointer", i32 2}
!449 = !{!"clang version 20.1.8 (https://github.com/llvm/llvm-project.git 87f0227cb60147a26a1eeb4fb06e3b505e9c7261)"}
!450 = distinct !DISubprogram(name: "TIFFWriteDirectory", scope: !2, file: !2, line: 91, type: !42, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !399, retainedNodes: !437)
!451 = !DILocalVariable(name: "tif", arg: 1, scope: !450, file: !2, line: 91, type: !45)
!452 = !DILocation(line: 91, column: 26, scope: !450)
!453 = !DILocalVariable(name: "dircount", scope: !450, file: !2, line: 93, type: !85)
!454 = !DILocation(line: 93, column: 9, scope: !450)
!455 = !DILocalVariable(name: "diroff", scope: !450, file: !2, line: 94, type: !56)
!456 = !DILocation(line: 94, column: 9, scope: !450)
!457 = !DILocalVariable(name: "tag", scope: !450, file: !2, line: 95, type: !295)
!458 = !DILocation(line: 95, column: 9, scope: !450)
!459 = !DILocalVariable(name: "nfields", scope: !450, file: !2, line: 96, type: !56)
!460 = !DILocation(line: 96, column: 9, scope: !450)
!461 = !DILocalVariable(name: "dirsize", scope: !450, file: !2, line: 97, type: !194)
!462 = !DILocation(line: 97, column: 10, scope: !450)
!463 = !DILocalVariable(name: "data", scope: !450, file: !2, line: 98, type: !52)
!464 = !DILocation(line: 98, column: 8, scope: !450)
!465 = !DILocalVariable(name: "dir", scope: !450, file: !2, line: 99, type: !402)
!466 = !DILocation(line: 99, column: 16, scope: !450)
